--guild_redpacket

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --红包id-int 
  name = 2,    --红包名称-string 
  index = 3,    --红包排序-int 
  type = 4,    --红包类型-int 
  value = 5,    --数量-int 
  number = 6,    --默认红包个数-int 
  gold = 7,    --默认红包金额-int 
  show = 8,    --红包外形-int 

}

-- key type
local __key_type = {
  id = "int",    --红包id-1 
  name = "string",    --红包名称-2 
  index = "int",    --红包排序-3 
  type = "int",    --红包类型-4 
  value = "int",    --数量-5 
  number = "int",    --默认红包个数-6 
  gold = "int",    --默认红包金额-7 
  show = "int",    --红包外形-8 

}


-- data
local guild_redpacket = {
    _data = {
        [1] = {101,"竞技场王者",1,1,1,10,200,1,},
        [2] = {702,"全员紫色装备",2,7,4,10,500,1,},
        [3] = {703,"全员橙色装备",3,7,5,20,2000,1,},
        [4] = {704,"全员红色装备",4,7,6,20,5000,1,},
        [5] = {801,"司马官衔",5,8,2,5,100,1,},
        [6] = {802,"都尉官衔",6,8,3,10,300,1,},
        [7] = {803,"校尉官衔",7,8,4,10,400,1,},
        [8] = {804,"太守官衔",8,8,5,10,500,1,},
        [9] = {805,"刺史官衔",9,8,6,10,600,1,},
        [10] = {806,"中郎将官衔",10,8,7,20,1500,1,},
        [11] = {807,"京兆尹官衔",11,8,8,20,2000,1,},
        [12] = {808,"尚书令官衔",12,8,9,20,2500,1,},
        [13] = {809,"卫将军官衔",13,8,10,20,3000,1,},
        [14] = {810,"大都督官衔",14,8,11,20,5000,1,},
        [15] = {811,"大将军官衔",15,8,12,20,8000,1,},
        [16] = {1106,"激活30条名将册",16,11,30,20,2000,1,},
        [17] = {1107,"激活36条名将册",17,11,36,20,5000,1,},
        [18] = {1901,"首次充值",18,19,1,5,100,1,},
        [19] = {2001,"VIP 3",19,20,3,5,100,1,},
        [20] = {2002,"VIP 5",20,20,5,10,300,1,},
        [21] = {2003,"VIP 6",21,20,6,10,500,1,},
        [22] = {2004,"VIP 7",22,20,7,20,2000,1,},
        [23] = {2005,"VIP 8",23,20,8,20,4000,1,},
        [24] = {2006,"VIP 9",24,20,9,20,6000,1,},
        [25] = {2007,"VIP 10",25,20,10,20,8000,1,},
        [26] = {2008,"VIP 11",26,20,11,30,10000,1,},
        [27] = {2009,"VIP 12",27,20,12,30,12000,1,},
        [28] = {2010,"VIP 13",28,20,13,30,15000,1,},
        [29] = {2011,"VIP 14",29,20,14,30,18000,1,},
        [30] = {2012,"VIP 15",30,20,15,30,20000,1,},
        [31] = {2013,"VIP 16",31,20,16,30,24000,1,},
        [32] = {2201,"成长基金第一期",32,22,1,5,100,1,},
        [33] = {2202,"成长基金第二期",33,22,2,10,300,1,},
        [34] = {2203,"成长基金第三期",34,22,3,10,400,1,},
        [35] = {2204,"成长基金第四期",35,22,4,10,400,1,},
        [36] = {2205,"成长基金第五期",36,22,5,10,400,1,},
        [37] = {2206,"成长基金第六期",37,22,6,10,400,1,},
        [38] = {2207,"成长基金第七期",38,22,7,10,400,1,},
        [39] = {2208,"成长基金第八期",39,22,8,10,400,1,},
        [40] = {2209,"成长基金第九期",40,22,9,10,400,1,},
        [41] = {2210,"成长基金第十期",41,22,10,10,400,1,},
        [42] = {2211,"成长基金十一期",42,22,11,10,400,1,},
        [43] = {2212,"成长基金十二期",43,22,12,10,400,1,},
        [44] = {2213,"成长基金十三期",44,22,13,10,400,1,},
        [45] = {2214,"成长基金十四期",45,22,14,10,400,1,},
        [46] = {2215,"成长基金十五期",46,22,15,10,400,1,},
        [47] = {2216,"成长基金十六期",47,22,16,10,400,1,},
        [48] = {2217,"成长基金十七期",48,22,17,10,400,1,},
        [49] = {2301,"黄金宝箱·橙装",49,23,1,5,100,1,},
        [50] = {2401,"黄金宝箱·红装",50,24,1,10,500,1,},
        [51] = {10101,"豪华周卡",51,101,1,5,100,1,},
        [52] = {10201,"至尊月卡",52,102,1,5,200,1,},
        [53] = {10301,"周每日礼包",53,103,1,5,300,1,},
        [54] = {10401,"军团BOSS第一",54,104,1,10,200,1,},
        [55] = {99,"狂欢大红包",55,99,0,100,500,2,},
        [56] = {1,"红色整将一口价",56,99,0,50,500,2,},
        [57] = {2,"红将碎片一口价",57,99,0,20,500,2,},
        [58] = {3,"红色神兵一口价",58,99,0,20,500,2,},
        [59] = {4,"红色万能神兵一口价",59,99,0,20,500,2,},
        [60] = {5,"春秋一口价",60,99,0,20,500,2,},
        [61] = {6,"战国一口价",61,99,0,20,500,2,},
        [62] = {7,"红锦囊一口价",62,99,0,50,500,2,},
        [63] = {8,"橙锦囊一口价",63,99,0,30,500,2,},
        [64] = {9,"择贤令一口价",64,99,0,30,500,2,},
        [65] = {10,"择贤举善令一口价",65,99,0,40,500,2,},
        [66] = {11001,"新春红包雨",66,100,0,0,0,1,},
        [67] = {11002,"新春红包雨",66,100,0,0,0,2,},
        [68] = {7101,"见龙在田总积分第一",67,7101,1,100,150000,2,},
        [69] = {7102,"见龙在田总积分第二",68,7102,1,100,90000,2,},
        [70] = {7103,"见龙在田总积分第三",69,7103,1,100,60000,2,},
        [71] = {7104,"见龙在田总积分第四至十",70,7104,1,100,30000,2,},
        [72] = {7201,"欢乐抽奖积分第一",71,7201,1,50,50000,2,},
        [73] = {7202,"欢乐抽奖积分第二",72,7202,1,50,30000,2,},
        [74] = {7203,"欢乐抽奖积分第三",73,7203,1,50,20000,2,},
        [75] = {3101,"周年庆第一军团",78,3101,0,50,20000,1,},
        [76] = {3102,"周年庆第二军团",79,3102,0,50,10000,1,},
        [77] = {3103,"周年庆第三军团",79,3103,0,50,5000,1,},
        [78] = {3401,"跨服周年庆第一军团",71,3401,0,50,50000,1,},
        [79] = {3402,"跨服周年庆第二军团",72,3402,0,50,30000,1,},
        [80] = {3403,"跨服周年庆第三军团",73,3403,0,50,20000,1,},
        [81] = {3404,"跨服周年庆强力军团",74,3404,0,50,10000,1,},
        [82] = {3405,"跨服周年庆强力军团",75,3405,0,50,10000,1,},
    }
}

-- index
local __index_id = {
    [1] = 56,
    [10] = 65,
    [101] = 1,
    [10101] = 51,
    [10201] = 52,
    [10301] = 53,
    [10401] = 54,
    [11001] = 66,
    [11002] = 67,
    [1106] = 16,
    [1107] = 17,
    [1901] = 18,
    [2] = 57,
    [2001] = 19,
    [2002] = 20,
    [2003] = 21,
    [2004] = 22,
    [2005] = 23,
    [2006] = 24,
    [2007] = 25,
    [2008] = 26,
    [2009] = 27,
    [2010] = 28,
    [2011] = 29,
    [2012] = 30,
    [2013] = 31,
    [2201] = 32,
    [2202] = 33,
    [2203] = 34,
    [2204] = 35,
    [2205] = 36,
    [2206] = 37,
    [2207] = 38,
    [2208] = 39,
    [2209] = 40,
    [2210] = 41,
    [2211] = 42,
    [2212] = 43,
    [2213] = 44,
    [2214] = 45,
    [2215] = 46,
    [2216] = 47,
    [2217] = 48,
    [2301] = 49,
    [2401] = 50,
    [3] = 58,
    [3101] = 75,
    [3102] = 76,
    [3103] = 77,
    [3401] = 78,
    [3402] = 79,
    [3403] = 80,
    [3404] = 81,
    [3405] = 82,
    [4] = 59,
    [5] = 60,
    [6] = 61,
    [7] = 62,
    [702] = 2,
    [703] = 3,
    [704] = 4,
    [7101] = 68,
    [7102] = 69,
    [7103] = 70,
    [7104] = 71,
    [7201] = 72,
    [7202] = 73,
    [7203] = 74,
    [8] = 63,
    [801] = 5,
    [802] = 6,
    [803] = 7,
    [804] = 8,
    [805] = 9,
    [806] = 10,
    [807] = 11,
    [808] = 12,
    [809] = 13,
    [810] = 14,
    [811] = 15,
    [9] = 64,
    [99] = 55,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in guild_redpacket")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function guild_redpacket.length()
    return #guild_redpacket._data
end

-- 
function guild_redpacket.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function guild_redpacket.indexOf(index)
    if index == nil or not guild_redpacket._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/guild_redpacket.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "guild_redpacket" )
        return setmetatable({_raw = guild_redpacket._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = guild_redpacket._data[index]}, mt)
end

--
function guild_redpacket.get(id)
    
    return guild_redpacket.indexOf(__index_id[id])
        
end

--
function guild_redpacket.set(id, key, value)
    local record = guild_redpacket.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function guild_redpacket.index()
    return __index_id
end

return guild_redpacket