--item

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --道具id-int 
  name = 2,    --道具名称-string 
  item_type = 3,    --道具类型-int 
  item_value = 4,    --道具类型值-int 
  key_value = 5,    --钥匙参数-string 
  res_id = 6,    --道具图标id-int 
  color = 7,    --道具品质-int 
  description = 8,    --道具描述-string 
  bag_description = 9,    --背包道具描述-string 
  button_type = 10,    --按钮类型-int 
  function_id = 11,    --跳转功能id-int 
  button_txt = 12,    --按钮文字-string 
  item_sorting = 13,    --排序-int 
  reward_type = 14,    --奖励界面类型-int 
  tips = 15,    --提示文字-string 
  show_type = 16,    --礼包表现-int 
  if_add = 17,    --是否添加红点-int 
  spill = 18,    --背包溢出复合类型判断（第1为代表武将，第2位代表装备，第3位代表宝物，第4位代表神兵-string 
  gm_note = 19,    --GM公告-int 
  destroy_time = 20,    --销毁日期-int 
  level_limit = 21,    --使用等级-int 
  moving = 22,    --道具特效-string 
  recycle_type = 23,    --回收资源货币类型-int 
  recycle_value = 24,    --回收资源货币名称-int 
  recycle_size = 25,    --回收资源货币数量-int 
  sell_order = 26,    --出售排序-int 
  limit_type = 27,    --限制类型-int 
  limit_num = 28,    --限制次数-int 
  use_type = 29,    --使用方式-int 

}

-- key type
local __key_type = {
  id = "int",    --道具id-1 
  name = "string",    --道具名称-2 
  item_type = "int",    --道具类型-3 
  item_value = "int",    --道具类型值-4 
  key_value = "string",    --钥匙参数-5 
  res_id = "int",    --道具图标id-6 
  color = "int",    --道具品质-7 
  description = "string",    --道具描述-8 
  bag_description = "string",    --背包道具描述-9 
  button_type = "int",    --按钮类型-10 
  function_id = "int",    --跳转功能id-11 
  button_txt = "string",    --按钮文字-12 
  item_sorting = "int",    --排序-13 
  reward_type = "int",    --奖励界面类型-14 
  tips = "string",    --提示文字-15 
  show_type = "int",    --礼包表现-16 
  if_add = "int",    --是否添加红点-17 
  spill = "string",    --背包溢出复合类型判断（第1为代表武将，第2位代表装备，第3位代表宝物，第4位代表神兵-18 
  gm_note = "int",    --GM公告-19 
  destroy_time = "int",    --销毁日期-20 
  level_limit = "int",    --使用等级-21 
  moving = "string",    --道具特效-22 
  recycle_type = "int",    --回收资源货币类型-23 
  recycle_value = "int",    --回收资源货币名称-24 
  recycle_size = "int",    --回收资源货币数量-25 
  sell_order = "int",    --出售排序-26 
  limit_type = "int",    --限制类型-27 
  limit_num = "int",    --限制次数-28 
  use_type = "int",    --使用方式-29 

}


-- data
local item = {
    _data = {
        [1] = {1,"体力丹",1,1,"",1,5,"十全大补丸，使用后立刻恢复25点体力。","使用可恢复25点体力。",1,0,"使  用",18,0,"使用成功！恭喜主公体力充沛！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [2] = {2,"精力丹",1,2,"",2,5,"皇宫里的御用圣药，使用后立刻恢复10点精力。","使用后获得10点精力。",1,0,"使  用",19,0,"使用成功！恭喜主公精力充沛！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [3] = {3,"突破丹",3,0,"",3,5,"采用名贵中药凝练而成，能帮助武将突破的神丹。","武将突破所需的十全大补丸。",1,130,"去突破",290,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [4] = {4,"粮草令",1,4,"",41,5,"兵马未动粮草先行，使用可获得100粮草。","使用可获得100粮草。",1,0,"使  用",19,0,"使用成功！我军粮草充足！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [5] = {5,"刷新令",3,0,"",5,4,"大汉王朝监制的令牌，用于刷新武将商店的商品。","用于刷新武将商店。",0,0,"",340,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [6] = {6,"招募榜",3,0,"",6,3,"用先天灵宝打造，使用后可进行一次招募。","使用后可进行一次战将招募。",1,11,"去招募",200,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [7] = {7,"招贤榜",3,0,"",7,5,"用先天至宝打造，使用后可进行一次名将招募。","使用后可进行一次名将招募。",1,11,"去招募",201,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [8] = {10,"宝物精炼石",3,0,"",10,5,"采自西域雪山的神奇矿石，可用于宝物的精炼。","神奇的矿石，可用于宝物的精炼。",1,132,"去精炼",300,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [9] = {11,"低级精炼石",4,5,"",11,2,"用于装备精炼，可增加5点精炼值。","用于装备精炼，增加5精炼值。",1,131,"去精炼",363,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [10] = {12,"中级精炼石",4,10,"",12,3,"用于装备精炼，可增加10点精炼值。","用于装备精炼，增加10精炼值。",1,131,"去精炼",362,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [11] = {13,"高级精炼石",4,25,"",13,4,"用于装备精炼，可增加25点精炼值。","用于装备精炼，增加25精炼值。",1,131,"去精炼",361,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [12] = {14,"稀有精炼石",4,50,"",14,5,"用于装备精炼，可增加50点精炼值。","用于装备精炼，增加50精炼值。",1,131,"去精炼",360,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [13] = {15,"南蛮令",5,1,"",15,4,"汉王朝颁发的特殊军令，讨伐南蛮贼匪的必须品。","使用后增加一枚南蛮讨伐令。",1,0,"使  用",350,0,"使用成功！围剿次数增加了！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [14] = {18,"装备精华",3,0,"",18,5,"在装备商店兑换高级装备必备的材料。","在装备商店兑换神装必备的材料。",0,0,"",310,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [15] = {19,"神兵进阶石",3,0,"",19,5,"神兵进阶的必备材料。","神兵进阶的必备材料。",1,135,"去进阶",320,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [16] = {20,"黄金钥匙",8,0,"21",20,5,"想打开黄金宝箱就要有黄金钥匙。","想打开黄金宝箱就要有黄金钥匙。",1,0,"使  用",41,1,"主公，没有黄金宝箱了",0,0,"",0,0,30,"",0,0,0,0,0,0,0,},
        [17] = {21,"黄金宝箱",8,300,"20",21,5,"打开黄金宝箱有概率获得红装哦。","打开黄金宝箱有概率获得红装哦。",1,0,"使  用",41,1,"主公，没有黄金钥匙了",0,0,"",0,0,30,"",0,0,0,0,0,0,0,},
        [18] = {22,"名将令",3,0,"",22,5,"主角晋升官衔所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",225,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [19] = {23,"郡守印",3,0,"",23,2,"主角晋升都尉、校尉所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",224,0,"",0,0,"",0,0,0,"",5,1,180,1,0,0,0,},
        [20] = {24,"刺史印",3,0,"",24,3,"主角晋升太守、刺史所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",223,0,"",0,0,"",0,0,0,"",5,1,360,2,0,0,0,},
        [21] = {25,"将军印",3,0,"",25,4,"主角晋升中郎将、京兆尹所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",222,0,"",0,0,"",0,0,0,"",5,1,720,3,0,0,0,},
        [22] = {26,"都督印",3,0,"",26,5,"主角晋升尚书令、卫将军所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",221,0,"",0,0,"",0,0,0,"",5,1,1440,4,0,0,0,},
        [23] = {27,"帝皇印",3,0,"",27,6,"主角晋升大都督、大将军所需要的道具。","可用于主角晋升官衔。",1,13,"去晋升",220,0,"",0,0,"",0,0,0,"",5,1,2880,5,0,0,0,},
        [24] = {28,"初级神兽经验",10,200,"",28,2,"神兽升级所需要的道具，使用可获得200神兽经验。","用于神兽升级，可获得200神兽经验。",1,943,"去升级",403,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [25] = {29,"中级神兽经验",10,1000,"",29,3,"神兽升级所需要的道具，使用可获得1000神兽经验。","用于神兽升级，可获得1000神兽经验。",1,943,"去升级",402,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [26] = {30,"高级神兽经验",10,5000,"",30,4,"神兽升级所需要的道具，使用可获得5000神兽经验。","用于神兽升级，可获得5000神兽经验。",1,943,"去升级",401,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [27] = {31,"稀有神兽经验",10,20000,"",31,5,"神兽升级所需要的道具，使用可获得20000神兽经验。","用于神兽升级，可获得20000神兽经验。",1,943,"去升级",400,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [28] = {32,"神兽升星石",3,0,"",32,5,"神兽升星所需要的道具。","神兽升星所需要的道具。",1,943,"去升星",330,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [29] = {33,"支持券",3,0,"",33,4,"用于华容道中支持武将，并可在水晶商店兑换水晶。","华容道支持武将用道具，可兑换水晶",1,617,"去兑换",45,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [30] = {40,"觉醒丹",3,0,"",40,5,"武将觉醒所需要的道具。","武将觉醒所需要的道具。",1,130,"去觉醒",330,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [31] = {41,"置换符",3,0,"",50,5,"橙色武将相互置换时消耗的基础道具。","橙色武将相互置换时消耗的基础道具。",1,33,"去置换",500,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [32] = {42,"择贤令",3,0,"",51,5,"跨阵营橙色武将相互置换时需要的道具。","跨阵营橙色武将相互置换时需要的道具。",1,33,"去置换",500,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [33] = {43,"择贤举善令",3,0,"",52,6,"跨阵营红色武将相互置换时消耗的高级道具。","跨阵营红色武将相互置换时消耗的高级道具。",1,33,"去置换",500,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [34] = {44,"神·置换符",3,0,"",53,6,"红色武将相互置换时消耗的基础道具。","红色武将相互置换时消耗的基础道具。",1,33,"去置换",500,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [35] = {61,"三年杜康",6,200,"",61,2,"武将升级所需要的道具，使用可获得200武将经验。","用于武将升级，可获得200武将经验。",1,130,"去升级",403,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [36] = {62,"五年杜康",6,1000,"",62,3,"武将升级所需要的道具，使用可获得1000武将经验。","用于武将升级，可获得1000武将经验。",1,130,"去升级",402,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [37] = {63,"十年杜康",6,5000,"",63,4,"武将升级所需要的道具，使用可获得5000武将经验。","用于武将升级，可获得5000武将经验。",1,130,"去升级",401,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [38] = {64,"百年杜康",6,20000,"",64,5,"武将升级所需要的道具，使用可获得20000武将经验。","用于武将升级，可获得20000武将经验。",1,130,"去升级",400,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [39] = {71,"石砚台",7,100,"",71,2,"宝物升级所需要的道具，使用可获得100宝物经验。","用于宝物升级，可获得100宝物经验。",1,132,"去强化",413,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [40] = {72,"银砚台",7,500,"",72,3,"宝物升级所需要的道具，使用可获得500宝物经验。","用于宝物升级，可获得500宝物经验。",1,132,"去强化",412,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [41] = {73,"金砚台",7,2500,"",73,4,"宝物升级所需要的道具，使用可获得2500宝物经验。","用于宝物升级，可获得2500宝物经验。",1,132,"去强化",411,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [42] = {74,"玉砚台",7,10000,"",74,5,"宝物升级所需要的道具，使用可获得10000宝物经验。","用于宝物升级，可获得10000宝物经验。",1,132,"去强化",410,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [43] = {80,"橙色万能神兵",3,0,"",80,5,"能代替任何橙色神兵，用作进阶材料。","能代替任何橙色神兵，用作进阶材料。",1,135,"去进阶",280,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [44] = {81,"红色万能神兵",3,0,"",81,6,"能代替任何红色神兵，用作进阶材料。","能代替任何红色神兵，用作进阶材料。",1,135,"去进阶",279,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [45] = {706,"金色万能神兵",3,0,"",706,7,"能代替任何金色神兵，用作进阶材料","能代替任何金色神兵，用作进阶材料",1,135,"去进阶",278,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [46] = {82,"变身卡精华",3,0,"",80,5,"变身卡精华，用作变身卡升级。","变身卡精华，用作变身卡升级。",1,86,"去强化",281,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [47] = {83,"化形羽",3,0,"",83,4,"带有阴阳之力的羽毛，可在变身卡商店兑换任意紫色变身卡。","可在变身卡商店兑换任意紫色变身卡。",1,96,"去兑换",282,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [48] = {84,"三清化形羽",3,0,"",84,5,"带有乾坤之力的羽毛，可在变身卡商店兑换任意橙色变身卡。","可在变身卡商店兑换任意橙色变身卡。",1,96,"去兑换",283,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [49] = {85,"玄天八卦",3,0,"",85,5,"带有玄天之力的八卦，可在身外化身活动中进行变身卡夺宝。","可在身外化身活动中进行变身卡夺宝。",1,96,"去夺宝",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [50] = {86,"曹操战袍",3,0,"",86,5,"追击曹操获得的战利品，可在套装商店兑换橙色、红色套装。","可在套装商店兑换橙色、红色套装",1,100,"去兑换",285,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [51] = {87,"八宝粽",1,720,"",87,5,"参与军团活动、攻打副本、充值都有概率获得的礼包。","开启可获得各种稀缺资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [52] = {88,"香囊",3,0,"",88,4,"参与欢庆端午举办的活动获得，可兑换稀缺道具。","用于在欢庆端午活动中兑换稀缺道具。",0,0,"",40,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [53] = {89,"神兽精华",3,0,"",89,5,"卧龙观星所得之物，可在观星商店中兑换橙色神兽。","可在观星商店中兑换橙色神兽",1,961,"去兑换",285,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [54] = {90,"爽口西瓜",1,720,"",90,5,"参与军团活动、攻打副本、充值都有概率获得的礼包。","开启可获得各种稀缺资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [55] = {91,"爱心狗粮",1,720,"",91,5,"参与军团活动、攻打副本、充值都有概率获得的礼包。","开启可获得各种稀缺资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [56] = {92,"春秋",3,0,"",92,5,"古代儒家典籍，记载各诸侯国重大历史事件，用于橙将界限突破升红将。","用于橙将界限突破升红将的道具。",1,130,"使  用",22,0,"",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [57] = {93,"战国",3,0,"",93,5,"古代国别体著作，记述战国时期游说之士的言行策略，用于橙将界限突破升红将。","用于橙将界限突破升红将的道具。",1,130,"使  用",23,0,"",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [58] = {94,"卧龙占星盘",3,0,"",94,5,"据说可以测出明天的天气。可在卧龙观星活动中进行观星。","可在卧龙观星活动中进行观星。",1,961,"去观星",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [59] = {95,"红羽穿心箭",3,0,"",95,5,"比一般的箭更扎心。可在割须弃袍活动中追击曹操。","可在割须弃袍活动中追击曹操。",1,199,"去追击",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [60] = {96,"中秋月饼",1,720,"",96,5,"参与军团活动、攻打副本、充值都有概率获得的礼包。","开启可获得各种稀缺资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [61] = {97,"伯乐相马经",3,0,"",97,5,"相马所需要的材料，可在相马中获得战马、千里良驹哨、银马哨和元宝等","相马可获得战马、千里良驹哨、银马哨和元宝等",1,995,"使  用",43,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [62] = {98,"千里良驹哨",3,0,"",98,5,"可在商店中兑换橙色品质战马","可在商店中兑换橙色品质战马",1,993,"去兑换",43,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [63] = {99,"银马哨",3,0,"",99,4,"64个银马哨可在商店中兑换1个千里良驹哨","64个银马哨可在商店中兑换1个千里良驹哨",1,993,"去兑换",43,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [64] = {100,"欢乐气球",1,720,"",100,5,"欢乐庆典期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [65] = {101,"武将经验礼包",1,101,"",101,5,"陈年佳酿，打开可获得高级武将经验道具。","打开可获得高级武将经验道具。",1,0,"使  用",60,1,"",0,1,"1|0|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [66] = {102,"宝物经验礼盒",1,102,"",102,4,"精心打造的墨宝，打开获得高级宝物经验道具。","打开获得高级宝物经验道具。",1,0,"使  用",61,1,"",0,1,"0|0|1|0",0,0,0,"",0,0,0,0,0,0,0,},
        [67] = {103,"四大红将任选箱",2,103,"",10002,6,"可以从司马懿、赵云、孙策、左慈中任选一人。","可从司马懿、赵云、孙策、左慈中任选一人。",1,0,"使  用",64,1,"",0,1,"1|0|0|0",0,0,0,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [68] = {104,"紫色宝物任选箱",2,104,"",10021,4,"可任选一件紫色的宝物。","可任选一件紫色的宝物。",1,0,"使  用",69,1,"",0,1,"0|0|1|0",0,0,0,"",0,0,0,0,0,0,0,},
        [69] = {105,"橙将任选宝箱",2,203,"",10001,5,"可以从四个阵营中任选一名橙将。","可以从四个阵营中任选一名橙将。",1,0,"使  用",66,1,"",0,1,"1|0|0|0",0,0,0,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [70] = {106,"蓝色装备宝箱",1,106,"",10031,3,"打开可获得一套蓝色装备：寒冰剑、环锁铠、亮银盔、貂皮靴。","打开可获得一套蓝色装备。",1,0,"使  用",63,1,"",0,1,"0|1|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [71] = {107,"橙色神兵任选箱",2,107,"",10042,5,"可以任选一件橙色的神兵。","可以任选一件橙色的神兵。",1,0,"使  用",67,1,"",0,1,"0|0|0|1",0,0,46,"",0,0,0,0,0,0,0,},
        [72] = {108,"红色神兵任选箱",2,108,"",10041,6,"可以任选一件红色的神兵。","可以任选一件红色的神兵。",1,0,"使  用",66,1,"",0,1,"0|0|0|1",0,0,46,"",0,0,0,0,0,0,0,},
        [73] = {109,"橙色宝物任选箱",2,109,"",10022,5,"可以任选一件橙色的宝物。","可以任选一件橙色的宝物。",1,0,"使  用",68,1,"",0,1,"0|0|0|1",0,0,0,"",0,0,0,0,0,0,0,},
        [74] = {110,"红将任选宝箱",2,110,"",10002,6,"可以从司马懿、曹操、赵云、诸葛亮、孙策、周瑜、左慈、吕布中任选一人！","可以从8个红将中任选一人。",1,0,"使  用",65,1,"",0,1,"1|0|0|0",0,0,0,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [75] = {111,"橙色装备宝箱",1,330,"",10032,5,"有概率开出橙色装备碎片。","有概率开出橙色装备碎片。",1,0,"使  用",62,1,"",0,1,"0|1|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [76] = {112,"随机橙将宝箱",1,112,"",10032,5,"可以随机开出一名橙将。","可以随机开出一名橙将。",1,0,"使  用",67,1,"",0,1,"1|0|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [77] = {113,"随机紫将宝箱",1,113,"",10001,4,"可以随机开出一名紫将。","可以随机开出一名紫将。",1,0,"使  用",69,1,"",0,1,"1|0|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [78] = {114,"紫将任选宝箱",2,114,"",10001,4,"可以任选一名紫色武将。","可以任选一名紫色武将。",1,0,"使  用",68,1,"",0,1,"1|0|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [79] = {115,"军功宝箱",1,334,"",115,5,"积极参与军团战可获得，打开可以获得各种道具。","积极参与军团战可获得，打开可以获得各种道具。",1,0,"使  用",74,1,"",0,1,"0|1|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [80] = {116,"双紫宝物宝箱",1,116,"",10021,4,"打开可以获得司马法和腾蛇符各一件。","打开可以获得司马法和腾蛇符各一件。",1,0,"使  用",70,1,"",0,1,"0|0|1|0",0,0,0,"",0,0,0,0,0,0,0,},
        [81] = {117,"紫色锦囊任选箱",2,301,"",10051,4,"可以任选一个紫色的锦囊。","可以任选一个紫色的锦囊。",1,0,"使  用",73,1,"",0,1,"",0,0,58,"",0,0,0,0,0,0,0,},
        [82] = {118,"橙色锦囊任选箱",2,302,"",10052,5,"可以任选一个橙色的锦囊。","可以任选一个橙色的锦囊。",1,0,"使  用",72,1,"",0,1,"",0,0,58,"",0,0,0,0,0,0,0,},
        [83] = {119,"锦囊宝箱",1,600,"",10052,5,"打开宝箱，必得紫色或橙色锦囊。","随机获得一个锦囊。",1,0,"使  用",71,1,"",0,1,"",0,0,58,"",0,0,0,0,0,0,0,},
        [84] = {120,"红将碎片任选箱",2,120,"",10002,6,"可以从司马懿、曹操、赵云、诸葛亮、孙策、周瑜、左慈、吕布的碎片中任选一片。","可以任选一片红色武将的碎片。",1,0,"使  用",64,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [85] = {121,"破军碎片任选箱",2,121,"",10032,5,"可以任选一片破军套装装备的碎片。","可以任选一片破军套装装备的碎片。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [86] = {122,"四神碎片任选箱",2,122,"",10033,6,"可以任选一片四神套装装备的碎片。","可以任选一片四神套装装备的碎片。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [87] = {123,"橙色兵书任选箱",2,123,"",10022,5,"可以从孙子兵法、武侯新书、孟德新书、太平要术中任选一件橙色宝物。","可以从任选一件橙色兵书。",1,0,"使  用",68,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [88] = {124,"橙色兵符任选箱",2,124,"",10022,5,"可以从青龙符、白虎符、朱雀符、玄武符中任选一件橙色宝物。","可以从任选一件橙色兵符。",1,0,"使  用",68,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [89] = {125,"真武碎片任选箱",2,125,"",10032,5,"可以从真武、乾坤、无双、混元橙装碎片中任选一片","可以从真武、乾坤、无双、混元橙装碎片中任选一片",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [90] = {126,"橙将碎片任选箱",2,126,"",10001,5,"可以任选一片橙色武将碎片。","可以任选一片橙色武将碎片。",1,0,"使  用",66,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [91] = {127,"真武橙装任选箱",2,127,"",10032,5,"可以从橙色装备真武、乾坤、无双和混元中任选一件。","可以从橙色装备真武、乾坤、无双和混元中任选一件。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [92] = {128,"清霜橙装任选箱",2,128,"",10032,5,"可以从橙色装备清霜、玲珑、九霄和碧玉中任选一件。","可以从橙色装备清霜、玲珑、九霄和碧玉中任选一件。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [93] = {129,"破军套装任选箱",2,129,"",10032,5,"可以从橙色装备破军七杀枪、破军贪狼甲、破军银狮盔和破军踏天靴中任选一件。","可以从破军套装中任选一件。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [94] = {130,"清霜碎片任选箱",2,130,"",10032,5,"可以从清霜、玲珑、九霄、碧玉橙装碎片中任意选取一件。","打开可任意选取一件高级橙装碎片。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [95] = {131,"四神套装任选宝箱",2,131,"",10033,6,"可以任意选取一件四神红装。","可以任意选取一件四神红装。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [96] = {132,"四神套装随机宝箱",1,132,"",10033,6,"打开随机获得一件四神套装装备。","打开随机获得一件四神套装装备。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [97] = {133,"破军套装随机宝箱",1,133,"",10032,5,"打开随机获得一件破军套装装备。","打开随机获得一件破军套装装备。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [98] = {134,"清霜橙装随机箱",1,134,"",10032,5,"可以从清霜、玲珑、九霄和碧玉橙装中随机获取一件。","打开随机获取一件高级橙装。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [99] = {135,"清霜碎片随机箱",1,135,"",10032,5,"可以从清霜、玲珑、九霄、碧玉橙装碎片中随机获取一件。","打开随机获取一件高级橙装碎片。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [100] = {136,"真武橙装随机箱",1,136,"",10032,5,"可以从真武、乾坤、无双和混元橙装中随机获取一件。","打开随机获取一件初级橙装。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [101] = {137,"真武碎片随机箱",1,137,"",10032,5,"可以从真武、乾坤、无双、混元橙装碎片中随机获取一件。","打开随机获取一件初级橙装碎片。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [102] = {138,"豪华装备宝箱",1,138,"",10034,5,"开启有几率获取高品质装备。","开启有几率获取高品质装备。",1,0,"使  用",62,1,"",0,1,"",0,0,0,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [103] = {139,"红色锦囊任选箱",2,139,"",10053,6,"可以从红色锦囊中任选一个。","可以从红色锦囊中任选一个。",1,0,"使  用",62,1,"",0,1,"",0,0,58,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [104] = {140,"橙将随机宝箱",1,17,"",10001,5,"可以随机获得一名橙色武将。","可以随机获得一名橙色武将。",1,0,"使  用",66,1,"",0,1,"1|0|0|0",0,0,0,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [105] = {141,"绿色材料任选箱",2,141,"",141,2,"可以任选一件绿色的神树材料。","可以任选一件绿色的神树材料。",1,0,"使  用",80,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [106] = {142,"蓝色材料任选箱",2,142,"",142,3,"可以任选一件蓝色的神树材料。","可以任选一件蓝色的神树材料。",1,0,"使  用",81,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [107] = {143,"紫色材料任选箱",2,143,"",143,4,"可以任选一件紫色的神树材料。","可以任选一件紫色的神树材料。",1,0,"使  用",82,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [108] = {144,"橙色材料任选箱",2,144,"",144,5,"可以任选一件橙色的神树材料。","可以任选一件橙色的神树材料。",1,0,"使  用",83,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [109] = {145,"红色材料任选箱",2,145,"",145,6,"可以任选一件红色的神树材料。","可以任选一件红色的神树材料。",1,0,"使  用",84,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [110] = {146,"春秋战国任选箱",2,146,"",10034,5,"可以任选一件春秋、战国。","可以任选一件春秋、战国。",1,0,"使  用",86,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [111] = {147,"惊鸿化形羽",3,0,"",147,6,"带有惊鸿之力的羽毛，可在变身卡商店兑换任意红色变身卡。","可在变身卡商店兑换任意红色变身卡。",1,96,"去兑换",283,0,"",0,0,"",0,0,0,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [112] = {148,"橙色神兽任选箱",2,148,"",543,5,"可以任选一只橙色神兽。","可以任选一只橙色神兽。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [113] = {149,"阵营王者宝箱",2,149,"",544,6,"阵营竞技冠军专享，可获得20个破军碎片任选箱或40个稀有精炼石。","可获得20个破军碎片任选箱或40个稀有精炼石",1,0,"使  用",62,1,"",0,0,"",0,0,0,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [114] = {150,"阵营亚军宝箱",2,150,"",545,5,"阵营竞技亚军奖励，可获得16个破军碎片任选箱或32个稀有精炼石。","可获得16个破军碎片任选箱或32个稀有精炼石",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [115] = {151,"阵营四强宝箱",2,151,"",546,5,"阵营竞技四强奖励，可获得14个破军碎片任选箱或28个稀有精炼石。","可获得14个破军碎片任选箱或28个稀有精炼石",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [116] = {152,"阵营八强宝箱",2,152,"",547,5,"阵营竞技八强奖励，可获得12个破军碎片任选箱或24个稀有精炼石。","可获得12个破军碎片任选箱或24个稀有精炼石",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [117] = {153,"阵营竞技宝箱",2,153,"",548,5,"阵营竞技参与奖励，可获得10个破军碎片任选箱或20个稀有精炼石。","可获得10个破军碎片任选箱或20个稀有精炼石",1,0,"使  用",62,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [118] = {154,"先秦残卷·上",9,344,"155|156",154,4,"先秦皇陵·上内掉落。收集上中下残卷可合成春秋战国任选箱。","收集上中下残卷可合成春秋战国任选箱",1,0,"合  成",42,1,"需收集中、下残卷才可合成",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [119] = {155,"先秦残卷·中",9,0,"154|156",155,4,"先秦皇陵·中内掉落。收集上中下残卷可合成春秋战国任选箱。","收集上中下残卷可合成春秋战国任选箱",1,0,"合  成",42,1,"需收集上、下残卷才可合成",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [120] = {156,"先秦残卷·下",9,0,"154|155",156,4,"先秦皇陵·下内掉落。收集上中下残卷可合成春秋战国任选箱。","收集上中下残卷可合成春秋战国任选箱",1,0,"合  成",42,1,"需收集上、中残卷才可合成",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [121] = {157,"金色锦囊任选箱",2,157,"",10054,7,"可以从金色锦囊中任选一个。","可以从金色锦囊中任选一个。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"effect_icon_jinnang_goldenbox",0,0,0,0,0,0,0,},
        [122] = {158,"橙色战马任选箱",2,158,"",10035,5,"可以任选一匹橙色战马。","可以任选一匹橙色战马。",1,0,"使  用",62,1,"",0,0,"",0,0,0,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [123] = {159,"金丝套马索",3,0,"",159,5,"驯马专用套索，可在关公驯马内驯服橙色战马。","可在关公驯马内驯服橙色战马",1,1400,"去驯马",285,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [124] = {160,"战马鬃毛",3,0,"",86,5,"驯马时马掉落的鬃毛，可在驯马商店内兑换战马装备、橙色战马。","可在驯马商店内兑换战马装备、橙色战马",1,1401,"去兑换",285,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [125] = {161,"鲛油长明灯",13,600,"",161,5,"鸡鸣灯灭不摸金。使用后可增加先秦皇陵活动时间10分钟。","使用后可增加先秦皇陵活动时间10分钟",1,0,"使  用",285,0,"点灯～先秦皇陵活动时间已增加！",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [126] = {162,"礼记周易任选箱",2,162,"",162,6,"可以从礼记、周易中任选一件。","可以从礼记、周易中任选一件。",1,0,"使  用",85,1,"",0,1,"",0,0,0,"effect_taozhuang_red_up",0,0,0,0,0,0,0,},
        [127] = {163,"四神钥匙",14,0,"164",54,6,"想打开四神宝箱就要有四神钥匙。","想打开四神宝箱就要有四神钥匙。",1,0,"使  用",40,1,"主公，没有四神宝箱了",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [128] = {164,"四神宝箱",14,610,"163",55,6,"打开可获得四神、破军装备或碎片或稀有精炼石。","打开可获得四神、破军装备或碎片或稀有精炼石。",1,0,"使  用",40,1,"主公，没有四神钥匙了",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [129] = {165,"奇珍异宝任选箱",2,163,"",165,5,"打开可以从卧龙占星盘x1、红羽穿心箭x1、金色套马索x1、玄天八卦x2中任选一件。","打开可以任选一件活动道具。",1,0,"使  用",40,1,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [130] = {166,"蟠螭龙纹璧",3,0,"",166,5,"上古遗留下来的神秘玉璧，用于招募金色武将。","可在见龙在田活动中进行金将招募。",1,723,"去招募",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [131] = {167,"见龙在田全服红包",3,0,"",167,5,"见龙在田积分总排名全服红包，快让全服沾沾大佬的喜气吧~","请主公前往军团发放全服红包。",0,0,"",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [132] = {168,"欢乐抽奖全服红包",3,0,"",168,4,"欢乐抽奖积分排名全服红包，快让全服沾沾大佬的喜气吧~","请主公前往军团发放全服红包。",0,0,"",284,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [133] = {169,"金将碎片任选箱",2,164,"",169,7,"可以从子上、水镜、周姬、南华的碎片中任选一片。","可以任选一片金色武将的碎片。",1,0,"使  用",64,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [134] = {170,"金将任选箱",2,165,"",170,7,"可以从四个阵营中任选一名金将。","可以从四个阵营中任选一名金将。",1,0,"使  用",66,1,"",0,1,"1|0|0|0",0,0,0,"effect_icon_jinnang_goldenbox",0,0,0,0,0,0,0,},
        [135] = {200,"名将合击礼包",1,200,"",10001,4,"打开可以随机获得一对紫色合击武将。","打开随机获得一对紫色合击武将。",1,0,"使  用",1,1,"",0,1,"1|0|0|0",0,0,0,"",0,0,0,0,0,0,0,},
        [136] = {201,"金秋枫叶",1,720,"",201,5,"欢乐庆典期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [137] = {202,"幸运礼包",1,720,"",203,5,"欢乐庆典期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [138] = {203,"购物券",1,720,"",202,5,"双十一期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [139] = {204,"圣诞礼包",1,720,"",204,5,"圣诞狂欢活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [140] = {205,"新年福袋",1,720,"",205,5,"欢庆元旦活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [141] = {206,"新春红包",1,720,"",206,5,"新春盛典活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [142] = {207,"七彩汤圆",1,720,"",207,5,"欢乐闹元宵活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [143] = {208,"女神之心",1,720,"",208,5,"三月女神节活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [144] = {209,"幸运礼包",1,720,"",209,5,"欢乐庆典期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [145] = {210,"美味青团",1,720,"",210,5,"清明踏青期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [146] = {211,"耕耘之礼",1,720,"",211,5,"春耕夏耘活动期间参与军团活动、攻打副本、充值都可获得。","开启可获得各种稀有资源。",1,0,"使  用",40,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
        [147] = {301,"6元充值额度",1,205,"",3,5,"可得6元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得6元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得6元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [148] = {302,"30元充值额度",1,206,"",3,5,"可得30元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得30元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得30元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [149] = {303,"68元充值额度",1,207,"",3,5,"可得68元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得68元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得68元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [150] = {304,"超级突破丹",1,208,"",3,5,"采用名贵中药凝练而成，能帮助武将突破的超级神丹。","武将突破所需的超级十全大补丸。",1,0,"使  用",999,0,"使用成功！恭喜主公精力充沛！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [151] = {305,"198元充值额度",1,209,"",3,5,"可得198元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得198元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得198元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [152] = {306,"298元充值额度",1,210,"",3,5,"可得298元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得298元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得298元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [153] = {307,"488元充值额度",1,211,"",3,5,"可得488元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得488元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得488元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [154] = {308,"648元充值额度",1,212,"",3,5,"可得648元充值额度，在七日活动、单笔充值、累计充值活动中有效。","可得648元充值额度,用于活动充值。",1,0,"使  用",999,0,"使用成功！获得648元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [155] = {309,"激活VIP图标",12,0,"",3,5,"激活VIP图标的道具","激活VIP图标的道具",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [156] = {311,"真·6元充值额度",1,213,"",3,5,"可得6元充值额度对应的各种福利。","可得6元充值额度。",1,0,"使  用",999,0,"使用成功！获得6元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [157] = {312,"真·30元充值额度",1,214,"",3,5,"可得30元充值额度对应的各种福利。","可得30元充值额度。",1,0,"使  用",999,0,"使用成功！获得30元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [158] = {313,"真·68元充值额度",1,215,"",3,5,"可得68元充值额度对应的各种福利。","可得68元充值额度。",1,0,"使  用",999,0,"使用成功！获得68元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [159] = {314,"真·98元充值额度",1,216,"",3,5,"可得98元充值额度对应的各种福利。","可得98元充值额度。",1,0,"使  用",999,0,"使用成功！获得98元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [160] = {315,"真·198元充值额度",1,217,"",3,5,"可得198元充值额度对应的各种福利。","可得198元充值额度。",1,0,"使  用",999,0,"使用成功！获得198元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [161] = {316,"真·298元充值额度",1,218,"",3,5,"可得298元充值额度对应的各种福利。","可得298元充值额度。",1,0,"使  用",999,0,"使用成功！获得298元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [162] = {317,"真·488元充值额度",1,219,"",3,5,"可得488元充值额度对应的各种福利。","可得488元充值额度。",1,0,"使  用",999,0,"使用成功！获得488元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [163] = {318,"真·648元充值额度",1,220,"",3,5,"可得648元充值额度对应的各种福利。","可得648元充值额度。",1,0,"使  用",999,0,"使用成功！获得648元充值额度！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [164] = {320,"激活豪华卡",11,10021,"",41,5,"可激活豪华卡","可激活豪华卡",1,0,"使  用",999,0,"使用成功！已激活豪华卡",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [165] = {321,"激活至尊卡",11,10022,"",41,5,"可激活至尊卡","可激活至尊卡",1,0,"使  用",999,0,"使用成功！已激活至尊卡",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [166] = {322,"激活1期基金",11,10027,"",41,5,"可激活1期基金","可激活1期基金",1,0,"使  用",999,0,"使用成功！已激活1期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [167] = {323,"激活2期基金",11,10028,"",41,5,"可激活2期基金","可激活2期基金",1,0,"使  用",999,0,"使用成功！已激活2期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [168] = {324,"激活3期基金",11,10029,"",41,5,"可激活3期基金","可激活3期基金",1,0,"使  用",999,0,"使用成功！已激活3期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [169] = {325,"激活4期基金",11,10030,"",41,5,"可激活4期基金","可激活4期基金",1,0,"使  用",999,0,"使用成功！已激活4期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [170] = {326,"激活5期基金",11,10031,"",41,5,"可激活5期基金","可激活5期基金",1,0,"使  用",999,0,"使用成功！已激活5期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [171] = {327,"激活6期基金",11,10032,"",41,5,"可激活6期基金","可激活6期基金",1,0,"使  用",999,0,"使用成功！已激活6期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [172] = {328,"激活7期基金",11,10047,"",41,5,"可激活7期基金","可激活7期基金",1,0,"使  用",999,0,"使用成功！已激活7期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [173] = {329,"激活8期基金",11,10048,"",41,5,"可激活8期基金","可激活8期基金",1,0,"使  用",999,0,"使用成功！已激活8期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [174] = {330,"激活9期基金",11,10049,"",41,5,"可激活9期基金","可激活9期基金",1,0,"使  用",999,0,"使用成功！已激活9期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [175] = {331,"激活10期基金",11,10050,"",41,5,"可激活10期基金","可激活10期基金",1,0,"使  用",999,0,"使用成功！已激活10期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [176] = {332,"激活11期基金",11,10051,"",41,5,"可激活11期基金","可激活11期基金",1,0,"使  用",999,0,"使用成功！已激活11期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [177] = {333,"激活12期基金",11,10060,"",41,5,"可激活12期基金","可激活12期基金",1,0,"使  用",999,0,"使用成功！已激活12期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [178] = {334,"激活13期基金",11,10061,"",41,5,"可激活13期基金","可激活13期基金",1,0,"使  用",999,0,"使用成功！已激活13期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [179] = {335,"激活14期基金",11,10062,"",41,5,"可激活14期基金","可激活14期基金",1,0,"使  用",999,0,"使用成功！已激活14期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [180] = {336,"激活15期基金",11,10063,"",41,5,"可激活15期基金","可激活15期基金",1,0,"使  用",999,0,"使用成功！已激活15期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [181] = {337,"激活16期基金",11,10064,"",41,5,"可激活16期基金","可激活16期基金",1,0,"使  用",999,0,"使用成功！已激活16期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [182] = {338,"激活17期基金",11,10065,"",41,5,"可激活17期基金","可激活17期基金",1,0,"使  用",999,0,"使用成功！已激活17期基金",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [183] = {351,"6元商品",11,10052,"",40,5,"可购买6元商品","可购买6元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [184] = {352,"30元商品",11,10053,"",40,5,"可购买30元商品","可购买30元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [185] = {353,"68元商品",11,10054,"",40,5,"可购买68元商品","可购买68元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [186] = {354,"98元商品",11,10055,"",40,5,"可购买98元商品","可购买98元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [187] = {355,"198元商品",11,10056,"",40,5,"可购买198元商品","可购买198元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [188] = {356,"298元商品",11,10066,"",40,5,"可购买298元商品","可购买298元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [189] = {357,"488元商品",11,10058,"",40,5,"可购买488元商品","可购买488元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [190] = {358,"648元商品",11,10067,"",40,5,"可购买648元商品","可购买648元商品",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [191] = {359,"648元商品2",11,10086,"",40,5,"可购买648元商品2","可购买648元商品2",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [192] = {360,"激活矿战特权",11,10098,"",40,5,"可激活矿战特权","可激活矿战特权",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [193] = {361,"激活每日礼包7天",11,10026,"",166,5,"可激活1周每日礼包","可激活1周每日礼包",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [194] = {362,"激活元宝周基金",11,10081,"",603,5,"可激活元宝周基金","可激活元宝周基金",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [195] = {363,"激活物品周基金",11,10080,"",604,5,"可激活物品周基金","可激活物品周基金",1,0,"使  用",999,0,"使用成功！",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [196] = {401,"水晶-作废",3,0,"",401,5,"可在活动中兑换奖励。","可在活动中兑换奖励。",0,0,"0",202,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [197] = {500,"泉水",3,0,"",500,2,"露坛、赤灵芝、九天瑶池升2级需要的道具。","露坛、赤灵芝、九天瑶池升级所需道具。",1,948,"去升级",500,0,"",0,0,"",0,0,0,"",5,1,240,6,0,0,0,},
        [198] = {501,"露水",3,0,"",501,3,"露坛、赤灵芝、九天瑶池升3、4级需要的道具。","露坛、赤灵芝、九天瑶池升级所需道具。",1,948,"去升级",501,0,"",0,0,"",0,0,0,"",5,1,480,9,0,0,0,},
        [199] = {502,"冰清水",3,0,"",502,4,"露坛、赤灵芝、九天瑶池升5、6级需要的道具。","露坛、赤灵芝、九天瑶池升级所需道具。",1,948,"去升级",502,0,"",0,0,"",0,0,0,"",5,1,960,12,0,0,0,},
        [200] = {503,"寒梅蕴水",3,0,"",503,5,"露坛、赤灵芝、九天瑶池升7、8级需要的道具。","露坛、赤灵芝、九天瑶池升级所需道具。",1,948,"去升级",503,0,"",0,0,"",0,0,0,"",5,1,1920,15,0,0,0,},
        [201] = {504,"上古神水",3,0,"",504,6,"露坛、赤灵芝、九天瑶池升9、10级需要的道具。","露坛、赤灵芝、九天瑶池升级所需道具。",1,948,"去升级",504,0,"",0,0,"",0,0,0,"",5,1,3840,18,0,0,0,},
        [202] = {510,"青草",3,0,"",510,2,"露坛、翠竹林、九华灯升2级需要的道具。","露坛、翠竹林、九华灯升级所需道具。",1,948,"去升级",505,0,"",0,0,"",0,0,0,"",5,1,240,7,0,0,0,},
        [203] = {511,"萱草",3,0,"",511,3,"露坛、翠竹林、九华灯升3、4级需要的道具。","露坛、翠竹林、九华灯升级所需道具。",1,948,"去升级",506,0,"",0,0,"",0,0,0,"",5,1,480,10,0,0,0,},
        [204] = {512,"忘忧草",3,0,"",512,4,"露坛、翠竹林、九华灯升5、6级需要的道具。","露坛、翠竹林、九华灯升级所需道具。",1,948,"去升级",507,0,"",0,0,"",0,0,0,"",5,1,960,13,0,0,0,},
        [205] = {513,"香雪芝草",3,0,"",513,5,"露坛、翠竹林、九华灯升7、8级需要的道具。","露坛、翠竹林、九华灯升级所需道具。",1,948,"去升级",508,0,"",0,0,"",0,0,0,"",5,1,1920,16,0,0,0,},
        [206] = {514,"凝霜神草",3,0,"",514,6,"露坛、翠竹林、九华灯升9、10级需要的道具。","露坛、翠竹林、九华灯升级所需道具。",1,948,"去升级",509,0,"",0,0,"",0,0,0,"",5,1,3840,19,0,0,0,},
        [207] = {520,"神树道具-作废",3,0,"",520,2,"九华灯进阶需要的道具。","九华灯进阶需要的道具。",1,948,"去升级",510,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [208] = {521,"神树道具-作废",3,0,"",521,3,"九华灯进阶需要的道具。","九华灯进阶需要的道具。",1,948,"去升级",511,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [209] = {522,"神树道具-作废",3,0,"",522,4,"九华灯进阶需要的道具。","九华灯进阶需要的道具。",1,948,"去升级",512,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [210] = {523,"神树道具-作废",3,0,"",522,5,"九华灯进阶需要的道具。","九华灯进阶需要的道具。",1,948,"去升级",513,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [211] = {524,"神树道具-作废",3,0,"",522,6,"九华灯进阶需要的道具。","九华灯进阶需要的道具。",1,948,"去升级",514,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [212] = {530,"青石",3,0,"",530,2,"翠竹林、九华灯、九天瑶池、玲珑玉玦升2级需要的道具。","竹林、九华灯、瑶池、玉玦升级所需道具。",1,948,"去升级",515,0,"",0,0,"",0,0,0,"",5,1,240,8,0,0,0,},
        [213] = {531,"莹石",3,0,"",531,3,"翠竹林、九华灯、九天瑶池、玲珑玉玦升3、4级需要的道具。","竹林、九华灯、瑶池、玉玦升级所需道具。",1,948,"去升级",516,0,"",0,0,"",0,0,0,"",5,1,480,11,0,0,0,},
        [214] = {532,"聚灵石",3,0,"",532,4,"翠竹林、九华灯、九天瑶池、玲珑玉玦升5、6级需要的道具。","竹林、九华灯、瑶池、玉玦升级所需道具。",1,948,"去升级",517,0,"",0,0,"",0,0,0,"",5,1,960,14,0,0,0,},
        [215] = {533,"三生之石",3,0,"",533,5,"翠竹林、九华灯、九天瑶池、玲珑玉玦升7、8级需要的道具。","竹林、九华灯、瑶池、玉玦升级所需道具。",1,948,"去升级",518,0,"",0,0,"",0,0,0,"",5,1,1920,17,0,0,0,},
        [216] = {534,"女娲神石",3,0,"",534,6,"翠竹林、九华灯、九天瑶池、玲珑玉玦升9、10级需要的道具。","竹林、九华灯、瑶池、玉玦升级所需道具。",1,948,"去升级",519,0,"",0,0,"",0,0,0,"",5,1,3840,20,0,0,0,},
        [217] = {540,"神树道具-作废",3,0,"",540,2,"露坛、玲珑玉玦进阶需要的道具。","露坛、玲珑玉玦进阶需要的道具。",1,948,"去升级",520,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [218] = {541,"神树道具-作废",3,0,"",541,3,"露坛、玲珑玉玦进阶需要的道具。","露坛、玲珑玉玦进阶需要的道具。",1,948,"去升级",521,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [219] = {542,"神树道具-作废",3,0,"",542,4,"露坛、玲珑玉玦进阶需要的道具。","露坛、玲珑玉玦进阶需要的道具。",1,948,"去升级",522,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [220] = {543,"神树道具-作废",3,0,"",542,5,"露坛、玲珑玉玦进阶需要的道具。","露坛、玲珑玉玦进阶需要的道具。",1,948,"去升级",523,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [221] = {544,"神树道具-作废",3,0,"",542,6,"露坛、玲珑玉玦进阶需要的道具。","露坛、玲珑玉玦进阶需要的道具。",1,948,"去升级",524,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [222] = {555,"礼记",3,0,"",103,6,"古代儒家典籍，主要记载了先秦的礼制，用于红色道具界限突破。","用于红色道具界限突破。",1,131,"使  用",20,0,"",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [223] = {556,"周易",3,0,"",104,6,"古代大道之源，乃安邦治国、修身养性的哲学典籍，用于红色道具界限突破。","用于红色道具界限突破。",1,131,"使  用",21,0,"",0,0,"",0,0,80,"",0,0,0,0,0,0,0,},
        [224] = {557,"传武册",12,0,"",107,5,"使用可以获得1次传武次数，每天限用1次。","可获得1次传武次数，每天限用1次。",1,0,"使  用",40,0,"使用成功！传武次数+1",0,0,"",0,0,85,"",0,0,0,0,1,1,1,},
        [225] = {558,"习武册",12,0,"",108,5,"使用可以获得1次习武次数，每天限用1次。","可获得1次习武次数，每天限用1次。",1,0,"使  用",40,0,"使用成功！习武次数+1",0,0,"",0,0,85,"",0,0,0,0,1,1,1,},
        [226] = {559,"圣灵真元",3,0,"",103,5,"神兽橙升红的道具","神兽橙升红的道具",1,977,"使  用",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [227] = {570,"土鸡蛋",3,0,"",570,3,"农家散养，营养丰富。周年庆活动中捐献，可获得5功绩。","周年庆活动中捐献，可获得5功绩。",1,1600,"捐  献",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [228] = {571,"鲜制奶油",3,0,"",571,4,"奶香浓郁，热量爆炸。周年庆活动中捐献，可获得10功绩。","周年庆活动中捐献，可获得10功绩。",1,1600,"捐  献",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [229] = {572,"缤纷水果",3,0,"",572,5,"果香四溢，甘甜可口。周年庆活动中捐献，可获得100功绩。","周年庆活动中捐献，可获得100功绩。",1,1600,"捐  献",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [230] = {601,"猪",3,0,"",601,4,"可以在春节兑换活动中兑换稀有道具。","可以在春节兑换活动中兑换稀有道具。",1,10,"去兑换",40,0,"",0,0,"",0,0,0,"",5,2,20000,50,0,0,0,},
        [231] = {602,"事",3,0,"",602,4,"可以在春节兑换活动中兑换稀有道具。","可以在春节兑换活动中兑换稀有道具。",1,10,"去兑换",40,0,"",0,0,"",0,0,0,"",5,2,20000,51,0,0,0,},
        [232] = {603,"大",3,0,"",603,4,"可以在春节兑换活动中兑换稀有道具。","可以在春节兑换活动中兑换稀有道具。",1,10,"去兑换",40,0,"",0,0,"",0,0,0,"",5,2,20000,52,0,0,0,},
        [233] = {604,"吉",3,0,"",604,4,"可以在春节兑换活动中兑换稀有道具。","可以在春节兑换活动中兑换稀有道具。",1,10,"去兑换",40,0,"",0,0,"",0,0,0,"",5,2,20000,53,0,0,0,},
        [234] = {701,"青龙原石",1,843,"",701,5,"劈开原石，有几率获得镶嵌于武器上的红色品质玉石。","劈开后可获得一颗镶嵌于武器上的玉石。",1,0,"开  玉",24,1,"",0,1,"",0,0,83,"",0,0,0,0,0,0,0,},
        [235] = {702,"玄武原石",1,848,"",702,5,"劈开原石，有几率获得镶嵌于盔甲上的红色品质玉石。","劈开后可获得一颗镶嵌于盔甲上的玉石。",1,0,"开  玉",25,1,"",0,1,"",0,0,83,"",0,0,0,0,0,0,0,},
        [236] = {703,"白虎原石",1,853,"",703,5,"劈开原石，有几率获得镶嵌于头盔上的红色品质玉石。","劈开后可获得一颗镶嵌于头盔上的玉石。",1,0,"开  玉",26,1,"",0,1,"",0,0,83,"",0,0,0,0,0,0,0,},
        [237] = {704,"朱雀原石",1,858,"",704,5,"劈开原石，有几率获得镶嵌于战靴上的红色品质玉石。","劈开后可获得一颗镶嵌于战靴上的玉石。",1,0,"开  玉",27,1,"",0,1,"",0,0,83,"",0,0,0,0,0,0,0,},
        [238] = {705,"原石任选箱",2,705,"",705,5,"可以任选一颗原石","可以任选一颗原石",1,0,"使 用",23,1,"",0,1,"",0,0,83,"effect_taozhuang_orange",0,0,0,0,0,0,0,},
        [239] = {710,"白虎之息",3,0,"",103,5,"红色白虎升星道具","红色白虎升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [240] = {711,"龙霖之息",3,0,"",103,5,"红色沧海青龙升星道具","红色沧海青龙升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [241] = {712,"朱雀之息",3,0,"",103,5,"红色朱雀升星道具","红色朱雀升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [242] = {713,"玄武之息",3,0,"",103,5,"红色玄武升星道具","红色玄武升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [243] = {714,"圣鲲之息",3,0,"",103,5,"红色圣鲲升星道具","红色圣鲲升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [244] = {715,"麒麟之息",3,0,"",103,5,"红色麒麟升星道具","红色麒麟升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [245] = {716,"年兽之息",3,0,"",103,5,"红色年兽升星道具","红色年兽升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [246] = {717,"白泽之息",3,0,"",103,5,"红色白泽升星道具","红色白泽升星道具",1,933,"升  星",19,0,"",0,0,"",0,0,0,"",0,0,0,0,0,0,0,},
        [247] = {111001,"随机红将宝箱",1,111001,"",10002,6,"打开可以随机获得一个红将","打开可以随机获得一个红将",1,0,"使用",2,1,"",0,1,"",0,0,0,"",0,0,0,0,0,0,0,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 8,
    [100] = 64,
    [101] = 65,
    [102] = 66,
    [103] = 67,
    [104] = 68,
    [105] = 69,
    [106] = 70,
    [107] = 71,
    [108] = 72,
    [109] = 73,
    [11] = 9,
    [110] = 74,
    [111] = 75,
    [111001] = 247,
    [112] = 76,
    [113] = 77,
    [114] = 78,
    [115] = 79,
    [116] = 80,
    [117] = 81,
    [118] = 82,
    [119] = 83,
    [12] = 10,
    [120] = 84,
    [121] = 85,
    [122] = 86,
    [123] = 87,
    [124] = 88,
    [125] = 89,
    [126] = 90,
    [127] = 91,
    [128] = 92,
    [129] = 93,
    [13] = 11,
    [130] = 94,
    [131] = 95,
    [132] = 96,
    [133] = 97,
    [134] = 98,
    [135] = 99,
    [136] = 100,
    [137] = 101,
    [138] = 102,
    [139] = 103,
    [14] = 12,
    [140] = 104,
    [141] = 105,
    [142] = 106,
    [143] = 107,
    [144] = 108,
    [145] = 109,
    [146] = 110,
    [147] = 111,
    [148] = 112,
    [149] = 113,
    [15] = 13,
    [150] = 114,
    [151] = 115,
    [152] = 116,
    [153] = 117,
    [154] = 118,
    [155] = 119,
    [156] = 120,
    [157] = 121,
    [158] = 122,
    [159] = 123,
    [160] = 124,
    [161] = 125,
    [162] = 126,
    [163] = 127,
    [164] = 128,
    [165] = 129,
    [166] = 130,
    [167] = 131,
    [168] = 132,
    [169] = 133,
    [170] = 134,
    [18] = 14,
    [19] = 15,
    [2] = 2,
    [20] = 16,
    [200] = 135,
    [201] = 136,
    [202] = 137,
    [203] = 138,
    [204] = 139,
    [205] = 140,
    [206] = 141,
    [207] = 142,
    [208] = 143,
    [209] = 144,
    [21] = 17,
    [210] = 145,
    [211] = 146,
    [22] = 18,
    [23] = 19,
    [24] = 20,
    [25] = 21,
    [26] = 22,
    [27] = 23,
    [28] = 24,
    [29] = 25,
    [3] = 3,
    [30] = 26,
    [301] = 147,
    [302] = 148,
    [303] = 149,
    [304] = 150,
    [305] = 151,
    [306] = 152,
    [307] = 153,
    [308] = 154,
    [309] = 155,
    [31] = 27,
    [311] = 156,
    [312] = 157,
    [313] = 158,
    [314] = 159,
    [315] = 160,
    [316] = 161,
    [317] = 162,
    [318] = 163,
    [32] = 28,
    [320] = 164,
    [321] = 165,
    [322] = 166,
    [323] = 167,
    [324] = 168,
    [325] = 169,
    [326] = 170,
    [327] = 171,
    [328] = 172,
    [329] = 173,
    [33] = 29,
    [330] = 174,
    [331] = 175,
    [332] = 176,
    [333] = 177,
    [334] = 178,
    [335] = 179,
    [336] = 180,
    [337] = 181,
    [338] = 182,
    [351] = 183,
    [352] = 184,
    [353] = 185,
    [354] = 186,
    [355] = 187,
    [356] = 188,
    [357] = 189,
    [358] = 190,
    [359] = 191,
    [360] = 192,
    [361] = 193,
    [362] = 194,
    [363] = 195,
    [4] = 4,
    [40] = 30,
    [401] = 196,
    [41] = 31,
    [42] = 32,
    [43] = 33,
    [44] = 34,
    [5] = 5,
    [500] = 197,
    [501] = 198,
    [502] = 199,
    [503] = 200,
    [504] = 201,
    [510] = 202,
    [511] = 203,
    [512] = 204,
    [513] = 205,
    [514] = 206,
    [520] = 207,
    [521] = 208,
    [522] = 209,
    [523] = 210,
    [524] = 211,
    [530] = 212,
    [531] = 213,
    [532] = 214,
    [533] = 215,
    [534] = 216,
    [540] = 217,
    [541] = 218,
    [542] = 219,
    [543] = 220,
    [544] = 221,
    [555] = 222,
    [556] = 223,
    [557] = 224,
    [558] = 225,
    [559] = 226,
    [570] = 227,
    [571] = 228,
    [572] = 229,
    [6] = 6,
    [601] = 230,
    [602] = 231,
    [603] = 232,
    [604] = 233,
    [61] = 35,
    [62] = 36,
    [63] = 37,
    [64] = 38,
    [7] = 7,
    [701] = 234,
    [702] = 235,
    [703] = 236,
    [704] = 237,
    [705] = 238,
    [706] = 45,
    [71] = 39,
    [710] = 239,
    [711] = 240,
    [712] = 241,
    [713] = 242,
    [714] = 243,
    [715] = 244,
    [716] = 245,
    [717] = 246,
    [72] = 40,
    [73] = 41,
    [74] = 42,
    [80] = 43,
    [81] = 44,
    [82] = 46,
    [83] = 47,
    [84] = 48,
    [85] = 49,
    [86] = 50,
    [87] = 51,
    [88] = 52,
    [89] = 53,
    [90] = 54,
    [91] = 55,
    [92] = 56,
    [93] = 57,
    [94] = 58,
    [95] = 59,
    [96] = 60,
    [97] = 61,
    [98] = 62,
    [99] = 63,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in item")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function item.length()
    return #item._data
end

-- 
function item.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function item.indexOf(index)
    if index == nil or not item._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/item.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "item" )
        return setmetatable({_raw = item._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = item._data[index]}, mt)
end

--
function item.get(id)
    
    return item.indexOf(__index_id[id])
        
end

--
function item.set(id, key, value)
    local record = item.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function item.index()
    return __index_id
end

return item