--pet_star

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --神兽id-int 
  star = 2,    --星级-int 
  up = 3,    --升星时全属性加成-int 
  up_show = 4,    --升星时全属性加成（前端）-int 
  talent_name = 5,    --激活特性名称-string 
  talent_description = 6,    --激活特性描述-string 
  chance_description = 7,    --神兽技能释放概率描述-string 
  skill1 = 8,    --普攻id-int 
  skill2 = 9,    --技能id-int 
  skill3 = 10,    --战吼id-int 

}

-- key type
local __key_type = {
  id = "int",    --神兽id-1 
  star = "int",    --星级-2 
  up = "int",    --升星时全属性加成-3 
  up_show = "int",    --升星时全属性加成（前端）-4 
  talent_name = "string",    --激活特性名称-5 
  talent_description = "string",    --激活特性描述-6 
  chance_description = "string",    --神兽技能释放概率描述-7 
  skill1 = "int",    --普攻id-8 
  skill2 = "int",    --技能id-9 
  skill3 = "int",    --战吼id-10 

}


-- data
local pet_star = {
    _data = {
        [1] = {1,0,1000,0,"","","奇数回合释放。",0,7010020,0,},
        [2] = {1,1,200,200,"猛击1","技能造成伤害提升至368%","奇数回合释放。",0,7010120,0,},
        [3] = {1,2,200,200,"猛击2","技能造成伤害提升至386%","奇数回合释放。",0,7010220,0,},
        [4] = {1,3,200,200,"猛击3","技能造成伤害提升至405%","奇数回合释放。",0,7010320,0,},
        [5] = {1,4,200,200,"猛击4","技能造成伤害提升至426%","奇数回合释放。",0,7010420,0,},
        [6] = {1,5,200,200,"猛击5","技能造成伤害提升至469%","奇数回合释放。",0,7010520,0,},
        [7] = {2,0,1000,0,"","","我方任意1个武将生命少于等于60%时释放。每场战斗释放1次。每回合最多释放1次。",0,7020020,0,},
        [8] = {2,1,200,200,"抚慰1","每场战斗释放技能次数提升至2次","我方任意1个武将生命少于等于60%时释放。每场战斗释放2次。每回合最多释放1次。",0,7020120,0,},
        [9] = {2,2,200,200,"抚慰2","每场战斗释放技能次数提升至3次","我方任意1个武将生命少于等于60%时释放。每场战斗释放3次。每回合最多释放1次。",0,7020220,0,},
        [10] = {2,3,200,200,"抚慰3","每场战斗释放技能次数提升至4次","我方任意1个武将生命少于等于60%时释放。每场战斗释放4次。每回合最多释放1次。",0,7020320,0,},
        [11] = {2,4,200,200,"抚慰4","每场战斗释放技能次数提升至5次","我方任意1个武将生命少于等于60%时释放。每场战斗释放5次。每回合最多释放1次。",0,7020420,0,},
        [12] = {2,5,200,200,"抚慰5","每场战斗释放技能次数提升至6次","我方任意1个武将生命少于等于60%时释放。每场战斗释放6次。每回合最多释放1次。",0,7020520,0,},
        [13] = {3,0,1000,0,"","","偶数回合释放。",0,7030020,0,},
        [14] = {3,1,300,300,"爪击1","技能造成伤害提升至181%","偶数回合释放。",0,7030120,0,},
        [15] = {3,2,300,300,"爪击2","技能造成伤害提升至190%","偶数回合释放。",0,7030220,0,},
        [16] = {3,3,300,300,"爪击3","技能造成伤害提升至209%","偶数回合释放。",0,7030320,0,},
        [17] = {3,4,300,300,"爪击4","技能造成伤害提升至229%","偶数回合释放。",0,7030420,0,},
        [18] = {3,5,300,300,"爪击5","技能造成伤害提升至275%","偶数回合释放。",0,7030520,0,},
        [19] = {4,0,1000,0,"","","偶数回合释放。",0,7040020,0,},
        [20] = {4,1,300,300,"凤鸣1","技能造成伤害提升至181%","偶数回合释放。",0,7040120,0,},
        [21] = {4,2,300,300,"凤鸣2","技能造成伤害提升至190%","偶数回合释放。",0,7040220,0,},
        [22] = {4,3,300,300,"凤鸣3","技能造成伤害提升至209%","偶数回合释放。",0,7040320,0,},
        [23] = {4,4,300,300,"凤鸣4","技能造成伤害提升至229%","偶数回合释放。",0,7040420,0,},
        [24] = {4,5,300,300,"凤鸣5","技能造成伤害提升至275%","偶数回合释放。",0,7040520,0,},
        [25] = {5,0,1000,0,"","","",0,7050020,7059999,},
        [26] = {5,1,1000,1000,"奔雷1","战斗中降低敌方怒气人数提升至4人","",0,7051020,7059999,},
        [27] = {5,2,1000,1000,"奔雷2","战斗中降低敌方怒气人数提升至全体","",0,7052020,7059999,},
        [28] = {5,3,1000,1000,"奔雷3","战斗前额外随机降低敌方2人1点怒气","",0,7053020,7058888,},
        [29] = {5,4,1000,1000,"奔雷4","战斗前额外随机降低敌方4人1点怒气","",0,7054020,7057777,},
        [30] = {5,5,1000,1000,"奔雷5","战斗前降低敌方全体2点怒气","",0,7055020,7056666,},
        [31] = {6,0,1000,0,"","","奇数回合释放。",0,7060020,0,},
        [32] = {6,1,1000,1000,"狂怒1","释放技能回复己方全体武将1点怒气","奇数回合释放。",0,7061020,0,},
        [33] = {6,2,1000,1000,"狂怒2","额外增加己方全体伤害6%，持续1回合","奇数回合释放。",0,7062020,0,},
        [34] = {6,3,1000,1000,"狂怒3","增加己方全体伤害提升至12%","奇数回合释放。",0,7063020,0,},
        [35] = {6,4,1000,1000,"狂怒4","额外增加己方全体命中12%，持续1回合","奇数回合释放。",0,7064020,0,},
        [36] = {6,5,1000,1000,"狂怒5","额外增加己方全体暴击概率12%，持续1回合","奇数回合释放。",0,7065020,0,},
        [37] = {7,0,1000,0,"","","",0,7070010,0,},
        [38] = {7,1,1000,1000,"天火1","造成生命值上限的伤害提高至14%","",0,7070110,0,},
        [39] = {7,2,1000,1000,"天火2","造成生命值上限的伤害提高至18%","",0,7070210,0,},
        [40] = {7,3,1000,1000,"天火3","额外给我方吴国武将附加持续1回合的业炎效果，使其造成的伤害提高10%","",0,7070310,0,},
        [41] = {7,4,1000,1000,"天火4","额外给我方吴国武将附加持续1回合的业炎效果，使其造成的伤害提高15%","",0,7070410,0,},
        [42] = {7,5,1000,1000,"天火5","额外给我方吴国武将附加持续1回合的业炎效果，使其造成的伤害提高20%","",0,7070510,0,},
        [43] = {8,0,1000,0,"","","奇数回合释放。",0,7080020,0,},
        [44] = {8,1,1000,1000,"护主1","护盾减伤效果提升至16%","奇数回合释放。",0,7080120,0,},
        [45] = {8,2,1000,1000,"护主2","护盾减伤效果提升至20%","奇数回合释放。",0,7080220,0,},
        [46] = {8,3,1000,1000,"护主3","护盾减伤效果提升至24%","奇数回合释放。",0,7080320,0,},
        [47] = {8,4,1000,1000,"护主4","额外回复自身生命上限6%的生命","奇数回合释放。",0,7080420,0,},
        [48] = {8,5,1000,1000,"护主5","回复生命上限比例提升至12%","奇数回合释放。",0,7080520,0,},
        [49] = {9,0,1000,0,"","","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090010,0,},
        [50] = {9,1,1000,1000,"逍遥1","每场战斗解除眩晕效果人数提升至2人","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090020,0,},
        [51] = {9,2,1000,1000,"逍遥2","每场战斗解除眩晕效果人数提升至3人","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090030,0,},
        [52] = {9,3,1000,1000,"逍遥3","每场战斗解除眩晕效果人数提升至4人","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090040,0,},
        [53] = {9,4,1000,1000,"逍遥4","每场战斗解除眩晕效果人数提升至5人","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090050,0,},
        [54] = {9,5,1000,1000,"逍遥5","每场战斗解除眩晕效果人数提升至6人","我方有成员被眩晕时释放。每回合最多解除2人。",0,7090060,0,},
        [55] = {10,0,1000,0,"","","",0,7100010,7100010,},
        [56] = {10,1,1000,1000,"催命1","技能目标数量提升至3人","",0,7100020,7100020,},
        [57] = {10,2,1000,1000,"催命2","技能目标数量提升至4人","",0,7100030,7100030,},
        [58] = {10,3,1000,1000,"催命3","技能目标数量提升至5人","",0,7100040,7100040,},
        [59] = {10,4,1000,1000,"催命4","技能目标数量提升至全体","",0,7100050,7100050,},
        [60] = {10,5,1000,1000,"催命5","闪电有50%概率不消失并在下回合继续判定","",0,7100060,7100060,},
        [61] = {11,0,1000,0,"","","",0,7110010,0,},
        [62] = {11,1,1000,1000,"祭祖1","斩杀血量比例提升至30%","",0,7110020,0,},
        [63] = {11,2,1000,1000,"祭祖2","斩杀血量比例提升至35%","",0,7110030,0,},
        [64] = {11,3,1000,1000,"祭祖3","斩杀血量比例提升至40%","",0,7110040,0,},
        [65] = {11,4,1000,1000,"祭祖4","斩杀血量比例提升至45%","",0,7110050,0,},
        [66] = {11,5,1000,1000,"祭祖5","斩杀血量比例提升至50%","",0,7110060,0,},
        [67] = {12,0,1000,0,"","","",0,7120010,0,},
        [68] = {12,1,1000,1000,"上天1","敌方剩余3个目标以上释放","",0,7120020,0,},
        [69] = {12,2,1000,1000,"上天2","敌方剩余2个目标以上释放","",0,7120030,0,},
        [70] = {12,3,1000,1000,"上天3","释放概率提高至60%","",0,7120040,0,},
        [71] = {12,4,1000,1000,"上天4","释放概率提高至80%","",0,7120050,0,},
        [72] = {12,5,1000,1000,"上天5","释放概率提高至100%","",0,7120060,0,},
        [73] = {106,0,1000,0,"","","奇数回合释放。",0,7060020,0,},
        [74] = {106,1,1000,1000,"狂怒1","释放技能给己方全体武将回复1点怒气，且己方全体伤害增加12%，己方全体武将暴击伤害增加8%，持续1回合。给怒气最少的2个目标附加一个青龙标记，持续1回合。青龙标记将在武将行动前为目标回复1点怒气","奇数回合释放。",0,7061020,0,},
        [75] = {106,2,1000,1000,"狂怒2","额外增加己方全体命中12%，己方武将全体暴击伤害提升至12%","奇数回合释放。",0,7062020,0,},
        [76] = {106,3,1000,1000,"狂怒3","额外增加己方全体暴击概率12%，持续1回合。己方武将全体暴击伤害提升至16%，青龙标记回复怒气数量增加1","奇数回合释放。",0,7063020,0,},
        [77] = {106,4,1000,1000,"狂怒4","己方武将全体暴击伤害提升至20%，青龙标记的目标增加1","奇数回合释放。",0,7064020,0,},
        [78] = {106,5,1000,1000,"狂怒5","己方武将全体暴击伤害提升至24%，青龙标记持续回合数增加1","奇数回合释放。",0,7065020,0,},
    }
}

-- index
local __index_id_star = {
    ["106_0"] = 73,
    ["106_1"] = 74,
    ["106_2"] = 75,
    ["106_3"] = 76,
    ["106_4"] = 77,
    ["106_5"] = 78,
    ["10_0"] = 55,
    ["10_1"] = 56,
    ["10_2"] = 57,
    ["10_3"] = 58,
    ["10_4"] = 59,
    ["10_5"] = 60,
    ["11_0"] = 61,
    ["11_1"] = 62,
    ["11_2"] = 63,
    ["11_3"] = 64,
    ["11_4"] = 65,
    ["11_5"] = 66,
    ["12_0"] = 67,
    ["12_1"] = 68,
    ["12_2"] = 69,
    ["12_3"] = 70,
    ["12_4"] = 71,
    ["12_5"] = 72,
    ["1_0"] = 1,
    ["1_1"] = 2,
    ["1_2"] = 3,
    ["1_3"] = 4,
    ["1_4"] = 5,
    ["1_5"] = 6,
    ["2_0"] = 7,
    ["2_1"] = 8,
    ["2_2"] = 9,
    ["2_3"] = 10,
    ["2_4"] = 11,
    ["2_5"] = 12,
    ["3_0"] = 13,
    ["3_1"] = 14,
    ["3_2"] = 15,
    ["3_3"] = 16,
    ["3_4"] = 17,
    ["3_5"] = 18,
    ["4_0"] = 19,
    ["4_1"] = 20,
    ["4_2"] = 21,
    ["4_3"] = 22,
    ["4_4"] = 23,
    ["4_5"] = 24,
    ["5_0"] = 25,
    ["5_1"] = 26,
    ["5_2"] = 27,
    ["5_3"] = 28,
    ["5_4"] = 29,
    ["5_5"] = 30,
    ["6_0"] = 31,
    ["6_1"] = 32,
    ["6_2"] = 33,
    ["6_3"] = 34,
    ["6_4"] = 35,
    ["6_5"] = 36,
    ["7_0"] = 37,
    ["7_1"] = 38,
    ["7_2"] = 39,
    ["7_3"] = 40,
    ["7_4"] = 41,
    ["7_5"] = 42,
    ["8_0"] = 43,
    ["8_1"] = 44,
    ["8_2"] = 45,
    ["8_3"] = 46,
    ["8_4"] = 47,
    ["8_5"] = 48,
    ["9_0"] = 49,
    ["9_1"] = 50,
    ["9_2"] = 51,
    ["9_3"] = 52,
    ["9_4"] = 53,
    ["9_5"] = 54,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in pet_star")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function pet_star.length()
    return #pet_star._data
end

-- 
function pet_star.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function pet_star.indexOf(index)
    if index == nil or not pet_star._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/pet_star.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "pet_star" )
        return setmetatable({_raw = pet_star._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = pet_star._data[index]}, mt)
end

--
function pet_star.get(id,star)
    
    local k = id .. '_' .. star
    return pet_star.indexOf(__index_id_star[k])
        
end

--
function pet_star.set(id,star, key, value)
    local record = pet_star.get(id,star)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function pet_star.index()
    return __index_id_star
end

return pet_star