--return_privilege

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --编号-int 
  vip_min = 2,    --VIP等级下限-int 
  vip_max = 3,    --VIP等级上限-int 
  day_min = 4,    --开服天数下限-int 
  day_max = 5,    --开服天数上限-int 
  privilege_type = 6,    --特权类型-int 
  privilege_value = 7,    --特权次数-int 
  recover = 8,    --刷新方式-int 
  privilege_txt = 9,    --特权说明-string 
  function_id = 10,    --功能跳转-int 
  button_txt = 11,    --按钮文字-string 
  is_work = 12,    --是否生效-int 

}

-- key type
local __key_type = {
  id = "int",    --编号-1 
  vip_min = "int",    --VIP等级下限-2 
  vip_max = "int",    --VIP等级上限-3 
  day_min = "int",    --开服天数下限-4 
  day_max = "int",    --开服天数上限-5 
  privilege_type = "int",    --特权类型-6 
  privilege_value = "int",    --特权次数-7 
  recover = "int",    --刷新方式-8 
  privilege_txt = "string",    --特权说明-9 
  function_id = "int",    --功能跳转-10 
  button_txt = "string",    --按钮文字-11 
  is_work = "int",    --是否生效-12 

}


-- data
local return_privilege = {
    _data = {
        [1] = {1,0,5,30,60,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [2] = {2,0,5,30,60,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [3] = {3,0,5,30,60,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [4] = {4,0,5,30,60,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [5] = {5,0,5,30,60,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [6] = {6,0,5,30,60,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [7] = {7,0,5,30,60,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [8] = {8,0,5,30,60,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [9] = {9,0,5,30,60,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [10] = {10,0,5,30,60,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
        [11] = {11,6,10,30,60,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [12] = {12,6,10,30,60,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [13] = {13,6,10,30,60,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [14] = {14,6,10,30,60,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [15] = {15,6,10,30,60,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [16] = {16,6,10,30,60,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [17] = {17,6,10,30,60,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [18] = {18,6,10,30,60,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [19] = {19,6,10,30,60,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [20] = {20,6,10,30,60,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
        [21] = {21,11,16,30,60,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [22] = {22,11,16,30,60,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [23] = {23,11,16,30,60,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [24] = {24,11,16,30,60,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [25] = {25,11,16,30,60,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [26] = {26,11,16,30,60,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [27] = {27,11,16,30,60,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [28] = {28,11,16,30,60,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [29] = {29,11,16,30,60,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [30] = {30,11,16,30,60,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
        [31] = {31,0,5,61,999,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [32] = {32,0,5,61,999,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [33] = {33,0,5,61,999,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [34] = {34,0,5,61,999,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [35] = {35,0,5,61,999,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [36] = {36,0,5,61,999,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [37] = {37,0,5,61,999,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [38] = {38,0,5,61,999,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [39] = {39,0,5,61,999,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [40] = {40,0,5,61,999,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
        [41] = {41,6,10,61,999,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [42] = {42,6,10,61,999,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [43] = {43,6,10,61,999,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [44] = {44,6,10,61,999,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [45] = {45,6,10,61,999,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [46] = {46,6,10,61,999,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [47] = {47,6,10,61,999,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [48] = {48,6,10,61,999,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [49] = {49,6,10,61,999,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [50] = {50,6,10,61,999,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
        [51] = {51,11,16,61,999,1,1,1,"重置日常副本",54,"重置|去战斗",1,},
        [52] = {52,11,16,61,999,2,1,1,"重置过关斩将",76,"重置|去战斗",1,},
        [53] = {53,11,16,61,999,3,100,0,"攻打主线副本获得双倍奖励",51,"去战斗",1,},
        [54] = {54,11,16,61,999,4,100,0,"攻打精英副本获得双倍奖励",53,"去战斗",1,},
        [55] = {55,11,16,61,999,5,100,0,"攻打名将副本获得双倍奖励",56,"去战斗",1,},
        [56] = {56,11,16,61,999,6,100,0,"游历行动产出双倍宝物经验和银两",73,"去游历",1,},
        [57] = {57,11,16,61,999,7,100,0,"军团祭祀和今日军团声望双倍",5,"去军团",1,},
        [58] = {58,11,16,61,999,8,100,0,"每日签到获得的奖励双倍",608,"去领取",1,},
        [59] = {59,11,16,61,999,9,100,0,"五谷丰登获得的奖励双倍",95,"去领取",0,},
        [60] = {60,11,16,61,999,10,100,0,"每日任务奖励双倍",8,"去领取",0,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in return_privilege")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function return_privilege.length()
    return #return_privilege._data
end

-- 
function return_privilege.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function return_privilege.indexOf(index)
    if index == nil or not return_privilege._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/return_privilege.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "return_privilege" )
        return setmetatable({_raw = return_privilege._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = return_privilege._data[index]}, mt)
end

--
function return_privilege.get(id)
    
    return return_privilege.indexOf(__index_id[id])
        
end

--
function return_privilege.set(id, key, value)
    local record = return_privilege.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function return_privilege.index()
    return __index_id
end

return return_privilege