--return_activity

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --编号-int 
  vip_min = 2,    --VIP等级下限-int 
  vip_max = 3,    --VIP等级上限-int 
  day_min = 4,    --开服天数下限-int 
  day_max = 5,    --开服天数上限-int 
  week_circle = 6,    --每周循环限制-string 
  mission_type = 7,    --任务类型-int 
  mission_time = 8,    --完成次数-int 
  mission_description = 9,    --任务说明-string 
  is_work = 10,    --是否生效-int 
  reward_type1 = 11,    --奖励类型1-int 
  reward_value1 = 12,    --奖励类性值1-int 
  reward_size1 = 13,    --奖励数量1-int 
  reward_type2 = 14,    --奖励类型2-int 
  reward_value2 = 15,    --奖励类性值2-int 
  reward_size2 = 16,    --奖励数量2-int 
  reward_type3 = 17,    --奖励类型3-int 
  reward_value3 = 18,    --奖励类性值3-int 
  reward_size3 = 19,    --奖励数量3-int 

}

-- key type
local __key_type = {
  id = "int",    --编号-1 
  vip_min = "int",    --VIP等级下限-2 
  vip_max = "int",    --VIP等级上限-3 
  day_min = "int",    --开服天数下限-4 
  day_max = "int",    --开服天数上限-5 
  week_circle = "string",    --每周循环限制-6 
  mission_type = "int",    --任务类型-7 
  mission_time = "int",    --完成次数-8 
  mission_description = "string",    --任务说明-9 
  is_work = "int",    --是否生效-10 
  reward_type1 = "int",    --奖励类型1-11 
  reward_value1 = "int",    --奖励类性值1-12 
  reward_size1 = "int",    --奖励数量1-13 
  reward_type2 = "int",    --奖励类型2-14 
  reward_value2 = "int",    --奖励类性值2-15 
  reward_size2 = "int",    --奖励数量2-16 
  reward_type3 = "int",    --奖励类型3-17 
  reward_value3 = "int",    --奖励类性值3-18 
  reward_size3 = "int",    --奖励数量3-19 

}


-- data
local return_activity = {
    _data = {
        [1] = {1,0,5,30,60,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,100,0,0,0,0,0,0,},
        [2] = {2,0,5,30,60,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,100,0,0,0,0,0,0,},
        [3] = {3,0,5,30,60,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,100,0,0,0,0,0,0,},
        [4] = {4,0,5,30,60,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,100,0,0,0,0,0,0,},
        [5] = {5,0,5,30,60,"1|4",5,1,"参加阵营竞技",1,5,1,100,0,0,0,0,0,0,},
        [6] = {6,0,5,30,60,"2|6",6,1,"参加军团战",1,5,1,100,0,0,0,0,0,0,},
        [7] = {7,0,5,30,60,"3|5|0",7,1,"参加三国战纪",1,5,1,100,0,0,0,0,0,0,},
        [8] = {8,0,5,30,60,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,100,0,0,0,0,0,0,},
        [9] = {9,0,5,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [10] = {10,0,5,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [11] = {11,6,10,30,60,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,200,0,0,0,0,0,0,},
        [12] = {12,6,10,30,60,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,200,0,0,0,0,0,0,},
        [13] = {13,6,10,30,60,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,200,0,0,0,0,0,0,},
        [14] = {14,6,10,30,60,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,200,0,0,0,0,0,0,},
        [15] = {15,6,10,30,60,"1|4",5,1,"参加阵营竞技",1,5,1,200,0,0,0,0,0,0,},
        [16] = {16,6,10,30,60,"2|6",6,1,"参加军团战",1,5,1,200,0,0,0,0,0,0,},
        [17] = {17,6,10,30,60,"3|5|0",7,1,"参加三国战纪",1,5,1,200,0,0,0,0,0,0,},
        [18] = {18,6,10,30,60,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,200,0,0,0,0,0,0,},
        [19] = {19,6,10,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [20] = {20,6,10,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [21] = {21,11,16,30,60,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,300,0,0,0,0,0,0,},
        [22] = {22,11,16,30,60,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,300,0,0,0,0,0,0,},
        [23] = {23,11,16,30,60,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,300,0,0,0,0,0,0,},
        [24] = {24,11,16,30,60,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,300,0,0,0,0,0,0,},
        [25] = {25,11,16,30,60,"1|4",5,1,"参加阵营竞技",1,5,1,300,0,0,0,0,0,0,},
        [26] = {26,11,16,30,60,"2|6",6,1,"参加军团战",1,5,1,300,0,0,0,0,0,0,},
        [27] = {27,11,16,30,60,"3|5|0",7,1,"参加三国战纪",1,5,1,300,0,0,0,0,0,0,},
        [28] = {28,11,16,30,60,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,300,0,0,0,0,0,0,},
        [29] = {29,11,16,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [30] = {30,11,16,30,60,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [31] = {31,0,5,61,999,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,400,0,0,0,0,0,0,},
        [32] = {32,0,5,61,999,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,400,0,0,0,0,0,0,},
        [33] = {33,0,5,61,999,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,400,0,0,0,0,0,0,},
        [34] = {34,0,5,61,999,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,400,0,0,0,0,0,0,},
        [35] = {35,0,5,61,999,"1|4",5,1,"参加阵营竞技",1,5,1,400,0,0,0,0,0,0,},
        [36] = {36,0,5,61,999,"2|6",6,1,"参加军团战",1,5,1,400,0,0,0,0,0,0,},
        [37] = {37,0,5,61,999,"3|5|0",7,1,"参加三国战纪",1,5,1,400,0,0,0,0,0,0,},
        [38] = {38,0,5,61,999,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,400,0,0,0,0,0,0,},
        [39] = {39,0,5,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [40] = {40,0,5,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [41] = {41,6,10,61,999,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,500,0,0,0,0,0,0,},
        [42] = {42,6,10,61,999,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,500,0,0,0,0,0,0,},
        [43] = {43,6,10,61,999,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,500,0,0,0,0,0,0,},
        [44] = {44,6,10,61,999,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,500,0,0,0,0,0,0,},
        [45] = {45,6,10,61,999,"1|4",5,1,"参加阵营竞技",1,5,1,500,0,0,0,0,0,0,},
        [46] = {46,6,10,61,999,"2|6",6,1,"参加军团战",1,5,1,500,0,0,0,0,0,0,},
        [47] = {47,6,10,61,999,"3|5|0",7,1,"参加三国战纪",1,5,1,500,0,0,0,0,0,0,},
        [48] = {48,6,10,61,999,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,500,0,0,0,0,0,0,},
        [49] = {49,6,10,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [50] = {50,6,10,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [51] = {51,11,16,61,999,"1|2|3|4|5|6|0",1,1,"参加12:00军团BOSS活动",1,5,1,600,0,0,0,0,0,0,},
        [52] = {52,11,16,61,999,"1|2|3|4|5|6|0",2,1,"参加军团答题活动",1,5,1,600,0,0,0,0,0,0,},
        [53] = {53,11,16,61,999,"1|2|3|4|5|6|0",3,1,"参加军团试炼活动",1,5,1,600,0,0,0,0,0,0,},
        [54] = {54,11,16,61,999,"1|2|3|4|5|6|0",4,1,"参加19:00军团BOSS活动",1,5,1,600,0,0,0,0,0,0,},
        [55] = {55,11,16,61,999,"1|4",5,1,"参加阵营竞技",1,5,1,600,0,0,0,0,0,0,},
        [56] = {56,11,16,61,999,"2|6",6,1,"参加军团战",1,5,1,600,0,0,0,0,0,0,},
        [57] = {57,11,16,61,999,"3|5|0",7,1,"参加三国战纪",1,5,1,600,0,0,0,0,0,0,},
        [58] = {58,11,16,61,999,"1|2|3|4|5|6|0",8,2,"参加华容道#num#",1,5,1,600,0,0,0,0,0,0,},
        [59] = {59,11,16,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
        [60] = {60,11,16,61,999,"",0,0,"",0,0,0,0,0,0,0,0,0,0,},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in return_activity")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function return_activity.length()
    return #return_activity._data
end

-- 
function return_activity.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function return_activity.indexOf(index)
    if index == nil or not return_activity._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/return_activity.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "return_activity" )
        return setmetatable({_raw = return_activity._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = return_activity._data[index]}, mt)
end

--
function return_activity.get(id)
    
    return return_activity.indexOf(__index_id[id])
        
end

--
function return_activity.set(id, key, value)
    local record = return_activity.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function return_activity.index()
    return __index_id
end

return return_activity