--silkbag

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --锦囊id-int 
  name = 2,    --锦囊名称-string 
  icon = 3,    --锦囊icon-int 
  color = 4,    --锦囊品质-int 
  profile = 5,    --锦囊短描述-string 
  description = 6,    --锦囊详情-string 
  hero = 7,    --适用武将-string 
  mapping = 8,    --适用武将库-int 
  show_day = 9,    --图鉴显示天数-int 
  order = 10,    --图鉴排序-int 
  only = 11,    --是否唯一-int 
  silk_type = 12,    --锦囊类型-int 
  type1 = 13,    --属性1类型-int 
  size1 = 14,    --属性1数值-int 
  growth1 = 15,    --属性1成长-int 
  type2 = 16,    --属性2类型-int 
  size2 = 17,    --属性2数值-int 
  growth2 = 18,    --属性2成长-int 
  fake = 19,    --假战力-int 
  bag_description = 20,    --背包锦囊描述-string 
  button_type = 21,    --按钮类型-int 
  function_id = 22,    --跳转功能id-int 
  button_txt = 23,    --按钮文字-string 
  recycle_type = 24,    --回收资源货币类型-int 
  recycle_value = 25,    --回收资源货币名称-int 
  recycle_size = 26,    --回收资源货币数量-int 
  is_fight = 27,    --无差别竞技里可用赛区-int 
  moving = 28,    --特效-string 

}

-- key type
local __key_type = {
  id = "int",    --锦囊id-1 
  name = "string",    --锦囊名称-2 
  icon = "int",    --锦囊icon-3 
  color = "int",    --锦囊品质-4 
  profile = "string",    --锦囊短描述-5 
  description = "string",    --锦囊详情-6 
  hero = "string",    --适用武将-7 
  mapping = "int",    --适用武将库-8 
  show_day = "int",    --图鉴显示天数-9 
  order = "int",    --图鉴排序-10 
  only = "int",    --是否唯一-11 
  silk_type = "int",    --锦囊类型-12 
  type1 = "int",    --属性1类型-13 
  size1 = "int",    --属性1数值-14 
  growth1 = "int",    --属性1成长-15 
  type2 = "int",    --属性2类型-16 
  size2 = "int",    --属性2数值-17 
  growth2 = "int",    --属性2成长-18 
  fake = "int",    --假战力-19 
  bag_description = "string",    --背包锦囊描述-20 
  button_type = "int",    --按钮类型-21 
  function_id = "int",    --跳转功能id-22 
  button_txt = "string",    --按钮文字-23 
  recycle_type = "int",    --回收资源货币类型-24 
  recycle_value = "int",    --回收资源货币名称-25 
  recycle_size = "int",    --回收资源货币数量-26 
  is_fight = "int",    --无差别竞技里可用赛区-27 
  moving = "string",    --特效-28 

}


-- data
local silkbag = {
    _data = {
        [1] = {1101,"关银屏锦囊",1101,4,"攻击+1000","攻击+1000（主角每升1级攻击额外+40）","999",0,0,2,1,1,1,1000,40,0,0,0,72000,"攻击+1000(每级+40）",1,91,"去穿戴",5,1,600,0,"",},
        [2] = {1102,"张星彩锦囊",1102,4,"生命+7500","生命+7500（主角每升1级生命额外+300）","999",0,0,3,1,1,7,7500,300,0,0,0,72000,"生命+7500(每级+300）",1,91,"去穿戴",5,1,600,0,"",},
        [3] = {1103,"周泰锦囊",1103,4,"防御+500","防御+500（主角每升1级防御额外+20）","999",0,0,4,1,1,5,500,20,6,500,20,72000,"防御+500(每级+20）",1,91,"去穿戴",5,1,600,0,"",},
        [4] = {1104,"吕灵雎锦囊",1104,4,"暴击概率+8%","暴击概率+8%","999",0,0,6,1,1,15,80,0,0,0,0,72000,"暴击概率+8%",1,91,"去穿戴",5,1,600,0,"",},
        [5] = {1105,"黄盖锦囊",1105,4,"抗暴概率+8%","抗暴概率+8%","999",0,0,5,1,1,16,80,0,0,0,0,72000,"抗暴概率+8%",1,91,"去穿戴",5,1,600,0,"",},
        [6] = {1106,"张让锦囊",1106,4,"伤害+5%","伤害+5%","999",0,0,7,1,1,19,50,0,0,0,0,72000,"伤害+5%",1,91,"去穿戴",5,1,600,0,"",},
        [7] = {1107,"蔡文姬锦囊",1107,4,"伤害减免+5%","伤害减免+5%","999",0,0,8,1,1,20,50,0,0,0,0,72000,"伤害减免+5%",1,91,"去穿戴",5,1,600,0,"",},
        [8] = {1108,"于禁锦囊",1108,4,"暴击伤害+5%","暴击伤害+5%","999",0,0,1,1,1,21,50,0,0,0,0,72000,"暴击伤害+5%",1,91,"去穿戴",5,1,600,0,"",},
        [9] = {1202,"刘备锦囊",1202,5,"释放技能治疗提升","治疗武将释放技能时，对己方血量最少武将造成治疗效果额外提升55%。","102|202|302|402|216",11202,0,6,1,2,0,0,0,0,0,0,240000,"释放技能治疗增加",1,91,"去穿戴",5,1,1800,1,"",},
        [10] = {1203,"陆逊锦囊",1203,5,"灼烧概率提升","攻击目标越少，灼烧概率提升越高，最多对1个目标提高60%的灼烧概率。","303|305|311|319|313",11203,0,17,1,5,0,0,0,0,0,0,240000,"灼烧概率增加",1,91,"去穿戴",5,1,1800,1,"",},
        [11] = {1204,"公孙瓒锦囊",1204,5,"攻击单体目标降低1点怒气","攻击单体目标时额外降低目标1点怒气。","212|312|404|408|409|412|413|414|415|416|417|419",11204,0,22,1,4,0,0,0,0,0,0,240000,"攻击单体目标降低其1点怒气",1,91,"去穿戴",5,1,1800,1,"",},
        [12] = {1205,"关羽锦囊",1205,5,"初始提升1点怒气","初始怒气增加1点。","999",0,0,8,1,1,23,1,0,0,0,0,240000,"初始增加1点怒气",1,91,"去穿戴",5,1,1800,1,"",},
        [13] = {1207,"马超锦囊",1207,5,"提升护盾伤害减免效果","保护目标越少，减伤效果越高，最高可以减免36%的伤害。（只对当前有减伤护盾的武将生效）","118|207|215|405",11207,0,10,1,10,0,0,0,0,0,0,240000,"提升护盾伤害减免效果",1,91,"去穿戴",5,1,1800,1,"",},
        [14] = {1208,"贾诩锦囊",1208,5,"中毒概率提升","技能攻击目标越少，中毒概率提升越高，最多提高60%的中毒概率。","410|407",11208,0,21,1,6,0,0,0,0,0,0,240000,"中毒概率增加",1,91,"去穿戴",5,1,1800,1,"",},
        [15] = {1209,"徐庶锦囊",1209,5,"晕眩概率提升","攻击目标越少，晕眩概率提升越高，最多提高48%的晕眩概率。（只对当前有晕眩效果的武将生效）","106|116|203|210|212|214|307|312|317|401|408|415",11209,0,12,1,7,0,0,0,0,0,0,240000,"晕眩概率增加",1,91,"去穿戴",5,1,1800,1,"",},
        [16] = {1211,"于吉锦囊",1211,5,"中毒伤害提升","攻击目标越少，技能造成的中毒伤害提升越高，最多对1个目标提高60%的中毒伤害。","410|407",11211,0,23,1,6,0,0,0,0,0,0,240000,"中毒伤害提升",1,91,"去穿戴",5,1,1800,1,"",},
        [17] = {1212,"小乔锦囊",1212,5,"麻痹概率提升","攻击目标越少，麻痹概率提升越高，最多对1个目标提高72%的麻痹概率。（只对当前有麻痹效果的武将生效）","219|304|411",11212,0,13,1,9,0,0,0,0,0,0,240000,"麻痹概率提升",1,91,"去穿戴",5,1,1800,1,"",},
        [18] = {1213,"郭嘉锦囊",1213,5,"沉默概率提升","攻击目标越少，沉默概率提升越高，最多对1个目标提高72%的沉默概率。（只对当前有沉默效果的武将生效）","104|115|409|419",11213,0,1,1,8,0,0,0,0,0,0,240000,"沉默概率提升",1,91,"去穿戴",5,1,1800,1,"",},
        [19] = {1214,"夏侯惇锦囊",1214,5,"反伤比例提升","反伤增加30%。（只对当前有反伤效果的武将生效）","105",11214,0,2,1,11,0,0,0,0,0,0,240000,"反伤比例提升",1,91,"去穿戴",5,1,1800,1,"",},
        [20] = {1215,"张飞锦囊",1215,5,"攻击+3000","攻击+3000（主角每升1级攻击额外+120）","999",0,0,9,1,1,1,3000,120,0,0,0,240000,"攻击+3000(每级+120）",1,91,"去穿戴",5,1,1800,1,"",},
        [21] = {1216,"庞统锦囊",1216,5,"生命+22500","生命+22500（主角每升1级生命额外+900）","999",0,0,11,1,1,7,22500,900,0,0,0,240000,"生命+22500(每级+900）",1,91,"去穿戴",5,1,1800,1,"",},
        [22] = {1217,"孙坚锦囊",1217,5,"防御+1500","防御+1500（主角每升1级防御额外+60）","999",0,0,15,1,1,5,1500,60,6,1500,60,240000,"防御+1500(每级+60）",1,91,"去穿戴",5,1,1800,1,"",},
        [23] = {1218,"袁术锦囊",1218,5,"暴击概率+20%","暴击概率+20%","999",0,0,24,1,1,15,200,0,0,0,0,240000,"暴击概率+20%",1,91,"去穿戴",5,1,1800,1,"",},
        [24] = {1219,"黄月英锦囊",1219,5,"抗暴概率+20%","抗暴概率+20%","999",0,0,7,1,1,16,200,0,0,0,0,240000,"抗暴概率+20%",1,91,"去穿戴",5,1,1800,1,"",},
        [25] = {1220,"典韦锦囊",1220,5,"伤害+12%","伤害+12%","999",0,0,3,1,1,19,120,0,0,0,0,240000,"伤害+12%",1,91,"去穿戴",5,1,1800,1,"",},
        [26] = {1221,"董卓锦囊",1221,5,"伤害减免+12%","伤害减免+12%","999",0,0,20,1,1,20,120,0,0,0,0,240000,"伤害减免+12%",1,91,"去穿戴",5,1,1800,1,"",},
        [27] = {1222,"孙尚香锦囊",1222,5,"暴击伤害+12%","暴击伤害+12%","999",0,0,16,1,1,21,120,0,0,0,0,240000,"暴击伤害+12%",1,91,"去穿戴",5,1,1800,1,"",},
        [28] = {1223,"许褚锦囊",1223,5,"击杀目标回复自身1点怒气","击杀目标回复自身1点怒气。","1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",11223,0,4,1,3,0,0,0,0,0,0,240000,"击杀目标回复自身1点怒气",1,91,"去穿戴",5,1,1800,1,"",},
        [29] = {1224,"甄姬锦囊",1224,5,"技能伤害转化治疗比例提升","技能伤害转化为血量治疗当前血量最少的武将的比例提升18%。（只对当前有技能转治疗的辅助武将生效）","103|112|117|204|211|404|412",11224,7,5,1,13,0,0,0,0,0,0,240000,"技能伤害转化治疗比例提升",1,91,"去穿戴",5,1,1800,1,"",},
        [30] = {1225,"华佗锦囊",1225,5,"中毒伤害回复自身血量","造成的中毒伤害的10%转化为血量治疗自己。","407|410",11225,7,18,1,6,0,0,0,0,0,0,240000,"造成的中毒伤害回复自身血量",1,91,"去穿戴",5,1,1800,1,"",},
        [31] = {1226,"大乔锦囊",1226,5,"治疗效果提升并附加减伤护盾","技能的治疗效果提升25%，同时为技能目标附加1个免伤盾，受到所有伤害降低12%，持续1回合。","102|202|302|402|216",11226,7,14,1,2,0,0,0,0,0,0,240000,"治疗效果提升并附加护盾",1,91,"去穿戴",5,1,1800,1,"",},
        [32] = {1227,"貂蝉锦囊",1227,5,"降低自身被控制概率","受到的控制效果（麻痹、沉默、晕眩）概率降低35%。","999",11227,7,19,1,15,0,0,0,0,0,0,240000,"降低自身被控制概率",1,91,"去穿戴",5,1,1800,1,"",},
        [33] = {1301,"赵云锦囊",1301,6,"普通攻击必定暴击","普通攻击必定暴击。（包括治疗武将）","999",11301,7,5,1,1,0,0,0,0,0,0,720000,"普通攻击必定暴击",1,91,"去穿戴",5,1,5400,1,"",},
        [34] = {1303,"周瑜锦囊",1303,6,"灼烧持续回合数增加","主动造成的灼烧状态额外延长1回合。","303|305|311|319|313",11303,7,7,1,5,0,0,0,0,0,0,720000,"灼烧状态额外增加1回合",1,91,"去穿戴",5,1,5400,1,"",},
        [35] = {1304,"左慈锦囊",1304,6,"中毒附加封疗效果","中毒附加封疗效果，中毒状态的武将无法受到治疗。","410|407",11304,7,11,1,6,0,0,0,0,0,0,720000,"中毒附加封疗效果",1,91,"去穿戴",5,1,5400,1,"",},
        [36] = {1308,"曹操锦囊",1308,6,"清除敌方武将无敌效果","攻击目标越少，清除敌方武将无敌状态概率越高，最多对1个目标提高100%的清除无敌概率。","1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",11308,7,3,1,12,0,0,0,0,0,0,720000,"清除敌方武将无敌效果",1,91,"去穿戴",5,1,5400,1,"",},
        [37] = {1302,"神·曹仁锦囊",1302,6,"攻击纵排目标降低1点怒气","攻击纵排目标时，额外降低目标1点怒气。（只对当前有纵排减怒效果的武将生效）","106|210|406",11302,7,4,1,4,0,0,0,0,0,0,720000,"攻击纵排目标降低其1点怒气",1,91,"去穿戴",5,1,5400,1,"",},
        [38] = {1309,"神·陆逊锦囊",1309,6,"被灼烧武将封无敌","被灼烧的武将无法获得无敌和无敌吸血盾效果。","303|305|311|319|313",11309,7,10,1,5,0,0,0,0,0,0,720000,"被灼烧的武将无法获得无敌效果",1,91,"去穿戴",5,1,5400,1,"",},
        [39] = {1310,"神·黄月英锦囊",1310,6,"首回合免疫控制","首回合免疫晕眩、沉默、麻痹效果。","999",11310,7,9,1,14,0,0,0,0,0,0,720000,"首回合免疫晕眩、沉默、麻痹效果",1,91,"去穿戴",5,1,5400,1,"",},
        [40] = {1311,"神·华佗锦囊",1311,6,"技能伤害转化为治疗","技能伤害的18%转化为血量，治疗自己。","1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",11311,7,12,1,13,0,0,0,0,0,0,720000,"技能伤害转化为血量治疗自己",1,91,"去穿戴",5,1,5400,1,"",},
        [41] = {1312,"司马懿锦囊",1312,6,"消耗所有怒气增加技能伤害","武将怒气小于7点时，不会释放技能；释放技能消耗当前所有怒气，超过4点怒气部分，每额外消耗1点怒气，技能伤害增加15%。","999",11312,7,1,1,1,0,0,0,0,0,0,720000,"消耗所有怒气增加技能伤害",1,91,"去穿戴",5,1,5400,1,"",},
        [42] = {1305,"神·贾诩锦囊",1305,6,"中毒持续回合数增加","技能造成的中毒状态延长1回合。","410|407",11305,7,13,1,6,0,0,0,0,0,0,720000,"中毒状态额外增加1回合",1,91,"去穿戴",5,1,5400,1,"",},
        [43] = {1313,"神·荀彧锦囊",1313,6,"释放技能治疗提升","治疗武将释放技能时，对己方血量最少的3个武将治疗效果额外提升治疗武将攻击的32%。","102|202|302|402|216",11313,7,2,1,2,0,0,0,0,0,0,720000,"释放技能治疗提升",1,91,"去穿戴",5,1,5400,1,"",},
        [44] = {1314,"桃园结义锦囊",1314,6,"分摊受到的伤害","受到的伤害降低12%，并且将自身受到的非致命伤害平分给自身及己方当前血量最高的2名武将。（被分摊伤害时处于无敌状态的武将，也会受到伤害）","999",11314,7,6,1,16,0,0,0,0,0,0,720000,"分摊受到的伤害",1,91,"去穿戴",5,1,5400,1,"",},
        [45] = {1315,"神·太史慈锦囊",1315,6,"灼烧概率大幅提升","攻击目标越少，灼烧概率提升越高，最多对1个目标提高96%的灼烧概率。","303|305|311|319|313",11315,7,8,1,5,0,0,0,0,0,0,720000,"灼烧概率大幅提升",1,91,"去穿戴",5,1,5400,1,"",},
        [46] = {1316,"青青子衿锦囊",1316,6,"回合结束回复悠悠我心1点怒气","该武将每回合首次出手后，佩戴悠悠我心锦囊的武将可额外获得1点怒气。（每套阵容限定1名男性武将佩戴）","998",11316,21,14,2,3,0,0,0,0,0,0,720000,"回合结束回复悠悠我心1点怒气",1,91,"去穿戴",5,1,5400,0,"",},
        [47] = {1317,"悠悠我心锦囊",1317,6,"回合结束回复青青子衿1点怒气","该武将每回合首次出手后，佩戴青青子衿锦囊的武将可额外获得1点怒气。（每套阵容限定1名女性武将佩戴）","997",11317,21,15,2,3,0,0,0,0,0,0,720000,"回合结束回复青青子衿1点怒气",1,91,"去穿戴",5,1,5400,0,"",},
        [48] = {1318,"千里走单骑锦囊",1318,6,"攻击敌方当前血量最少武将","单体输出武将的所有攻击优先攻击敌方当前血量最低的武将。","205|213|308|310|316|413",11318,21,16,1,1,0,0,0,0,0,0,720000,"攻击敌方当前血量最少武将",1,91,"去穿戴",5,1,5400,1,"",},
        [49] = {1319,"一骑当千锦囊",1319,6,"击杀目标追加1次技能","单体输出武将击杀目标后，追加1次技能，对敌方单体造成175%物理伤害。（追加的技能不消耗怒气，不触发任何特性）","205|213|308|310|316|413",11319,21,17,1,1,0,0,0,0,0,0,720000,"击杀目标追加1次技能",1,91,"去穿戴",5,1,5400,1,"",},
        [50] = {1401,"七杀锦囊",1401,7,"造成的伤害被分摊比例下降","我方纵排、前排、后排输出武将对敌方造成的伤害如果被分摊，其分摊的比例降低50%","107|108|109|113|114|201|206|208|209|217|218|250|301|306|318|406|407|414|416",11322,21,1,1,1,0,0,0,0,0,0,2160000,"我方纵排、前排、后排输出武将对敌方造成的伤害如果被分摊，其分摊的比例降低50%",1,91,"去穿戴",5,1,16200,2,"effect_jinnang_qisha",},
        [51] = {1402,"贪狼锦囊",1402,7,"击杀目标获得怒气","技能直接击杀敌方目标时，获得目标剩余的所有怒气（输出武将佩戴）","101|107|108|109|111|113|114|150|201|205|206|208|209|217|218|250|301|306|308|310|316|318|350|403|406|407|410|413|414|416|450",11321,21,1,1,1,0,0,0,0,0,0,2160000,"击杀敌方目标时，获得目标剩余的所有怒气（输出武将佩戴）",1,91,"去穿戴",5,1,16200,2,"effect_jinnang_tanlang",},
        [52] = {1403,"传说·关羽锦囊",1403,7,"初始怒气增加2点","初始怒气增加2点","999",0,21,1,1,1,23,2,0,0,0,0,2160000,"初始怒气增加2点",1,91,"去穿戴",5,1,16200,2,"effect_jinnang_guanyu",},
        [53] = {1404,"破釜沉舟锦囊",1404,7,"每回合受到的伤害有上限","每回合最多受到自身生命值上限50%的伤害（该伤害为来自于武将的直接伤害）","105|119|207|215|309|314|405|418",11323,21,1,2,1,0,0,0,0,0,0,2160000,"每回合受到的伤害有上限",1,91,"去穿戴",5,1,16200,0,"effect_jinnang_guanyu",},
        [54] = {1405,"同舟共济锦囊",1405,7,"吸收同阵营友方武将的伤害","同阵营的武将受到敌方武将直接伤害时，该伤害的50%会转移给佩戴此锦囊的武将（无法触发任何特性，无法被无敌免疫）","105|119|207|215|309|314|405|418",11324,21,1,2,1,0,0,0,0,0,0,2160000,"吸收同阵营友方武将的伤害",1,91,"去穿戴",5,1,16200,0,"effect_jinnang_guanyu",},
    }
}

-- index
local __index_id = {
    [1101] = 1,
    [1102] = 2,
    [1103] = 3,
    [1104] = 4,
    [1105] = 5,
    [1106] = 6,
    [1107] = 7,
    [1108] = 8,
    [1202] = 9,
    [1203] = 10,
    [1204] = 11,
    [1205] = 12,
    [1207] = 13,
    [1208] = 14,
    [1209] = 15,
    [1211] = 16,
    [1212] = 17,
    [1213] = 18,
    [1214] = 19,
    [1215] = 20,
    [1216] = 21,
    [1217] = 22,
    [1218] = 23,
    [1219] = 24,
    [1220] = 25,
    [1221] = 26,
    [1222] = 27,
    [1223] = 28,
    [1224] = 29,
    [1225] = 30,
    [1226] = 31,
    [1227] = 32,
    [1301] = 33,
    [1302] = 37,
    [1303] = 34,
    [1304] = 35,
    [1305] = 42,
    [1308] = 36,
    [1309] = 38,
    [1310] = 39,
    [1311] = 40,
    [1312] = 41,
    [1313] = 43,
    [1314] = 44,
    [1315] = 45,
    [1316] = 46,
    [1317] = 47,
    [1318] = 48,
    [1319] = 49,
    [1401] = 50,
    [1402] = 51,
    [1403] = 52,
    [1404] = 53,
    [1405] = 54,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in silkbag")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function silkbag.length()
    return #silkbag._data
end

-- 
function silkbag.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function silkbag.indexOf(index)
    if index == nil or not silkbag._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/silkbag.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "silkbag" )
        return setmetatable({_raw = silkbag._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = silkbag._data[index]}, mt)
end

--
function silkbag.get(id)
    
    return silkbag.indexOf(__index_id[id])
        
end

--
function silkbag.set(id, key, value)
    local record = silkbag.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function silkbag.index()
    return __index_id
end

return silkbag