--team_recommend

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --阵容推荐ID-int 
  country = 2,    --阵容阵营-int 
  name = 3,    --阵容名称-string 
  hero1 = 4,    --武将1-int 
  hero2 = 5,    --武将2-int 
  hero3 = 6,    --武将3-int 
  hero4 = 7,    --武将4-int 
  hero5 = 8,    --武将5-int 
  hero6 = 9,    --武将6-int 
  title1 = 10,    --说明标题1-string 
  description1 = 11,    --说明内容1-string 
  title2 = 12,    --说明标题2-string 
  description2 = 13,    --说明内容2-string 
  title3 = 14,    --说明标题3-string 
  description3 = 15,    --说明内容3-string 

}

-- key type
local __key_type = {
  id = "int",    --阵容推荐ID-1 
  country = "int",    --阵容阵营-2 
  name = "string",    --阵容名称-3 
  hero1 = "int",    --武将1-4 
  hero2 = "int",    --武将2-5 
  hero3 = "int",    --武将3-6 
  hero4 = "int",    --武将4-7 
  hero5 = "int",    --武将5-8 
  hero6 = "int",    --武将6-9 
  title1 = "string",    --说明标题1-10 
  description1 = "string",    --说明内容1-11 
  title2 = "string",    --说明标题2-12 
  description2 = "string",    --说明内容2-13 
  title3 = "string",    --说明标题3-14 
  description3 = "string",    --说明内容3-15 

}


-- data
local team_recommend = {
    _data = {
        [1] = {1,1,"输出阵",107,110,108,109,102,1,"阵营特色","魏国拥有强大的$c5_回怒能力$，所有的武将都拥有回怒天赋，可以通过合理搭配组成$c5_“永动机”$玩法|永动机就是每回合给特定的英雄回复足够的怒气，使他们每次出手都可以释放技能|永动机玩法有很强的多样性和灵活性，可以根据自己拥有的武将和自身需要，打造专属于自己的永动机阵容","打法思路","$c5_典韦$高暴击输出，$c5_许褚$收割残血，$c5_张辽$突击后排|$c5_张郃$技能附带的无敌盾具备强大的保护队友能力，$c5_荀彧$高效的治疗和受击治疗保证了队伍的存活能力|激活了$c5_典韦+许褚$、$c5_张辽+张郃$两组合击，使输出更上一层楼","武将解析","一号位$c5_典韦$，高暴击输出，能够打残甚至秒杀敌方纵排敌人|二号位$c5_张郃$，释放技能攻击敌方后排单体武将，并且无敌保护血量最少的队友，具有强大的保护能力|三号位$c5_许褚$，释放技能攻击敌方前排，并且附带必暴的追击，收割残血能力超强|四号位$c5_张辽$，释放技能攻击敌方后排，能够配合典韦、张郃对敌方后排武将造成致命打击|五号位$c5_荀彧$，超级高效治疗，受击回血能力也进一步保证了队伍的生存能力|六号位$c5_主角$，输出不容小觑，血量也不少，能扛能打（所有站位均可互换）",},
        [2] = {2,1,"输出控制阵",104,106,105,102,110,1,"阵营特色","魏国拥有强大的$c5_回怒能力$，所有的武将都拥有回怒天赋，可以通过合理搭配组成$c5_“永动机”$玩法|永动机就是每回合给特定的英雄回复足够的怒气，使他们每次出手都可以释放技能|永动机玩法有很强的多样性和灵活性，可以根据自己拥有的武将和自身需要，打造专属于自己的永动机阵容","打法思路","沉默、晕眩、无敌、回血，花样控制加回复，戏弄敌人于股掌之中|$c5_郭嘉$沉默敌方前排，$c5_曹仁$晕眩敌方纵排，$c5_夏侯惇$刚烈反伤并且具备回血能力，$c5_张郃$无敌保护，$c5_荀彧$高效治疗|激活了$c5_夏侯惇+曹仁$的合击，本阵容旨在通过高效的控制和保护手段，减少己方队伍受到的伤害，并一举消灭敌方","武将解析","一号位$c5_郭嘉$，释放技能沉默敌方前排，可以限制敌方前排首轮释放技能|二号位$c5_曹仁$，释放技能晕眩敌方纵排，可以限制敌方纵排首轮释放技能|三号位$c5_夏侯惇$，释放技能攻击敌方纵排，并回复自身血量，还拥有刚烈反伤能力，可以克制敌方单秒将（二、三号位站位可互换）|四号位$c5_荀彧$，超级高效治疗，受击回血能力也进一步保证了队伍的生存能力|五号位$c5_张郃$，释放技能攻击敌方后排单体武将，并且无敌保护血最少的队友，具有强大的保护能力|六号位$c5_主角$，输出不容小觑，血量也不少，能扛能打（所有站位均可互换）",},
        [3] = {3,2,"暴力输出阵",207,1,202,206,208,205,"阵营特色","蜀国拥有强大的$c5_输出能力$，通过暴力的输出迅速消灭敌人|采用一击制胜，速战速决；还是控制敌人，逐个点杀？战术多变，组合众多|不同的组合搭配会有不同的效果，目的都是追求极致的输出，享受秒人的快感","打法思路","$c5_马超$先手为前排提供减伤护盾；$c5_刘备$强大的治疗和受到技能伤害给全队回血的能力，保证了队伍的存活能力|$c5_张飞、关羽、黄忠$拥有强大的输出能力，力求快速斩杀敌人，解决战斗|激活了$c5_马超+黄忠$、$c5_关羽+张飞$两组合击，使得本就暴力的输出更上一层楼","武将解析","一号位$c5_马超$，释放技能后为己方前排提供减伤护盾，提升队伍的生存能力|二号位$c5_主角$，输出不容小觑，血量也不少，能扛能打|三号位$c5_刘备$，强大的治疗能力和受到技能伤害给全队回血的能力，保证了队伍的存活能力|四号位$c5_张飞$，释放技能攻击敌方前排，血量越少伤害越高，输出能力强大|五号位$c5_黄忠$，释放技能攻击敌方前排，并且拥有多种追击普攻的方式，收割残血小能手|六号位$c5_关羽$，强大的前排单体输出，暴击率高，适合单秒敌方前排核心武将（二、三、四、五、六号位站位可互换）",},
        [4] = {4,2,"输出控制阵",205,212,202,211,1,206,"阵营特色","蜀国拥有强大的$c5_输出能力$，通过暴力的输出迅速消灭敌人|采用一击制胜，速战速决；还是控制敌人，逐个点杀？战术多变，组合众多|不同的组合搭配会有不同的效果，目的都是追求极致的输出，享受秒人的快感","打法思路","在保证输出能力的前提下，增加了$c5_徐庶$控制敌方的能力和庞统攻击增幅的能力|$c5_张飞、关羽$依旧是强力输出的保障，$c5_庞统$的增加攻击光环效果，使得输出更加暴力|激活了$c5_庞统+徐庶、关羽+张飞$两组合击，使队伍造成的伤害更上一层楼","武将解析","一号位$c5_关羽$，强大的前排单体输出，暴击率高，适合单秒敌方前排核心武将，占得先机|二号位$c5_徐庶$，释放技能附带晕眩效果，能够有效控制敌方后排对位武将，打断其技能释放，延缓敌方输出|三号位$c5_刘备$，强大的治疗能力和受到技能伤害给全队回血的能力，保证了队伍的存活能力|四号位$c5_庞统$，拥有多个提升输出的光环，能够最大限度提升输出武将的输出能力|五号位$c5_主角$，输出不容小觑，血量也不少，能扛能打|六号位$c5_张飞$，释放技能攻击敌方前排，血量越少伤害越高，输出能力强大（所有站位均可互换）",},
        [5] = {5,3,"输出控制阵",305,311,307,306,308,1,"阵营特色","吴国拥有强大的$c5_纵火能力$，并且对灼烧目标有攻击加成和控制概率加成|纵火武将是队伍的核心，对敌人造成灼烧，接下来针对灼烧敌人造成爆发伤害|围绕纵火武将的能力，展开一系列的组合搭配，最大限度发挥灼烧队伍的优势","打法思路","配合$c5_太史慈$前排纵火、$c5_陆逊$后排纵火能力，对敌方造成全方位的打击|$c5_太史慈$配合$c5_孙权$，对敌方前排造成伤害，$c5_陆逊$配合$c5_甘宁$，对敌方后排造成伤害，$c5_吕蒙$对灼烧目标概率附加晕眩效果，达到控制目标的目的|激活$c5_太史慈+孙权、甘宁+吕蒙$两组合击，使伤害更上一层楼|$c5_太史慈、陆逊$的全面灼烧配置，最大限度发挥$c5_吕蒙$技能攻击敌方全体附带晕眩效果能力","武将解析","一号位$c5_太史慈$，释放技能对敌方前排造成灼烧效果|二号位$c5_陆逊$，释放技能对敌方后排造成灼烧效果（一、二号位站位可互换）|三号位$c5_吕蒙$，对敌方全体造成伤害，并附加晕眩效果，控制敌方|四号位$c5_孙权$，释放技能对敌方前排造成伤害，对灼烧目标有伤害加成|五号位$c5_甘宁$，释放技能对敌方后排单体造成大量伤害，并且附加追击，对灼烧目标有伤害加成，拥有强大的秒后排能力|六号位$c5_主角$，输出不容小觑，血量也不少，能扛能打（三、四、五号位站位可互换）",},
        [6] = {6,3,"前排输出阵",305,310,306,302,1,304,"阵营特色","吴国拥有强大的$c5_纵火能力$，并且对灼烧目标有攻击加成和控制概率加成|纵火武将是队伍的核心，对敌人造成灼烧，接下来针对灼烧敌人造成爆发伤害|围绕纵火武将的能力，展开一系列的组合搭配，最大限度发挥灼烧队伍的优势","打法思路","配合$c5_太史慈$的前排纵火能力，针对敌方前排造成伤害和控制|$c5_孙尚香、孙权$对灼烧目标伤害、暴击增加，$c5_小乔$对灼烧目标附带麻痹效果，组合起来针对敌方前排造成一系列的伤害、控制效果|激活$c5_太史慈+孙权$的合击，$c5_大乔$为队伍提供生存能力，$c5_小乔$为队伍输出提供可观的加成","武将解析","一号位$c5_太史慈$，释放技能对敌方前排造成灼烧效果|二号位$c5_孙尚香$，释放技能对敌方前排单体造成大量的伤害，对灼烧目标有伤害加成|三号位$c5_孙权$，释放技能对敌方前排造成伤害，对灼烧目标有伤害加成（二、三号位站位可互换）|四号$c5_位大乔$，释放技能、普攻附带持续治疗效果，提高队伍生存能力|五号位$c5_主角$，输出不容小觑，血量也不少，能扛能打（四、五号位站位可互换）|六号位$c5_小乔$，释放技能对灼烧目标附带麻痹效果，并且可以为队伍提供伤害加成",},
        [7] = {7,4,"毒伤阵",409,408,407,1,410,411,"阵营特色","群雄拥有强大的$c5_控制能力$，并具备减怒能力和毒伤能力|控制能力可以最大程度延缓敌人出手，拖延敌人；减怒能力可以延迟敌人释放技能；中毒伤害持续能力非常突出|控制队伍玩法多样，搭配灵活，巧妙应用各种控制能力的组合，削弱敌人，消耗敌人，取得胜利","打法思路","$c5_贾诩、于吉$技能附加的中毒效果拥有很高的伤害，并且持续2回合，战斗回合数越大，伤害越高|$c5_张角、公孙瓒、袁绍$最大程度控制对手，延长战斗回合数，发挥中毒伤害的最大效果|保证输出、控制的同时，激活了$c5_张角+于吉、贾诩+公孙瓒$两组合击，使伤害更上一层楼","武将解析","一号位$c5_张角$，释放技能附带沉默效果，可以限制敌方前排首轮释放技能|二号位$c5_公孙瓒$，释放技能附带减怒效果，可以限制敌方后排首轮释放技能（一、二号位站位可互换）|三号位$c5_贾诩$，释放技能附带中毒效果，可以对敌方前排造成2回合的中毒伤害|四号位$c5_主角$，输出不容小觑，血量也不少，能扛能打|五号位$c5_于吉$，释放技能附带中毒效果，对敌方随机3人造成2回合的中毒伤害（三、四、五号位站位可互换）|六号位$c5_袁绍$，释放技能附带麻痹效果，可以使敌方在第二回合无法普攻（无法回怒），延缓敌方下一轮技能的释放，达到延长战斗回合数的目的",},
        [8] = {8,4,"输出控制阵",409,405,410,402,1,406,"阵营特色","群雄拥有强大的$c5_控制能力$，并具备减怒能力和毒伤能力|控制能力可以最大程度延缓敌人出手，拖延敌人；减怒能力可以延迟敌人释放技能；中毒伤害持续能力非常突出|控制队伍玩法多样，搭配灵活，巧妙应用各种控制能力的组合，削弱敌人，消耗敌人，取得胜利","打法思路","$c5_于吉、华雄$拥有可观的输出能力，$c5_董卓$拥有强大的存活能力，$c5_张角$具备控制能力，推图竞技两不误|$c5_华佗$强力的治疗，使队伍的生存能力大大提升|保证输出的同时，激活了$c5_张角+于吉、董卓+华雄$两组合击，使伤害更上一层楼","武将解析","一号位$c5_张角$，释放技能附带沉默效果，可以限制敌方前排首轮释放技能|二号位$c5_董卓$，释放技能附带减伤护盾，可以大幅减少受到的伤害，为队伍吸收大量伤害|三号位$c5_于吉$，释放技能附带中毒效果，对敌方随机3人造成2回合的中毒效果|四号位$c5_华佗$，强大的治疗能力为队伍保驾护航，提高队伍的存活能力|五号位$c5_主角$，输出不容小觑，血量也不少，能扛能打（四、五号位站位可互换）|六号位$c5_华雄$，强力输出英雄，对敌方纵排造成大量伤害，并有补刀能力（三、六号位站位可互换）",},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [2] = 2,
    [3] = 3,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in team_recommend")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function team_recommend.length()
    return #team_recommend._data
end

-- 
function team_recommend.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function team_recommend.indexOf(index)
    if index == nil or not team_recommend._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/team_recommend.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "team_recommend" )
        return setmetatable({_raw = team_recommend._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = team_recommend._data[index]}, mt)
end

--
function team_recommend.get(id)
    
    return team_recommend.indexOf(__index_id[id])
        
end

--
function team_recommend.set(id, key, value)
    local record = team_recommend.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function team_recommend.index()
    return __index_id
end

return team_recommend