--title

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --序号-int 
  limit_level = 2,    --限制等级-int 
  day = 3,    --开服天数-int 
  time_type = 4,    --时间类型-int 
  time_value = 5,    --时间类型值-int 
  name = 6,    --名称-string 
  colour = 7,    --称号品质-string 
  color = 8,    --称号品质1-string 
  resource = 9,    --资源-string 
  des = 10,    --条件描述-string 
  moving = 11,    --特效-string 
  offset_x = 12,    --左右偏移-int 
  offset_y = 13,    --上下偏移-int 
  description = 14,    --详情描述-string 

}

-- key type
local __key_type = {
  id = "int",    --序号-1 
  limit_level = "int",    --限制等级-2 
  day = "int",    --开服天数-3 
  time_type = "int",    --时间类型-4 
  time_value = "int",    --时间类型值-5 
  name = "string",    --名称-6 
  colour = "string",    --称号品质-7 
  color = "string",    --称号品质1-8 
  resource = "string",    --资源-9 
  des = "string",    --条件描述-10 
  moving = "string",    --特效-11 
  offset_x = "int",    --左右偏移-12 
  offset_y = "int",    --上下偏移-13 
  description = "string",    --详情描述-14 

}


-- data
local title = {
    _data = {
        [1] = {1,1,0,2,0,"为游戏打Call","3","3","img_title_01","累计登录达到99天","",-10,8,"累计登录达到99天",},
        [2] = {2,30,0,2,0,"最后亿次","3","3","img_title_02","在华容道累计猜对99次获胜玩家","",-10,8,"在华容道累计猜对99次获胜玩家",},
        [3] = {3,30,0,1,7,"开不开心","4","4","img_title_03","在黄金宝箱中获得任意1件红色装备","",-10,8,"在黄金宝箱中获得任意1件红色装备",},
        [4] = {4,1,0,1,7,"惊不惊喜","4","4","img_title_04","在卧龙观星活动中直接获得任意1只橙色神兽","",-10,8,"在卧龙观星活动中直接获得任意1只橙色神兽",},
        [5] = {5,1,0,1,7,"意不意外","4","4","img_title_05","在割须弃袍活动中直接获得任意1件红装","",-10,8,"在割须弃袍活动中直接获得任意1件红装",},
        [6] = {6,1,0,1,7,"刺不刺激","4","4","img_title_06","在身外化身活动中直接获得1枚三清化形羽","",-10,8,"在身外化身活动中直接获得1枚三清化形羽",},
        [7] = {7,14,0,1,1,"还有谁？","4","4","img_title_07","在每日竞技场结算时排名竞技场第1","",-10,8,"在每日竞技场结算时排名竞技场第1",},
        [8] = {8,1,0,2,0,"我全都要","4","4","img_title_08","拥有所有武将（不包括橙升红武将）","",-10,8,"拥有所有武将（不包括橙升红武将）",},
        [9] = {9,14,0,1,1,"十大战力","4","4","img_title_09","每日战力排行榜前10","",-10,8,"每日战力排行榜前10",},
        [10] = {10,30,0,2,0,"来呀，快活呀","4","4","img_title_10","在矿战被击杀999次","",-10,8,"在矿战被击杀999次",},
        [11] = {11,50,0,1,7,"魏国霸主","4","4","img_title_11","阵营竞技魏国冠军","",-10,8,"阵营竞技魏国冠军",},
        [12] = {12,50,0,1,7,"蜀国霸主","4","4","img_title_12","阵营竞技蜀国冠军","",-10,8,"阵营竞技蜀国冠军",},
        [13] = {13,50,0,1,7,"吴国霸主","4","4","img_title_13","阵营竞技吴国冠军","",-10,8,"阵营竞技吴国冠军",},
        [14] = {14,50,0,1,7,"群雄霸主","4","4","img_title_14","阵营竞技群雄冠军","",-10,8,"阵营竞技群雄冠军",},
        [15] = {15,1,0,1,7,"狗托","4","4","img_title_15","在身外化身活动中直接获得1枚惊鸿化形羽","",-10,8,"在身外化身活动中直接获得1枚惊鸿化形羽",},
        [16] = {16,1,0,2,0,"先定一个小目标","5","5","img_title_16","拥有全部橙色变身卡","",-10,8,"拥有全部橙色变身卡",},
        [17] = {17,50,0,1,7,"C位出道","5","5","img_title_17","每周4跨服个人竞技4强","",-10,8,"每周4跨服个人竞技4强",},
        [18] = {18,30,0,2,0,"同九年汝何秀","5","5","img_title_18","累计在矿战中击杀999个玩家","",-10,8,"累计在矿战中击杀999个玩家",},
        [19] = {19,60,0,1,30,"一人之下","5","5","img_title_19","王者之战赛季结算时在排行榜排名第2-10","",-10,8,"王者之战赛季结算时在排行榜排名第2-10",},
        [20] = {20,30,0,1,7,"天下无双","6","6","img_title_20","每周4跨服个人竞技冠军","effect_touxian_tianxiawushuang",-10,8,"每周4跨服个人竞技冠军",},
        [21] = {21,60,0,1,30,"不是我针对谁","6","6","img_title_21","王者之战赛季结算时在排行榜排名第1","effect_touxian_zhenduishui",-10,8,"王者之战赛季结算时在排行榜排名第1",},
        [22] = {22,1,0,2,0,"家里有矿","6","6","img_title_22","拥有所有红色变身卡","effect_touxian_jialiyoukuang",-10,8,"拥有所有红色变身卡",},
        [23] = {23,1,0,2,0,"新手指导员","2","2","img_title03","游戏官方新手指导员","",-10,8,"游戏官方新手指导员",},
        [24] = {24,1,0,1,14,"志在四方","4","4","img_title_23","桌游志100期纪念专属限定称号","",-10,8,"桌游志100期纪念专属限定称号",},
        [25] = {25,1,0,1,30,"大风起兮云飞扬","5","5","img_title_25","周年庆活动专属限定称号，有效期30天","",-10,8,"周年庆活动专属限定称号，有效期30天",},
        [26] = {26,1,0,1,30,"气吞山河","5","5","img_title_26","周年庆活动专属限定称号，有效期30天","",-10,8,"周年庆活动专属限定称号，有效期30天",},
        [27] = {27,1,0,1,30,"扶摇直上九万里","6","6","img_title_27","周年庆活动专属限定称号，有效期30天","effect_touxian_fuyao",-10,8,"周年庆活动专属限定称号，有效期30天",},
        [28] = {28,1,0,2,0,"风云际会","5","5","img_title_28","见龙在田活动专属称号","",-10,8,"见龙在田活动专属称号",},
        [29] = {29,1,0,2,0,"龙寻隐踪","5","5","img_title_29","见龙在田活动专属称号","",-10,8,"见龙在田活动专属称号",},
        [30] = {30,1,0,2,0,"众里寻他千百度","6","6","img_title_30","见龙在田活动专属称号","effect_touxian_zhongli",-10,8,"见龙在田活动专属称号",},
        [31] = {1001,1,0,2,0,"新年2020","5","5","img_title_1001","2020新年活动期间，登录1天","",-10,8,"2020新年活动期间，登录1天",},
        [32] = {1002,1,0,2,0,"如意","5","5","img_title_1002","2020新年活动期间，达到20级以上","",-10,8,"2020新年活动期间，达到20级以上",},
        [33] = {1003,1,0,2,0,"新春快乐","5","5","img_title_1003","2020新年活动期间，达到40级以上","",-10,8,"2020新年活动期间，达到40级以上",},
        [34] = {1004,1,0,2,0,"新年发财","5","5","img_title_1004","2020新年活动期间，随机充值任意金额","",-10,8,"2020新年活动期间，随机充值任意金额",},
        [35] = {1005,1,0,2,0,"大富大贵","5","5","img_title_1005","2020新年活动期间，活动期间，累充500w","",-10,8,"2020新年活动期间，活动期间，累充500w",},
        [36] = {8023,1,0,1,30,"社团之星","4","4","img_title8023","运营活动获得","",-10,8,"运营活动获得",},
        [37] = {8024,1,0,1,60,"魏国之光","4","4","img_title8024","运营活动获得","",-10,8,"运营活动获得",},
        [38] = {8025,1,0,1,60,"蜀国之光","4","4","img_title8025","运营活动获得","",-10,8,"运营活动获得",},
        [39] = {8026,1,0,1,60,"吴国之光","4","4","img_title8026","运营活动获得","",-10,8,"运营活动获得",},
        [40] = {8027,1,0,1,60,"群雄之光","4","4","img_title8027","运营活动获得","",-10,8,"运营活动获得",},
        [41] = {8028,1,0,1,15,"金色传说","5","5","img_title8028","运营活动获得","",-10,8,"运营活动获得",},
        [42] = {8029,1,0,2,0,"天才小画师","4","4","img_title8029","运营活动获得","",-10,8,"运营活动获得",},
        [43] = {9013,1,0,2,0,"译者","4","4","img_title9013","协助游戏开发者进行游戏翻译校对","",-10,8,"协助游戏开发者进行游戏翻译校对",},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [1001] = 31,
    [1002] = 32,
    [1003] = 33,
    [1004] = 34,
    [1005] = 35,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [8023] = 36,
    [8024] = 37,
    [8025] = 38,
    [8026] = 39,
    [8027] = 40,
    [8028] = 41,
    [8029] = 42,
    [9] = 9,
    [9013] = 43,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in title")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function title.length()
    return #title._data
end

-- 
function title.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function title.indexOf(index)
    if index == nil or not title._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/title.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "title" )
        return setmetatable({_raw = title._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = title._data[index]}, mt)
end

--
function title.get(id)
    
    return title.indexOf(__index_id[id])
        
end

--
function title.set(id, key, value)
    local record = title.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function title.index()
    return __index_id
end

return title