--treasure

local _lang = "cn"
local _isExist = false

-- key
local __key_map = {
  id = 1,    --编号-int 
  name = 2,    --宝物名称-string 
  treasure_type = 3,    --宝物类型-int 
  limit_able = 4,    --是否可界限突破-int 
  color = 5,    --品质色-int 
  potential = 6,    --潜力值-int 
  limit_up_id = 7,    --界限突破新宝物-int 
  res_id = 8,    --宝物图标-int 
  description = 9,    --宝物描述-string 
  treasure_order = 10,    --宝物显示顺序-string 
  is_always = 11,    --是否长期显示-int 
  treasure_exp = 12,    --吞噬经验值-int 
  initial_level = 13,    --强化初始等级-int 
  levelup_templet = 14,    --强化模板-int 
  levelup_type_1 = 15,    --强化初始属性1-int 
  levelup_type_2 = 16,    --强化初始属性2-int 
  initial_refine = 17,    --精炼初始等级-int 
  refine_templet = 18,    --精炼模板-int 
  refine_type_1 = 19,    --精炼初始属性1-int 
  refine_type_2 = 20,    --精炼初始属性2-int 
  refine_type_3 = 21,    --精炼初始属性3-int 
  fragment = 22,    --碎片的id-int 
  show_day = 23,    --图鉴显示天数-int 
  is_work = 24,    --生效-int 

}

-- key type
local __key_type = {
  id = "int",    --编号-1 
  name = "string",    --宝物名称-2 
  treasure_type = "int",    --宝物类型-3 
  limit_able = "int",    --是否可界限突破-4 
  color = "int",    --品质色-5 
  potential = "int",    --潜力值-6 
  limit_up_id = "int",    --界限突破新宝物-7 
  res_id = "int",    --宝物图标-8 
  description = "string",    --宝物描述-9 
  treasure_order = "string",    --宝物显示顺序-10 
  is_always = "int",    --是否长期显示-11 
  treasure_exp = "int",    --吞噬经验值-12 
  initial_level = "int",    --强化初始等级-13 
  levelup_templet = "int",    --强化模板-14 
  levelup_type_1 = "int",    --强化初始属性1-15 
  levelup_type_2 = "int",    --强化初始属性2-16 
  initial_refine = "int",    --精炼初始等级-17 
  refine_templet = "int",    --精炼模板-18 
  refine_type_1 = "int",    --精炼初始属性1-19 
  refine_type_2 = "int",    --精炼初始属性2-20 
  refine_type_3 = "int",    --精炼初始属性3-21 
  fragment = "int",    --碎片的id-22 
  show_day = "int",    --图鉴显示天数-23 
  is_work = "int",    --生效-24 

}


-- data
local treasure = {
    _data = {
        [1] = {101,"吴子",1,0,3,8,0,101,"战国名将吴起著。吴起为孔门弟子，通晓兵家法家儒家，和孙子连称“孙吴”。","1",1,500,1,1,1,0,0,1,1,15,0,3101,0,1,},
        [2] = {102,"三略",1,0,3,8,0,102,"原称《黄石公三略》，糅合诸子各家的思想，专论治国用兵战略的兵书。","3",1,500,1,1,1,0,0,1,1,17,0,3102,0,1,},
        [3] = {201,"鬼谷子",1,0,4,10,0,201,"鬼谷子被誉为千古奇人，通天彻地，人不能及，著有《鬼谷子》兵书十四篇传世。","1",1,2500,1,2,1,0,0,2,1,15,0,3201,0,1,},
        [4] = {202,"遁甲术",1,0,4,10,0,202,"奇门遁甲为道家不外传秘术，夺天地造化之学，相传左慈曾习得此术。","3",1,2500,1,2,1,0,0,2,1,15,0,3202,0,1,},
        [5] = {203,"司马法",1,0,4,10,0,203,"相传为春秋时期姜太公所作，是现存中国最古老的兵书。","6",0,2500,1,2,1,0,0,2,1,17,0,3203,0,1,},
        [6] = {301,"孙子兵法",1,1,5,12,401,301,"最著名的兵书，春秋时期孙武所著，博大精深，被誉为“兵学圣典”。","7",0,10000,1,3,1,0,0,3,1,15,0,3301,0,1,},
        [7] = {302,"武侯新书",1,1,5,12,402,302,"又名《将苑》，诸葛亮用兵如神，此书记录诸葛军事思想，讨论为将之道。","8",0,10000,1,3,1,0,0,3,1,15,0,3302,0,1,},
        [8] = {303,"孟德新书",1,1,5,12,403,303,"曹操半生戎马，在前人的基础上总结并创新，成就了这本孟德新书。","9",0,10000,1,3,1,0,0,3,1,17,0,3303,0,1,},
        [9] = {304,"太平要术",1,1,5,12,404,304,"相传张角入山采药，遇南华老仙，授之《太平要术》，后创立太平道。","11",0,10000,1,3,1,0,0,3,1,17,0,3304,0,1,},
        [10] = {401,"界·孙子兵法",1,1,6,14,0,401,"最著名的兵书，春秋时期孙武所著，博大精深，被誉为“兵学圣典”。","7",0,10000,1,4,1,0,0,4,1,15,17,3301,100,1,},
        [11] = {402,"界·武侯新书",1,1,6,14,0,402,"又名《将苑》，诸葛亮用兵如神，此书记录诸葛军事思想，讨论为将之道。","8",0,10000,1,4,1,0,0,4,1,15,17,3302,100,1,},
        [12] = {403,"界·孟德新书",1,1,6,14,0,403,"曹操半生戎马，在前人的基础上总结并创新，成就了这本孟德新书。","9",0,10000,1,4,1,0,0,5,1,17,15,3303,100,1,},
        [13] = {404,"界·太平要术",1,1,6,14,0,404,"相传张角入山采药，遇南华老仙，授之《太平要术》，后创立太平道。","11",0,10000,1,4,1,0,0,5,1,17,15,3304,100,1,},
        [14] = {111,"奔牛符",2,0,3,8,0,111,"许褚有倒拖牛尾之勇，故曹操特为他打造此兵符。","12",0,500,1,1,7,0,0,1,7,16,0,3111,0,1,},
        [15] = {112,"野马符",2,0,3,8,0,112,"白马将军公孙瓒的兵符，易京一役后此兵符不知去向。","13",0,500,1,1,7,0,0,1,7,18,0,3112,0,1,},
        [16] = {211,"战狼符",2,0,4,10,0,211,"因司马懿有狼顾之相，故特制此符，此符一直陪伴司马懿，数次征伐有功。","14",0,2500,1,2,7,0,0,2,7,16,0,3211,0,1,},
        [17] = {212,"疾豹符",2,0,4,10,0,212,"兵贵神速，名将夏侯渊执掌疾豹符，被称为“疾行的猎豹”。","16",0,2500,1,2,7,0,0,2,7,16,0,3212,0,1,},
        [18] = {213,"腾蛇符",2,0,4,10,0,213,"法正善奇谋，执掌腾蛇印，助刘备进取汉中，深受刘备信任与倚重。","17",0,2500,1,2,7,0,0,2,7,18,0,3213,0,1,},
        [19] = {311,"青龙符",2,1,5,12,411,311,"《淮南子》卷三记载：天神之贵者，莫贵于青龙。青龙印为名将关羽的兵符。","18",0,10000,1,3,7,0,0,3,7,16,0,3311,0,1,},
        [20] = {312,"白虎符",2,1,5,12,412,312,"白虎代表西方七宿，是正义、勇猛、威严的象征，据说西凉马超曾带此兵符。","19",0,10000,1,3,7,0,0,3,7,16,0,3312,0,1,},
        [21] = {313,"朱雀符",2,1,5,12,413,313,"朱雀乃天之四灵之一，代表炎帝与南方七宿。周瑜曾拥有兵符，后不知去向。","5",1,10000,1,3,7,0,0,3,7,18,0,3313,0,1,},
        [22] = {314,"玄武符",2,1,5,12,414,314,"玄武乃龟蛇合体，长生不老，称“真武大帝”。相传为红将左慈调遣神兵的兵符。","10",0,10000,1,3,7,0,0,3,7,18,0,3314,0,1,},
        [23] = {411,"界·青龙符",2,1,6,14,0,411,"《淮南子》卷三记载：天神之贵者，莫贵于青龙。青龙印为名将关羽的兵符。","18",0,10000,1,4,7,0,0,4,7,16,18,3311,100,1,},
        [24] = {412,"界·白虎符",2,1,6,14,0,412,"白虎代表西方七宿，是正义、勇猛、威严的象征，据说西凉马超曾带此兵符。","19",0,10000,1,4,7,0,0,4,7,16,18,3312,100,1,},
        [25] = {413,"界·朱雀符",2,1,6,14,0,413,"朱雀乃天之四灵之一，代表炎帝与南方七宿。周瑜曾拥有兵符，后不知去向。","5",1,10000,1,4,7,0,0,5,7,18,16,3313,100,1,},
        [26] = {414,"界·玄武符",2,1,6,14,0,414,"玄武乃龟蛇合体，长生不老，称“真武大帝”。相传为红将左慈调遣神兵的兵符。","10",0,10000,1,4,7,0,0,5,7,18,16,3314,100,1,},
    }
}

-- index
local __index_id = {
    [101] = 1,
    [102] = 2,
    [111] = 14,
    [112] = 15,
    [201] = 3,
    [202] = 4,
    [203] = 5,
    [211] = 16,
    [212] = 17,
    [213] = 18,
    [301] = 6,
    [302] = 7,
    [303] = 8,
    [304] = 9,
    [311] = 19,
    [312] = 20,
    [313] = 21,
    [314] = 22,
    [401] = 10,
    [402] = 11,
    [403] = 12,
    [404] = 13,
    [411] = 23,
    [412] = 24,
    [413] = 25,
    [414] = 26,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        assert(__key_map[k], "cannot find " .. k .. " in treasure")
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[__key_map[k]]
    end
}

-- 
function treasure.length()
    return #treasure._data
end

-- 
function treasure.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function treasure.indexOf(index)
    if index == nil or not treasure._data[index] then
        return nil
    end
    if Lang.lang ~= "cn" and Lang.lang ~= _lang then 
        _lang = Lang.lang 
        if Lang.isFileExist("app/i18n/".. _lang .."/config/treasure.lua") then _isExist =  true end
    end
    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "treasure" )
        return setmetatable({_raw = treasure._data[index], _lang=table._data[index], _lang_key_map=table.__key_map}, mt)
    end
    return setmetatable({_raw = treasure._data[index]}, mt)
end

--
function treasure.get(id)
    
    return treasure.indexOf(__index_id[id])
        
end

--
function treasure.set(id, key, value)
    local record = treasure.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function treasure.index()
    return __index_id
end

return treasure