--auction

local auction = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --子叶签-简中-string 
    
    },
    -- data
    _data = {
        [1] = {101,"军团BOSS",},
        [2] = {102,"军团答题",},
        [3] = {103,"军团试炼",},
        [4] = {104,"三国战记",},
        [5] = {105,"军团战",},
        [6] = {201,"全服",},
        [7] = {301,"阵营竞技",},
        [8] = {401,"城池行商",},
        [9] = {501,"神秘行商",},
        [10] = {601,"跨服个人",},
        [11] = {701,"跨服军团战",},
    }
}

return auction