--bubble

local bubble = {
    -- key
    __key_map = {
      id = 1,    --对话id-int 
      content = 2,    --对话内容-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1001,"主公, 看我给你寻找更多的体力丹, 精力丹和银两!",},
        [2] = {1002,"主公, 待我寻得大量将魂, 武将经验道具归来!",},
        [3] = {1003,"主公, 有我在, 再也不用担心突破丹不够了!",},
        [4] = {1004,"主公, 看我给你寻觅更多的装备精炼石!",},
        [5] = {1005,"主公, 养宝物不用愁, 待我给你整来更多宝物精炼石!",},
        [6] = {1006,"主公, 多拿些神兵进阶石, 培养神兵, 我就可以吊打别人了!",},
        [7] = {1007,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [8] = {1008,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [9] = {1009,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [10] = {1010,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [11] = {1011,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [12] = {1012,"主公, 在你的守护下, 城池现在欣欣向荣, 请收下天下百姓的心意吧.",},
        [13] = {1013,"主公加油, 我去巡逻了!",},
        [14] = {1101,"想战胜我需要点实力!",},
        [15] = {1102,"想战胜我需要点实力!",},
        [16] = {1103,"想战胜我需要点实力!",},
        [17] = {1104,"想战胜我需要点实力!",},
        [18] = {1105,"想战胜我需要点实力!",},
        [19] = {1106,"想战胜我需要点实力!",},
        [20] = {1201,"大人威武",},
        [21] = {1202,"好爱大人",},
        [22] = {1203,"么么哒大人",},
        [23] = {1204,"好萌啊大人, 人家要给你生猴子!",},
        [24] = {1205,"大胆妖孽!",},
        [25] = {1206,"妈妈啊, 怕怕!",},
        [26] = {1207,"啊啊, 快跑啊!",},
        [27] = {1208,"讨厌, 哼!",},
        [28] = {1301,"叛军来了, 救我!",},
        [29] = {1302,"正在请求增援!",},
        [30] = {1303,"可恶!难道我要命丧于此?",},
        [31] = {1304,"撑不住了, 快来帮我!",},
        [32] = {1305,"大哥, 行行好, 帮个忙!",},
        [33] = {1401,"孤独是多么多么寂寞!",},
        [34] = {1402,"你们这群渣渣, 怎懂我的孤独!",},
        [35] = {1403,"受死吧, 一帮蠢货!",},
        [36] = {1404,"想我一代风流人物, 独领风骚!",},
        [37] = {2000,"一统天下, 舍我其谁!",},
        [38] = {2001,"麾下武将等级不足, 快升级一下吧",},
        [39] = {2002,"麾下武将还可以突破到更高等级!",},
        [40] = {2003,"武将觉醒能带来很多战力哦～",},
        [41] = {2004,"我们的武将还需要等级更高的装备",},
        [42] = {2005,"精炼装备能大幅提升战力!",},
        [43] = {2006,"宝物还没有得到足够的强化",},
        [44] = {2007,"精炼宝物能带来很强大的战力",},
        [45] = {2008,"神兵进阶到25级, 能解锁更强大的技能!",},
    }
}

return bubble