--cake_task

local cake_task = {
    -- key
    __key_map = {
      id = 1,    --id_math-int 
      desc = 2,    --描述-string 
    
    },
    -- data
    _data = {
        [1] = {100,"挑战主线或精英副本25次",},
        [2] = {101,"挑战主线或精英副本50次",},
        [3] = {102,"挑战主线或精英副本75次",},
        [4] = {103,"挑战主线或精英副本100次",},
        [5] = {200,"游历25次",},
        [6] = {201,"游历50次",},
        [7] = {202,"游历75次",},
        [8] = {203,"游历100次",},
        [9] = {300,"每日任务活跃度达到30",},
        [10] = {301,"每日任务活跃度达到60",},
        [11] = {302,"每日任务活跃度达到90",},
        [12] = {303,"每日任务活跃度达到120",},
        [13] = {304,"每日任务活跃度达到150",},
        [14] = {400,"参加12点军团BOSS活动1次",},
        [15] = {500,"参加19点军团BOSS活动1次",},
        [16] = {600,"参加答题活动1次",},
        [17] = {700,"参加军团试炼1次",},
    }
}

return cake_task