--equipment

local equipment = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-简中-string 
      description = 3,    --装备描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {101,"古锭刀","采用上等精铁, 运用古法锻造, 重三十八斤, 常为军内精锐配备.",1,},
        [2] = {102,"黑铁甲","采用上等玄铁, 锻造七七四十九天而成, 非普攻兵器可破之甲.",1,},
        [3] = {103,"逍遥巾","采用上等布匹, 用清心明目药物浸泡制成, 护体明心, 使人时刻保持清醒.",1,},
        [4] = {104,"云纹靴","采用上等兽皮, 又以秘法鞣制而成, 甚为透气吸汗, 可长时间穿戴.",1,},
        [5] = {201,"寒冰剑","寒铁铸之, 剑身冰寒, 兵未到而寒先至, 御敌于寒光之中.",1,},
        [6] = {202,"环锁铠","精钢铸之, 一百零八片精钢片是为一铠, 防御出众且轻便.",1,},
        [7] = {203,"亮银盔","精钢铸之, 以秘银涂之表面, 可有效保护头部, 抵御攻击.",1,},
        [8] = {204,"貂皮靴","貂皮缝之, 一貂为一靴, 冬暖夏凉, 行军上品.",1,},
        [9] = {301,"惊雷长枪","百炼精钢, 天雷淬炼, 挥舞时有电光闪烁, 惊雷咆哮.",1,},
        [10] = {302,"幻日战甲","百炼精钢, 描以幻日, 能够使敌人产生错觉, 攻击落空.",1,},
        [11] = {303,"落月发冠","月缺而编, 月圆而成, 日息月作, 故有月光之力.",1,},
        [12] = {304,"幻影皮靴","飞蝠所制, 灵活轻便,  穿之可日行百里而不歇.",1,},
        [13] = {305,"断魂战斧","传闻此斧斩敌上千, 斧下亡魂凝而不散, 御敌之时斧未至, 魂先断, 故为断魂.",1,},
        [14] = {306,"霹雳银铠","采极品秘银, 引九天之雷, 常有霹雳闪现其上.",1,},
        [15] = {307,"烈焰战盔","采火山岩铁, 引地火炼造, 常有烈焰闪耀其上.",1,},
        [16] = {308,"疾风战靴","采大鹏之羽, 蕴疾风之力, 行之如有疾风助力.",1,},
        [17] = {401,"真武麒麟弓","蕴含麒麟之力的神弓, 非千斤之力不可开.",1,},
        [18] = {402,"乾坤蛟鳞甲","采蛟龙之革, 蕴含乾坤八卦之力.",1,},
        [19] = {403,"无双凤翎盔","头盔插有凤翎, 蕴含凤凰之能.",1,},
        [20] = {404,"混元金刚靴","金刚所铸, 坚韧无比, 蕴含混沌之力.",1,},
        [21] = {405,"清霜寒冰剑","采九天寒冰, 低温锻造数年而成, 相传为大都督周瑜挚爱之剑.",1,},
        [22] = {406,"玲珑赤羽甲","传说左慈为天命之人秘制的铠甲, 采用翡翠精炼而成, 红色羽毛编织的结绳更蕴含左慈的防御仙术.",1,},
        [23] = {407,"九霄墨玉冠","世家大族所用之物, 通体以墨玉点缀, 上等丝线缝制而成, 高雅美观.",1,},
        [24] = {408,"织羽金丝靴","采用精美锦缎与碧玉制成, 华美贵气, 对敌之时更具备不错的防护力.",1,},
        [25] = {409,"破军·七杀枪","破军套装部件之一, 曾有猛将手持此枪, 于数万敌军七进七出而不败.",1,},
        [26] = {410,"破军·贪狼甲","破军套装部件之一, 两肩为贪狼之形, 全甲有贪狼之威.",1,},
        [27] = {411,"破军·银狮盔","破军套装部件之一, 以珍贵的西凉秘银锻造而成, 外形如狮子, 威武无比.",1,},
        [28] = {412,"破军·踏天靴","破军套装部件之一, 外附陨铁之片, 内以珍兽之革, 举手投足之间, 拥有踏天之势.",1,},
        [29] = {501,"四神·青龙枪","四神套装部件之一, 融合了少许神兽青龙的气息, 挥舞时常有龙啸之音, 可震敌于无形.",1,},
        [30] = {502,"四神·玄武甲","四神套装部件之一, 融合了少许神兽玄武的气息, 拥有完美的防身效果.",1,},
        [31] = {503,"四神·白虎盔","四神套装部件之一, 融合了少许神兽白虎的气息, 可使人战力非凡, 更上层楼.",1,},
        [32] = {504,"四神·朱雀靴","四神套装部件之一, 融合了少许神兽朱雀的气息, 朱雀之力可使人体魄远超常人.",1,},
        [33] = {601,"八荒·饕餮戟","八荒套装部件之一, 蕴含着上古凶兽饕餮的灵力, 战斗时如有神助, 威力不凡.",1,},
        [34] = {602,"八荒·穷奇铠","八荒套装部件之一, 蕴含着上古凶兽穷奇的灵力, 防御坚固, 坚不可摧.",1,},
        [35] = {603,"八荒·梼杌冠","八荒套装部件之一, 蕴含着上古凶兽梼杌的灵力, 坚定意志, 稳固心神.",1,},
        [36] = {604,"八荒·混沌靴","八荒套装部件之一, 蕴含着上古凶兽混沌的灵力, 能带给人无穷的生机.",1,},
    }
}

return equipment