--gemstone

local gemstone = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --名称-string 
      bag_description = 3,    --背包描述-string 
      description = 4,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"绿晶攻击宝石","晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.","绿莹莹晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.",},
        [2] = {102,"绿晶防御宝石","晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.","绿莹莹晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.",},
        [3] = {103,"绿晶生命宝石","晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.","绿莹莹晶莹璀璨的宝石, 通体绿莹莹, 摸起来凉凉的.",},
        [4] = {104,"绿晶觉醒卷轴","孕育绿色宝石的原始卷轴, 有不可思议的能量.","孕育绿色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [5] = {201,"蓝晶攻击宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [6] = {202,"蓝晶防御宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [7] = {203,"蓝晶生命宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [8] = {204,"蓝晶觉醒卷轴","孕育蓝色宝石的原始卷轴, 有不可思议的能量.","孕育蓝色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [9] = {301,"海蓝攻击宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [10] = {302,"海蓝防御宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [11] = {303,"海蓝生命宝石","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.","晶莹璀璨的宝石, 通体天蓝色, 摸起来凉凉的.",},
        [12] = {304,"海蓝觉醒卷轴","孕育蓝色宝石的原始卷轴, 有不可思议的能量.","孕育蓝色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [13] = {401,"紫晶攻击宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [14] = {402,"紫晶防御宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [15] = {403,"紫晶生命宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [16] = {404,"紫晶觉醒卷轴","孕育紫色宝石的原始卷轴, 有不可思议的能量.","孕育紫色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [17] = {501,"紫耀攻击宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [18] = {502,"紫耀防御宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [19] = {503,"紫耀生命宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [20] = {504,"紫耀觉醒卷轴","孕育紫色宝石的原始卷轴, 有不可思议的能量.","孕育紫色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [21] = {601,"星空攻击宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [22] = {602,"星空防御宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [23] = {603,"星空生命宝石","高级的紫宝石, 摸起来凉凉的.","高级的紫宝石, 摸起来凉凉的.",},
        [24] = {604,"星空觉醒卷轴","孕育紫色宝石的原始卷轴, 有不可思议的能量.","孕育紫色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [25] = {701,"黄晶攻击宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [26] = {702,"黄晶防御宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [27] = {703,"黄晶生命宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [28] = {704,"黄晶觉醒卷轴","孕育橙色宝石的原始卷轴, 有不可思议的能量.","孕育橙色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [29] = {801,"龙晶攻击宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [30] = {802,"龙晶防御宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [31] = {803,"龙晶生命宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [32] = {804,"龙晶觉醒卷轴","孕育橙色宝石的原始卷轴, 有不可思议的能量.","孕育橙色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [33] = {901,"太阳攻击宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [34] = {902,"太阳防御宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [35] = {903,"太阳生命宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [36] = {904,"太阳觉醒卷轴","孕育橙色宝石的原始卷轴, 有不可思议的能量.","孕育橙色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [37] = {1001,"璀璨攻击宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [38] = {1002,"璀璨防御宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [39] = {1003,"璀璨生命宝石","顶级宝石, 通体发橙光, 摸起来凉凉的.","顶级宝石, 通体发橙光, 摸起来凉凉的.",},
        [40] = {1004,"璀璨觉醒卷轴","孕育橙色宝石的原始卷轴, 有不可思议的能量.","孕育橙色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [41] = {1101,"红晶攻击宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [42] = {1102,"红晶防御宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [43] = {1103,"红晶生命宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [44] = {1104,"红晶觉醒卷轴","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [45] = {1201,"赤焰攻击宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [46] = {1202,"赤焰防御宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [47] = {1203,"赤焰生命宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [48] = {1204,"赤焰觉醒卷轴","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [49] = {1301,"血月攻击宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [50] = {1302,"血月防御宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [51] = {1303,"血月生命宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [52] = {1304,"血月觉醒卷轴","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
        [53] = {1401,"辉煌攻击宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [54] = {1402,"辉煌防御宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [55] = {1403,"辉煌生命宝石","顶级宝石, 通体发红光, 摸起来凉凉的.","顶级宝石, 通体发红光, 摸起来凉凉的.",},
        [56] = {1404,"辉煌觉醒卷轴","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.","孕育红色宝石的原始卷轴, 听说威力巨大, 有不可思议的能量.",},
    }
}

return gemstone