--guild_build_postion

local guild_build_postion = {
    -- key
    __key_map = {
      id = 1,    --建筑id-int 
      name = 2,    --建筑名称-简中-string 
      name_postion_x = 3,    --标题X坐标-int 
      name_postion_y = 4,    --标题Y坐标-int 
    
    },
    -- data
    _data = {
        [1] = {1,"军团大殿",1280,720,},
        [2] = {2,"军团援助",670,506,},
        [3] = {3,"军团商店",970,680,},
        [4] = {4,"亭子",1038,807,},
        [5] = {5,"军团BOSS",1000,510,},
        [6] = {6,"军团捐献",1300,484,},
        [7] = {7,"军需所",1144,361,},
        [8] = {8,"军团试炼",508,652,},
        [9] = {9,"东城门",1436,431,},
        [10] = {10,"军团战",1750,435,},
    }
}

return guild_build_postion