--guild_stage_talk

local guild_stage_talk = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      talk1 = 2,    --说话1-简中-string 
      talk2 = 3,    --说话2-简中-string 
      talk3 = 4,    --说话3-简中-string 
      talk4 = 5,    --说话4-简中-string 
      talk5 = 6,    --说话5-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"不是……不要误会, 我不是针对你","我是说在做各位……都是垃圾","我一拳下去, 你可能会死哦!","弱者为何要战斗?!","我一根手指都能灭了你!",},
        [2] = {2,"顺流而下, 袭敌不备!","你是令人敬佩的对手!","旗鼓相当的对手, 本将军喜欢!","今日便是你们军团的末日!","不要走!今日我要与你大战300回合!",},
        [3] = {3,"我从未见过有如此厚颜无耻之人!","将军饶命, 小的上有老下有小!","不找个旗鼓相当的对手吗?","打我对你没啥好处!","我建议你找我上面的家伙!",},
    }
}

return guild_stage_talk