--guild_cross_war

local guild_cross_war = {
    -- key
    __key_map = {
      id = 1,    --索引id-int 
      point_name = 2,    --据点名字-string 
      name = 3,    --BOSS名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"军营驻地","黄巾贼亡魂",},
        [2] = {2,"军营驻地","黄巾贼亡魂",},
        [3] = {3,"军营驻地","黄巾贼亡魂",},
        [4] = {4,"军营驻地","黄巾贼亡魂",},
        [5] = {5,"军营驻地","黄巾贼亡魂",},
        [6] = {6,"军营驻地","黄巾贼亡魂",},
        [7] = {7,"军营驻地","黄巾贼亡魂",},
        [8] = {8,"军营驻地","黄巾贼亡魂",},
        [9] = {9,"军营驻地","黄巾贼亡魂",},
        [10] = {10,"军营驻地","黄巾贼亡魂",},
        [11] = {11,"军营驻地","黄巾贼亡魂",},
        [12] = {12,"军营驻地","黄巾贼亡魂",},
        [13] = {13,"军营驻地","黄巾贼亡魂",},
        [14] = {14,"军营驻地","黄巾贼亡魂",},
        [15] = {15,"军营驻地","黄巾贼亡魂",},
        [16] = {16,"军营驻地","黄巾贼亡魂",},
        [17] = {17,"青州","",},
        [18] = {18,"徐州","",},
        [19] = {19,"扬州","",},
        [20] = {20,"荆州","",},
        [21] = {21,"益州","",},
        [22] = {22,"凉州","",},
        [23] = {23,"并州","",},
        [24] = {24,"幽州","",},
        [25] = {25,"中州","",},
    }
}

return guild_cross_war