--head_frame

local head_frame = {
    -- key
    __key_map = {
      id = 1,    --序号-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {1,"快解锁头像框吧","",1,},
        [2] = {2,"情有独钟头像框","累计签到达到365天获取",1,},
        [3] = {3,"超群绝伦头像框","累计参加99次军团boss获取",1,},
        [4] = {4,"才华横溢头像框","累计参加50次军团答题获取",1,},
        [5] = {5,"出类拔萃头像框","累计参加50次军团试炼获取",1,},
        [6] = {6,"勇冠三军头像框","累计参加20次三国战记获取",1,},
        [7] = {7,"所向披靡头像框","累计参加20次军团战获取",1,},
        [8] = {8,"大家风范头像框","贵族3专属",1,},
        [9] = {9,"名门望族头像框","贵族7专属",1,},
        [10] = {10,"侯服玉食头像框","贵族12专属",1,},
        [11] = {11,"佩金带紫头像框","贵族13专属",1,},
        [12] = {12,"玉叶金柯头像框","贵族14专属",1,},
        [13] = {13,"不赀之躯头像框","贵族15专属",1,},
        [14] = {14,"龙血凤髓头像框","贵族16专属",1,},
        [15] = {15,"1周年头像框","1周年活动限时获取",0,},
        [16] = {16,"建功立业头像框","蛋糕活动限时获取",1,},
        [17] = {17,"丰功伟绩头像框","蛋糕活动限时获取",1,},
        [18] = {18,"流芳百世头像框","蛋糕活动限时获取",1,},
        [19] = {19,"结交头像框","见龙在田活动限时获取",0,},
        [20] = {20,"寻隐头像框","见龙在田活动限时获取",0,},
        [21] = {21,"见龙在田头像框","见龙在田活动限时获取",0,},
    }
}

return head_frame