--hero_limit_size

local hero_limit_size = {
    -- key
    __key_map = {
      id = 1,    --武将id-int 
      name = 2,    --武将名称-简中-string 
    
    },
    -- data
    _data = {
        [1] = {111,"曹丕",},
        [2] = {111,"曹丕",},
        [3] = {111,"曹丕",},
        [4] = {111,"曹丕",},
        [5] = {205,"关羽",},
        [6] = {205,"关羽",},
        [7] = {205,"关羽",},
        [8] = {205,"关羽",},
        [9] = {308,"甘宁",},
        [10] = {308,"甘宁",},
        [11] = {308,"甘宁",},
        [12] = {308,"甘宁",},
        [13] = {411,"袁绍",},
        [14] = {411,"袁绍",},
        [15] = {411,"袁绍",},
        [16] = {411,"袁绍",},
    }
}

return hero_limit_size