--horse_star

local horse_star = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-string 
      skill = 3,    --技能描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"青骓","[青骓]骑乘武将攻击加成+1%",},
        [2] = {1,"追风·青骓","[追风·青骓]骑乘武将攻击加成+2%",},
        [3] = {1,"逐日·青骓","[逐日·青骓]骑乘武将攻击加成+3%",},
        [4] = {2,"绿耳","[绿耳]骑乘武将防御加成+1%",},
        [5] = {2,"追风·绿耳","[追风·绿耳]骑乘武将防御加成+2%",},
        [6] = {2,"逐日·绿耳","[逐日·绿耳]骑乘武将防御加成+3%",},
        [7] = {3,"渠黄","[渠黄]骑乘武将生命加成+1%",},
        [8] = {3,"追风·渠黄","[追风·渠黄]骑乘武将生命加成+2%",},
        [9] = {3,"逐日·渠黄","[逐日·渠黄]骑乘武将生命加成+3%",},
        [10] = {4,"枣骝","[枣骝]骑乘武将暴击伤害加成+1%",},
        [11] = {4,"追风·枣骝","[追风·枣骝]骑乘武将暴击伤害加成+2%",},
        [12] = {4,"逐日·枣骝","[逐日·枣骝]骑乘武将暴击伤害加成+3%",},
        [13] = {5,"雪里白","[雪里白]骑乘武将伤害加成+3%",},
        [14] = {5,"追风·雪里白","[追风·雪里白]骑乘武将伤害加成+6%",},
        [15] = {5,"逐日·雪里白","[逐日·雪里白]骑乘武将伤害加成+9%",},
        [16] = {6,"飒露紫","[飒露紫]骑乘武将受到的伤害减免+3%",},
        [17] = {6,"追风·飒露紫","[追风·飒露紫]骑乘武将受到的伤害减免+6%",},
        [18] = {6,"逐日·飒露紫","[逐日·飒露紫]骑乘武将受到的伤害减免+9%",},
        [19] = {7,"红玉辇","[红玉辇]骑乘武将生命加成+3%",},
        [20] = {7,"追风·红玉辇","[追风·红玉辇]骑乘武将生命加成+6%",},
        [21] = {7,"逐日·红玉辇","[逐日·红玉辇]骑乘武将生命加成+9%",},
        [22] = {8,"碧骢驹","[碧骢驹]骑乘武将暴击概率加成+3%",},
        [23] = {8,"追风·碧骢驹","[追风·碧骢驹]骑乘武将暴击概率加成+6%",},
        [24] = {8,"逐日·碧骢驹","[逐日·碧骢驹]骑乘武将暴击概率加成+9%",},
        [25] = {9,"飞霜千里","[飞霜千里]攻击对敌方造成伤害的20%转化为治疗, 治疗己方血量最少的目标.",},
        [26] = {9,"追风·飞霜千里","[追风·飞霜千里]攻击对敌方造成伤害的30%转化为治疗, 治疗己方血量最少的目标, 并为该目标额外回复10%生命上限的血量.",},
        [27] = {9,"逐日·飞霜千里","[逐日·飞霜千里]攻击对敌方造成伤害的30%转化为治疗, 治疗己方血量最少的目标, 并为该目标额外回复30%生命上限的血量.",},
        [28] = {10,"乌云踏雪","[乌云踏雪]攻击对敌方造成伤害额外增加16%.",},
        [29] = {10,"追风·乌云踏雪","[追风·乌云踏雪]攻击对敌方造成伤害额外增加25%, 击杀目标后50%概率回复自身1点怒气.",},
        [30] = {10,"逐日·乌云踏雪","[逐日·乌云踏雪]攻击对敌方造成伤害额外增加25%, 击杀目标后回复自身1点怒气, 并且下次回怒时额外回复自身1点怒气",},
        [31] = {11,"胭脂火龙","[胭脂火龙]治疗效果提高10%, 治疗被封疗的目标, 可为其附加持续一回合的吸收伤害护盾, 吸收40%治疗量的伤害",},
        [32] = {11,"追风·胭脂火龙","[追风·胭脂火龙]治疗效果提高18%, 治疗被封疗的目标, 可为其附加持续一回合的吸收伤害护盾, 吸收70%治疗量的伤害",},
        [33] = {11,"逐日·胭脂火龙","[逐日·胭脂火龙]治疗效果提高25%, 治疗被封疗的目标, 可为其附加持续一回合的吸收伤害护盾, 吸收100%治疗量的伤害",},
        [34] = {12,"夜照玉狮","[夜照玉狮]战斗中每回合最多受到2点怒气降低效果",},
        [35] = {12,"追风·夜照玉狮","[追风·夜照玉狮]战斗前最多受到1点怒气降低效果, 战斗中每回合最多受到2点怒气降低效果",},
        [36] = {12,"逐日·夜照玉狮","[逐日·夜照玉狮]战斗前最多受到1点怒气降低效果, 战斗中每回合最多受到1点怒气降低效果",},
        [37] = {15,"奔雷青骢","[奔雷青骢]生命最大值提高15%.战斗中首次受到致命伤害时, 不会死亡并且会回复20%最大生命值的生命",},
        [38] = {15,"追风·奔雷青骢","[追风·奔雷青骢]生命最大值提高30%.战斗中首次受到致命伤害时, 不会死亡并且回复40%最大生命值的血量, 回复自身2点怒气.",},
        [39] = {15,"逐日·奔雷青骢","[逐日·奔雷青骢]生命最大值提高45%.战斗中首次受到致命伤害时, 不会死亡并且回复60%最大生命值的血量, 回复自身4点怒气",},
        [40] = {13,"爪黄飞电","[爪黄飞电]敬请期待",},
        [41] = {13,"望月·爪黄飞电","[望月·爪黄飞电]敬请期待",},
        [42] = {13,"踏天·爪黄飞电","[踏天·爪黄飞电]敬请期待",},
        [43] = {14,"霹雳的卢","[霹雳的卢]敬请期待",},
        [44] = {14,"望月·霹雳的卢","[望月·霹雳的卢]敬请期待",},
        [45] = {14,"踏天·霹雳的卢","[踏天·霹雳的卢]敬请期待",},
    }
}

return horse_star