--horse_group

local horse_group = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --图鉴名称-string 
      show_day = 3,    --达到开服天数显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"绿影摇青",1,},
        [2] = {2,"采黄掷枣",1,},
        [3] = {3,"露从夜白",1,},
        [4] = {4,"碧染红林",1,},
        [5] = {5,"庭飞白雪",1,},
        [6] = {6,"崖生紫云",1,},
        [7] = {7,"玉脂红胭",1,},
        [8] = {8,"月照碧影",1,},
        [9] = {11,"电光火石",999,},
        [10] = {9,"拂霜吹雪",1,},
        [11] = {10,"红阑夜火",1,},
    }
}

return horse_group