--monster_talk

local monster_talk = {
    -- key
    __key_map = {
      id = 1,    --序号-int 
      bubble = 2,    --战斗中说话内容，不要超过25个字-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"大哥最近得了一件宝贝.",},
        [2] = {2,"看我符咒的厉害!",},
        [3] = {3,"苍天已死, 黄天当立!",},
        [4] = {4,"战斗初始2怒, 普攻加2怒, 4点怒气就可以放技能哦.",},
        [5] = {5,"关银屏姐姐是主攻手, 主公要多多培养她哦.",},
        [6] = {6,"站在前排好危险, 主公能把我放后排去吗?",},
        [7] = {7,"站在前排好危险, 主公能把我放后排去吗?",},
        [8] = {8,"放在后排好像安全多了, 谢谢主公!",},
        [9] = {9,"武将升级突破了吗?穿装备并强化了吗?",},
        [10] = {10,"主公, 不好好培养, 是战胜不了张让的!",},
        [11] = {11,"主公, 不要忘记培养一下我哦!",},
        [12] = {12,"主公, 不要忘记培养一下我哦!",},
        [13] = {13,"主公, 不要忘记培养一下我哦!",},
        [14] = {14,"主公, 不要忘记培养一下我哦!",},
        [15] = {15,"主公, 不要忘记培养一下我哦!",},
        [16] = {16,"主公, 不要忘记培养一下我哦!",},
        [17] = {17,"主公, 不要忘记培养一下我哦!",},
        [18] = {18,"主公, 不要忘记培养一下我哦!",},
        [19] = {19,"打劫!把竞技场得到的元宝交出来!",},
        [20] = {20,"不好好培养武将和装备, 是打不过我的!",},
        [21] = {21,"15级武将突破+2后, 你打我才有丝丝胜算.",},
        [22] = {22,"不好好培养武将和装备, 是打不过我的!",},
        [23] = {23,"扫荡主线副本升到20级才能打赢我!",},
        [24] = {24,"扫荡主线副本升到23级才能打赢我!",},
        [25] = {25,"扫荡主线副本升到26级才能打赢我!",},
        [26] = {26,"扫荡主线副本升到29级才能打赢我!",},
        [27] = {27,"竞技场的元宝真是多啊, 哈哈哈!",},
        [28] = {28,"没有元宝就去竞技场打排名, 元宝非常多!",},
        [29] = {29,"其他人一定不知道16级即可扫荡副本, 超快速提升等级, 哈哈.",},
        [30] = {31,"应该只有我才知道16级可以扫荡满星副本!",},
        [31] = {32,"武将升到25级即可突破+3, 突破+3可在第一回合释放技能和合击!",},
        [32] = {33,"扫荡主线副本可快速提升主角等级",},
        [33] = {34,"扫荡主线副本可快速提升主角等级",},
        [34] = {35,"扫荡主线副本可快速提升主角等级",},
        [35] = {36,"扫荡主线副本可快速提升主角等级",},
        [36] = {37,"听闻武将升到25级即可突破+3, 突破+3可在第一回合释放技能和合击!",},
        [37] = {38,"听闻武将升到25级即可突破+3, 突破+3可在第一回合释放技能和合击!",},
        [38] = {39,"我家主公这么厉害, 全靠扫荡主线提高的等级!",},
        [39] = {40,"听闻武将升到25级即可突破+3, 突破+3可在第一回合释放技能和合击!",},
        [40] = {41,"橙将比紫将厉害很多!",},
        [41] = {42,"你可知道招募是可以获得橙将的!",},
        [42] = {43,"你没有橙将, 是打不过我的!快去招募吧!",},
        [43] = {44,"你没有橙将, 是打不过我的!",},
        [44] = {45,"若是没有招募获得的橙将, 你可打不过我!",},
        [45] = {46,"若你有几个橙将, 我定然打不过你!",},
        [46] = {47,"区区紫将, 也敢来战?",},
        [47] = {48,"你没有更多橙将, 是打不过我的!",},
        [48] = {49,"凭什么我夏侯渊是紫将!",},
    }
}

return monster_talk