--pet_map

local pet_map = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --图鉴名称-string 
      show = 3,    --是否显示-int 
      show_day = 4,    --达到开服天数显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"钟灵毓秀",1,1,},
        [2] = {2,"霁风朗月",1,1,},
        [3] = {3,"水火不容",1,21,},
        [4] = {4,"月舞神殇",1,21,},
        [5] = {5,"漫天烽火",1,21,},
        [6] = {6,"绝天龙牙",1,21,},
        [7] = {7,"楚竹惊鸾",1,21,},
        [8] = {8,"天外行云",1,21,},
        [9] = {9,"惊雷炎火",1,10,},
        [10] = {10,"森罗万象",1,10,},
        [11] = {11,"霞姿月韵",1,50,},
        [12] = {12,"清风霁月",1,50,},
        [13] = {13,"红煌流星",1,50,},
        [14] = {14,"绝云烈日",1,50,},
        [15] = {15,"破炎",0,999,},
        [16] = {16,"破云",0,999,},
        [17] = {17,"逢凶化吉",0,999,},
        [18] = {18,"地火天雷",0,999,},
    }
}

return pet_map