--return_privilege

local return_privilege = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      privilege_txt = 2,    --特权说明-string 
      button_txt = 3,    --按钮文字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"重置日常副本","重置|去战斗",},
        [2] = {2,"重置过关斩将","重置|去战斗",},
        [3] = {3,"攻打主线副本获得双倍奖励","去战斗",},
        [4] = {4,"攻打精英副本获得双倍奖励","去战斗",},
        [5] = {5,"攻打名将副本获得双倍奖励","去战斗",},
        [6] = {6,"游历行动产出双倍宝物经验和银两","去游历",},
        [7] = {7,"军团祭祀和今日军团声望双倍","去军团",},
        [8] = {8,"每日签到获得的奖励双倍","去领取",},
        [9] = {9,"五谷丰登获得的奖励双倍","去领取",},
        [10] = {10,"每日任务奖励双倍","去领取",},
        [11] = {11,"重置日常副本","重置|去战斗",},
        [12] = {12,"重置过关斩将","重置|去战斗",},
        [13] = {13,"攻打主线副本获得双倍奖励","去战斗",},
        [14] = {14,"攻打精英副本获得双倍奖励","去战斗",},
        [15] = {15,"攻打名将副本获得双倍奖励","去战斗",},
        [16] = {16,"游历行动产出双倍宝物经验和银两","去游历",},
        [17] = {17,"军团祭祀和今日军团声望双倍","去军团",},
        [18] = {18,"每日签到获得的奖励双倍","去领取",},
        [19] = {19,"五谷丰登获得的奖励双倍","去领取",},
        [20] = {20,"每日任务奖励双倍","去领取",},
        [21] = {21,"重置日常副本","重置|去战斗",},
        [22] = {22,"重置过关斩将","重置|去战斗",},
        [23] = {23,"攻打主线副本获得双倍奖励","去战斗",},
        [24] = {24,"攻打精英副本获得双倍奖励","去战斗",},
        [25] = {25,"攻打名将副本获得双倍奖励","去战斗",},
        [26] = {26,"游历行动产出双倍宝物经验和银两","去游历",},
        [27] = {27,"军团祭祀和今日军团声望双倍","去军团",},
        [28] = {28,"每日签到获得的奖励双倍","去领取",},
        [29] = {29,"五谷丰登获得的奖励双倍","去领取",},
        [30] = {30,"每日任务奖励双倍","去领取",},
        [31] = {31,"重置日常副本","重置|去战斗",},
        [32] = {32,"重置过关斩将","重置|去战斗",},
        [33] = {33,"攻打主线副本获得双倍奖励","去战斗",},
        [34] = {34,"攻打精英副本获得双倍奖励","去战斗",},
        [35] = {35,"攻打名将副本获得双倍奖励","去战斗",},
        [36] = {36,"游历行动产出双倍宝物经验和银两","去游历",},
        [37] = {37,"军团祭祀和今日军团声望双倍","去军团",},
        [38] = {38,"每日签到获得的奖励双倍","去领取",},
        [39] = {39,"五谷丰登获得的奖励双倍","去领取",},
        [40] = {40,"每日任务奖励双倍","去领取",},
        [41] = {41,"重置日常副本","重置|去战斗",},
        [42] = {42,"重置过关斩将","重置|去战斗",},
        [43] = {43,"攻打主线副本获得双倍奖励","去战斗",},
        [44] = {44,"攻打精英副本获得双倍奖励","去战斗",},
        [45] = {45,"攻打名将副本获得双倍奖励","去战斗",},
        [46] = {46,"游历行动产出双倍宝物经验和银两","去游历",},
        [47] = {47,"军团祭祀和今日军团声望双倍","去军团",},
        [48] = {48,"每日签到获得的奖励双倍","去领取",},
        [49] = {49,"五谷丰登获得的奖励双倍","去领取",},
        [50] = {50,"每日任务奖励双倍","去领取",},
        [51] = {51,"重置日常副本","重置|去战斗",},
        [52] = {52,"重置过关斩将","重置|去战斗",},
        [53] = {53,"攻打主线副本获得双倍奖励","去战斗",},
        [54] = {54,"攻打精英副本获得双倍奖励","去战斗",},
        [55] = {55,"攻打名将副本获得双倍奖励","去战斗",},
        [56] = {56,"游历行动产出双倍宝物经验和银两","去游历",},
        [57] = {57,"军团祭祀和今日军团声望双倍","去军团",},
        [58] = {58,"每日签到获得的奖励双倍","去领取",},
        [59] = {59,"五谷丰登获得的奖励双倍","去领取",},
        [60] = {60,"每日任务奖励双倍","去领取",},
    }
}

return return_privilege