--title

local title = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      description = 4,    --详情描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"为游戏打Call","累计登录达到99天","累计登录达到99天",},
        [2] = {2,"最后亿次","在华容道累计猜对99次获胜玩家","在华容道累计猜对99次获胜玩家",},
        [3] = {3,"开不开心","在黄金宝箱中获得任意1件红色装备","在黄金宝箱中获得任意1件红色装备",},
        [4] = {4,"惊不惊喜","在卧龙观星活动中直接获得任意1只橙色神兽","在卧龙观星活动中直接获得任意1只橙色神兽",},
        [5] = {5,"意不意外","在割须弃袍活动中直接获得任意1件红装","在割须弃袍活动中直接获得任意1件红装",},
        [6] = {6,"刺不刺激","在身外化身活动中直接获得1枚三清化形羽","在身外化身活动中直接获得1枚三清化形羽",},
        [7] = {7,"还有谁?","在每日竞技场结算时排名竞技场第1","在每日竞技场结算时排名竞技场第1",},
        [8] = {8,"我全都要","拥有所有武将(不包括橙升红武将)","拥有所有武将(不包括橙升红武将)",},
        [9] = {9,"十大战力","每日战力排行榜前10","每日战力排行榜前10",},
        [10] = {10,"来呀, 快活呀","在矿战被击杀999次","在矿战被击杀999次",},
        [11] = {11,"魏国霸主","阵营竞技魏国冠军","阵营竞技魏国冠军",},
        [12] = {12,"蜀国霸主","阵营竞技蜀国冠军","阵营竞技蜀国冠军",},
        [13] = {13,"吴国霸主","阵营竞技吴国冠军","阵营竞技吴国冠军",},
        [14] = {14,"群雄霸主","阵营竞技群雄冠军","阵营竞技群雄冠军",},
        [15] = {15,"狗托","在身外化身活动中直接获得1枚惊鸿化形羽","在身外化身活动中直接获得1枚惊鸿化形羽",},
        [16] = {16,"先定一个小目标","拥有全部橙色变身卡","拥有全部橙色变身卡",},
        [17] = {17,"C位出道","每周4跨服个人竞技4强","每周4跨服个人竞技4强",},
        [18] = {18,"同九年汝何秀","累计在矿战中击杀999个玩家","累计在矿战中击杀999个玩家",},
        [19] = {19,"一人之下","王者之战赛季结算时在排行榜排名第2-10","王者之战赛季结算时在排行榜排名第2-10",},
        [20] = {20,"天下无双","每周4跨服个人竞技冠军","每周4跨服个人竞技冠军",},
        [21] = {21,"不是我针对谁","王者之战赛季结算时在排行榜排名第1","王者之战赛季结算时在排行榜排名第1",},
        [22] = {22,"家里有矿","拥有所有红色变身卡","拥有所有红色变身卡",},
        [23] = {23,"新手指导员","游戏官方新手指导员","游戏官方新手指导员",},
        [24] = {24,"志在四方","桌游志100期纪念专属限定称号","桌游志100期纪念专属限定称号",},
        [25] = {25,"大风起兮云飞扬","蛋糕活动专属限定称号, 有效期30天","蛋糕活动专属限定称号, 有效期30天",},
        [26] = {26,"气吞山河","蛋糕活动专属限定称号, 有效期30天","蛋糕活动专属限定称号, 有效期30天",},
        [27] = {27,"扶摇直上九万里","蛋糕活动专属限定称号, 有效期30天","蛋糕活动专属限定称号, 有效期30天",},
        [28] = {28,"风云际会","见龙在田活动专属称号","见龙在田活动专属称号",},
        [29] = {29,"龙寻隐踪","见龙在田活动专属称号","见龙在田活动专属称号",},
        [30] = {30,"众里寻他千百度","见龙在田活动专属称号","见龙在田活动专属称号",},
        [31] = {1001,"新年2020","2020新年活动期间, 登录1天","2020新年活动期间, 登录1天",},
        [32] = {1002,"如意","2020新年活动期间, 达到20级以上","2020新年活动期间, 达到20级以上",},
        [33] = {1003,"新春快乐","2020新年活动期间, 达到40级以上","2020新年活动期间, 达到40级以上",},
        [34] = {1004,"新年发财","2020新年活动期间, 随机充值任意金额","2020新年活动期间, 随机充值任意金额",},
        [35] = {1005,"大富大贵","2020新年活动期间, 活动期间, 累充500w","2020新年活动期间, 活动期间, 累充500w",},
        [36] = {8023,"社團之星","運營活動獲得","運營活動獲得",},
        [37] = {8024,"魏國之光","運營活動獲得","運營活動獲得",},
        [38] = {8025,"蜀國之光","運營活動獲得","運營活動獲得",},
        [39] = {8026,"吳國之光","運營活動獲得","運營活動獲得",},
        [40] = {8027,"群雄之光","運營活動獲得","運營活動獲得",},
        [41] = {8028,"金色传说","运营活动获得","运营活动获得",},
        [42] = {8029,"天才小画师","运营活动获得","运营活动获得",},
        [43] = {9013,"译者","协助游戏开发者进行游戏翻译校对","协助游戏开发者进行游戏翻译校对",},
    }
}

return title