--explore_discover

local explore_discover = {
    -- key
    __key_map = {
      id = 1,    --奇遇类型_key-int 
      name = 2,    --奇遇事件-简中-string 
      description = 3,    --文本描述-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"水镜学堂","",},
        [2] = {2,"小游戏","",},
        [3] = {3,"小游戏","",},
        [4] = {4,"慕名而来","听闻主公招贤纳士, 无忧惊天不世之才!特来投奔!",},
        [5] = {5,"半价物资","主公, 这些都是走私过来的物资, 只要主公愿意, 我就把他们全部半价拿了!",},
        [6] = {6,"洛阳之战","董卓挟持汉献帝刘协西走长安, 并驱使洛阳数百万人口西迁长安.\n行前, 西凉军大肆烧杀抢掠, 洛阳周围二百里内尽成瓦砾.",},
        [7] = {7,"董卓战乱","权倾朝野, 美人貂蝉, 挟天子以令诸侯, 谁能奈我何?",},
        [8] = {8,"神秘宝箱","此神秘宝箱乃夏商时期巧匠必胜心血所制, 主公稍后片刻即可.",},
        [9] = {11,"游历跑图奖励_蓝色宝物","",},
        [10] = {12,"游历跑图奖励_紫色碎片宝物","",},
        [11] = {13,"游历跑图奖励_紫色完整宝物","",},
        [12] = {14,"游历跑图奖励_橙色碎片宝物","",},
        [13] = {15,"游历跑图奖励_橙色完整宝物","",},
    }
}

return explore_discover