--guild_stage_atk_reward

local guild_stage_atk_reward = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --名称-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"大将军",},
        [2] = {2,"车骑将军",},
        [3] = {3,"骠骑将军",},
        [4] = {4,"翊军将军",},
        [5] = {5,"龙骧将军",},
        [6] = {6,"奋威将军",},
        [7] = {7,"破虏将军",},
        [8] = {8,"奋武将军",},
        [9] = {9,"讨逆将军",},
        [10] = {10,"征虏将军",},
        [11] = {11,"平东将军",},
        [12] = {12,"平南将军",},
        [13] = {13,"平西将军",},
        [14] = {14,"平北将军",},
        [15] = {15,"镇军将军",},
        [16] = {16,"荡寇将军",},
        [17] = {17,"平虏将军",},
        [18] = {18,"威远将军",},
        [19] = {19,"绥远将军",},
        [20] = {20,"牙门将军",},
        [21] = {21,"武威将军",},
        [22] = {22,"武卫将军",},
        [23] = {23,"平狄将军",},
        [24] = {24,"威虏将军",},
        [25] = {25,"扬威将军",},
        [26] = {26,"振威将军",},
        [27] = {27,"振武将军",},
        [28] = {28,"鹰扬将军",},
        [29] = {29,"偏将军",},
        [30] = {30,"扬武将军",},
        [31] = {31,"折冲将军",},
        [32] = {32,"虎翼将军",},
        [33] = {33,"裨将军",},
        [34] = {34,"横野将军",},
        [35] = {35,"横江将军",},
        [36] = {36,"建武将军",},
        [37] = {37,"伏波将军",},
        [38] = {38,"虎威将军",},
        [39] = {39,"虎烈将军",},
        [40] = {40,"校尉",},
    }
}

return guild_stage_atk_reward