--horse_equipment

local horse_equipment = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --装备名称-string 
      description = 3,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"白玉马鞍","白玉制成的马鞍, 极为名贵.",},
        [2] = {102,"紫金马镫","紫金镶嵌的马镫, 彰显气质.",},
        [3] = {103,"银环缰绳","蓝缎制成的缰绳, 尽享丝滑.",},
        [4] = {201,"沧海碧蛟鞍","据说有蛟龙的灵魂附着其上, 保佑征战无往不胜.",},
        [5] = {202,"大漠苍狼镫","有苍狼之灵保佑的马镫, 默默守护着主人.",},
        [6] = {203,"烈日腾蛇缰","牵着附有腾蛇气息的缰绳, 骑马时如腾云驾雾一般.",},
    }
}

return horse_equipment