--resource

local resource = {
    -- key
    __key_map = {
      id = 1,    --资源id_key-int 
      name = 2,    --资源名称-string 
      description = 3,    --道具描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"元宝","建功立业必不可少, 可招募名将和购买道具.",},
        [2] = {2,"银两","硬通货, 装备强化, 武将突破等等都能用到.",},
        [3] = {3,"体力","挑战主线, 精英, 名将副本时需要消耗体力.",},
        [4] = {4,"精力","游历时需要消耗的重要资源.",},
        [5] = {5,"经验","挑战主线副本, 游历和进行冒险都能获得经验.",},
        [6] = {6,"贵族经验","提高VIP等级可以解锁更多VIP功能.",},
        [7] = {7,"威望","可在竞技场商店兑换武将碎片或突破丹.",},
        [8] = {8,"功勋","可在神兵商店兑换神兵和神兵进阶石.",},
        [9] = {9,"将魂","可在神将商店兑换武将, 突破丹, 银两和杜康.",},
        [10] = {10,"精铁","可在装备商店兑换装备和装备精炼石.",},
        [11] = {11,"南蛮令","攻击南蛮消耗的次数",},
        [12] = {12,"挑战次数","过关斩将的挑战次数, 过关斩将可获得大量装备.",},
        [13] = {13,"军团贡献","可在军团商店兑换武将或高价值道具.",},
        [14] = {14,"神魂","可在觉醒商店兑换觉醒时消耗的道具.",},
        [15] = {15,"神兵之魂","回收神兵可以获得, 可以在神兵商店兑换神兵和神兵进阶石",},
        [16] = {16,"充值额度","使用可以获得累计充值, 单笔充值活动中的充值额度.",},
        [17] = {17,"宝物之魂","可在宝物商店兑换宝物和宝物进阶石.",},
        [18] = {18,"军团声望","累积军团声望可提升军团等级.",},
        [19] = {19,"兽魂","可在神兽商店兑换神兽或神兽相关的资源.",},
        [20] = {20,"水晶","充值可以获得的高级资源, 在水晶商店中使用.",},
        [21] = {21,"充值积分","充值获得充值积分, 在水晶商店获得大量奖励.",},
        [22] = {22,"粮草","在矿战中移动需要消耗粮草.",},
        [23] = {23,"攻击令","在矿战中每次攻击消耗1次攻击次数.",},
        [24] = {24,"变身碎片","可在身外化身活动期间在变身卡商店兑换变身卡.",},
        [25] = {25,"追击次数","可在割须弃袍活动期间追击曹操获得各种奖励.",},
        [26] = {26,"观星次数","可在卧龙观星活动期间观星获得各种奖励.",},
        [27] = {27,"专属充值额度","使用可以获得累计充值, 单笔充值活动中的专属充值额度.",},
        [28] = {28,"马魂","可在战马商店中兑换战马",},
        [29] = {29,"刀币","可在王者商店中兑换红装及红色锦囊.",},
        [30] = {30,"玉魂","可在原石商店中兑换原石.",},
        [31] = {31,"功绩","可在周年庆商店中兑换珍稀资源.",},
        [32] = {32,"蟠螭龙之魂","可在见龙在田活动商店中兑换珍稀资源.",},
    }
}

return resource