--seven_days_admin

local seven_days_admin = {
    -- key
    __key_map = {
      day = 1,    --天数_key-int 
      name = 2,    --页签名称-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"每日福利",},
        [2] = {1,"主线副本",},
        [3] = {1,"装备强化",},
        [4] = {1,"半价抢购",},
        [5] = {2,"每日福利",},
        [6] = {2,"游历和竞技",},
        [7] = {2,"宝物升级",},
        [8] = {2,"半价抢购",},
        [9] = {3,"每日福利",},
        [10] = {3,"过关斩将",},
        [11] = {3,"装备精炼",},
        [12] = {3,"半价抢购",},
        [13] = {4,"每日福利",},
        [14] = {4,"南蛮入侵",},
        [15] = {4,"神兵进阶",},
        [16] = {4,"半价抢购",},
        [17] = {5,"每日福利",},
        [18] = {5,"武将商店",},
        [19] = {5,"升级和突破",},
        [20] = {5,"半价抢购",},
        [21] = {6,"每日福利",},
        [22] = {6,"军团BOSS",},
        [23] = {6,"宝物精炼",},
        [24] = {6,"半价抢购",},
        [25] = {7,"每日福利",},
        [26] = {7,"总战力",},
        [27] = {7,"名将册",},
        [28] = {7,"半价抢购",},
    }
}

return seven_days_admin