--treasure

local treasure = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --宝物名称-简中-string 
      description = 3,    --宝物描述-简中-string 
      is_work = 4,    --生效-int 
    
    },
    -- data
    _data = {
        [1] = {101,"吴子","战国名将吴起著.吴起为孔门弟子, 通晓兵家法家儒家, 和孙子连称孙吴.",1,},
        [2] = {102,"三略","原称黄石公三略, 糅合诸子各家的思想, 专论治国用兵战略的兵书.",1,},
        [3] = {201,"鬼谷子","鬼谷子被誉为千古奇人, 通天彻地, 人不能及, 著有鬼谷子兵书十四篇传世.",1,},
        [4] = {202,"遁甲术","奇门遁甲为道家不外传秘术, 夺天地造化之学, 相传左慈曾习得此术.",1,},
        [5] = {203,"司马法","相传为春秋时期姜太公所作, 是现存中国最古老的兵书.",1,},
        [6] = {301,"孙子兵法","最著名的兵书, 春秋时期孙武所著, 博大精深, 被誉为兵学圣典.",1,},
        [7] = {302,"武侯新书","又名将苑, 诸葛亮用兵如神, 此书记录诸葛军事思想, 讨论为将之道.",1,},
        [8] = {303,"孟德新书","曹操半生戎马, 在前人的基础上总结并创新, 成就了这本孟德新书.",1,},
        [9] = {304,"太平要术","相传张角入山采药, 遇南华老仙, 授之太平要术, 后创立太平道.",1,},
        [10] = {401,"界·孙子兵法","最著名的兵书, 春秋时期孙武所著, 博大精深, 被誉为兵学圣典.",0,},
        [11] = {402,"界·武侯新书","又名将苑, 诸葛亮用兵如神, 此书记录诸葛军事思想, 讨论为将之道.",0,},
        [12] = {403,"界·孟德新书","曹操半生戎马, 在前人的基础上总结并创新, 成就了这本孟德新书.",0,},
        [13] = {404,"界·太平要术","相传张角入山采药, 遇南华老仙, 授之太平要术, 后创立太平道.",0,},
        [14] = {111,"奔牛符","许褚有倒拖牛尾之勇, 故曹操特为他打造此兵符.",1,},
        [15] = {112,"野马符","白马将军公孙瓒的兵符, 易京一役后此兵符不知去向.",1,},
        [16] = {211,"战狼符","因司马懿有狼顾之相, 故特制此符, 此符一直陪伴司马懿, 数次征伐有功.",1,},
        [17] = {212,"疾豹符","兵贵神速, 名将夏侯渊执掌疾豹符, 被称为疾行的猎豹.",1,},
        [18] = {213,"腾蛇符","法正善奇谋, 执掌腾蛇印, 助刘备进取汉中, 深受刘备信任与倚重.",1,},
        [19] = {311,"青龙符","淮南子卷三记载: 天神之贵者, 莫贵于青龙.青龙印为名将关羽的兵符.",1,},
        [20] = {312,"白虎符","白虎代表西方七宿, 是正义, 勇猛, 威严的象征, 据说西凉马超曾带此兵符.",1,},
        [21] = {313,"朱雀符","朱雀乃天之四灵之一, 代表炎帝与南方七宿.周瑜曾拥有兵符, 后不知去向.",1,},
        [22] = {314,"玄武符","玄武乃龟蛇合体, 长生不老, 称真武大帝.相传为红将左慈调遣神兵的兵符.",1,},
        [23] = {411,"界·青龙符","淮南子卷三记载: 天神之贵者, 莫贵于青龙.青龙印为名将关羽的兵符.",0,},
        [24] = {412,"界·白虎符","白虎代表西方七宿, 是正义, 勇猛, 威严的象征, 据说西凉马超曾带此兵符.",0,},
        [25] = {413,"界·朱雀符","朱雀乃天之四灵之一, 代表炎帝与南方七宿.周瑜曾拥有兵符, 后不知去向.",0,},
        [26] = {414,"界·玄武符","玄武乃龟蛇合体, 长生不老, 称真武大帝.相传为红将左慈调遣神兵的兵符.",0,},
    }
}

return treasure