--tree_info

local tree_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --主树名称-简中-string 
      up_text = 3,    --升级界面提示文本-简中-string 
      up_text_1 = 4,    --升级界面提示文本-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"神树","露坛","本次突破解锁新的装饰: 露坛",},
        [2] = {2,"神树","赤灵芝","本次突破解锁新的装饰: 赤灵芝",},
        [3] = {3,"神树","翠竹林","本次突破解锁新的装饰: 翠竹林",},
        [4] = {4,"神树","九天瑶池","本次突破解锁新的装饰: 九天瑶池",},
        [5] = {5,"神树","玲珑玉玦","本次突破解锁新的装饰: 玲珑玉玦",},
        [6] = {6,"神树","九华灯","本次突破解锁新的装饰: 九华灯",},
        [7] = {7,"神树","","",},
        [8] = {8,"神树","","",},
        [9] = {9,"神树","","",},
        [10] = {10,"神树","","",},
        [11] = {11,"神树","","",},
    }
}

return tree_info