--update_redpacket

local update_redpacket = {
    -- key
    __key_map = {
      id = 1,    --红包id_key-int 
      name = 2,    --红包名称-string 
    
    },
    -- data
    _data = {
        [1] = {99,"狂欢大红包",},
        [2] = {1,"红色整将一口价",},
        [3] = {2,"红将碎片一口价",},
        [4] = {3,"红色神兵一口价",},
        [5] = {4,"红色万能神兵一口价",},
        [6] = {5,"春秋一口价",},
        [7] = {6,"战国一口价",},
        [8] = {7,"红锦囊一口价",},
        [9] = {8,"橙锦囊一口价",},
        [10] = {9,"择贤令一口价",},
        [11] = {10,"择贤举善令一口价",},
    }
}

return update_redpacket