--act_level_discount

local act_level_discount = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --物品名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"자색장수선택함",},
        [2] = {2,"황색보물선택함",},
        [3] = {3,"제련석(대)",},
        [4] = {4,"제련석(대)",},
        [5] = {5,"신병진급석",},
        [6] = {6,"황색신병선택함",},
        [7] = {7,"황색만능신병",},
        [8] = {8,"보물제련석",},
        [9] = {9,"황색병서선택함",},
        [10] = {10,"황색보물선택함",},
        [11] = {11,"관은병영혼",},
        [12] = {12,"장성채영혼",},
        [13] = {13,"관우영혼",},
        [14] = {14,"재등용부",},
        [15] = {15,"청룡원석",},
        [16] = {16,"백호원석",},
        [17] = {17,"춘추",},
        [18] = {18,"전국",},
        [19] = {19,"예기",},
        [20] = {20,"주역",},
        [21] = {21,"주작원석",},
        [22] = {22,"현무원석",},
        [23] = {23,"춘추",},
        [24] = {24,"전국",},
        [25] = {25,"예기",},
        [26] = {26,"주역",},
        [27] = {27,"청룡원석",},
        [28] = {28,"백호원석",},
        [29] = {29,"춘추",},
        [30] = {30,"전국",},
        [31] = {31,"예기",},
        [32] = {32,"주역",},
        [33] = {33,"황색깃털",},
    }
}

return act_level_discount