--auction

local auction = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --子叶签-韩文-string 
    
    },
    -- data
    _data = {
        [1] = {101,"군단보스",},
        [2] = {102,"퀴즈",},
        [3] = {103,"군단시련",},
        [4] = {104,"삼국전기",},
        [5] = {105,"군단전",},
        [6] = {201,"서버",},
        [7] = {301,"진영경기",},
        [8] = {401,"성지행상",},
        [9] = {501,"신비상인",},
        [10] = {601,"전서버개인전",},
        [11] = {701,"전서버군단전",},
    }
}

return auction