--bubble

local bubble = {
    -- key
    __key_map = {
      id = 1,    --对话id_key-int 
      content = 2,    --对话内容-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1001,"체력단, 기력단, 은화 맡겨만 주세요!",},
        [2] = {1002,"장혼과 경험 아이템을 가지고 돌아올게요!",},
        [3] = {1003,"제가 있으니 돌파단 부족은 걱정 마세요!",},
        [4] = {1004,"장비제련석은 저만 믿어주세요!",},
        [5] = {1005,"보물강화 걱정 끝! 보물제련석을 가져올게요!",},
        [6] = {1006,"신병진급석을 가져올게요!",},
        [7] = {1007,"백성들의 마음을 받아주세요",},
        [8] = {1008,"백성들의 마음을 받아주세요",},
        [9] = {1009,"백성들의 마음을 받아주세요",},
        [10] = {1010,"백성들의 마음을 받아주세요",},
        [11] = {1011,"백성들의 마음을 받아주세요",},
        [12] = {1012,"백성들의 마음을 받아주세요",},
        [13] = {1013,"오늘도 힘내세요, 전 순찰 다녀올게요!",},
        [14] = {1101,"날 이기고 싶으면 실력을 쌓아야지!",},
        [15] = {1102,"날 이기고 싶으면 실력을 쌓아야지!",},
        [16] = {1103,"날 이기고 싶으면 실력을 쌓아야지!",},
        [17] = {1104,"날 이기고 싶으면 실력을 쌓아야지!",},
        [18] = {1105,"날 이기고 싶으면 실력을 쌓아야지!",},
        [19] = {1106,"날 이기고 싶으면 실력을 쌓아야지!",},
        [20] = {1201,"너무 대단해요!",},
        [21] = {1202,"존경 합니다!",},
        [22] = {1203,"정말 좋아요",},
        [23] = {1204,"제가 좋아하는거 아시죠!",},
        [24] = {1205,"나쁜사람!",},
        [25] = {1206,"너무 무서워!",},
        [26] = {1207,"어서 도망가!",},
        [27] = {1208,"정말 싫어, 흥!",},
        [28] = {1301,"반란군이 오고 있어요, 사람 살려!",},
        [29] = {1302,"증원을 요청하고 있어요!",},
        [30] = {1303,"내가 여기서 질거라 생각하는건가!",},
        [31] = {1304,"못 버티겠어요, 빨리 도와줘요!",},
        [32] = {1305,"좀 도와세요!",},
        [33] = {1401,"아 외롭구나!",},
        [34] = {1402,"누가 내 고독함을 알겠어!",},
        [35] = {1403,"맛좀 봐라, 오합지졸들!",},
        [36] = {1404,"나야말로 풍운인물이지",},
        [37] = {2000,"천하통일은 내 손안에!",},
        [38] = {2001,"장수의 레벨이 부족하니, 어서 레벨업하세요!",},
        [39] = {2002,"장수를 레벨업 할 수 있습니다",},
        [40] = {2003,"장수각성 시, 더 높은 전투력이 생긴답니다~",},
        [41] = {2004,"장수들에게 더 높은 레벨의 장비가 필요해요",},
        [42] = {2005,"장비를 제련하면 전투력이 대폭 상승해요!",},
        [43] = {2006,"보물을 좀 더 강화 해주세요",},
        [44] = {2007,"보물을 제련하면 전투력이 대폭 상승해요!",},
        [45] = {2008,"신병 25레벨에 더 강력한 스킬이 해제돼요!",},
    }
}

return bubble