--cake_task

local cake_task = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      desc = 2,    --描述_翻译-string 
    
    },
    -- data
    _data = {
        [1] = {100,"메인 또는 정예던전 도전 25회",},
        [2] = {101,"메인 또는 정예던전 도전 50회",},
        [3] = {102,"메인 또는 정예던전 도전 75회",},
        [4] = {103,"메인 또는 정예던전 도전 100회",},
        [5] = {200,"유람 25회",},
        [6] = {201,"유람 50회",},
        [7] = {202,"유람 75회",},
        [8] = {203,"유람 100회",},
        [9] = {300,"매일임무 활약도 30",},
        [10] = {301,"매일임무 활약도 60",},
        [11] = {302,"매일임무 활약도 90",},
        [12] = {303,"매일임무 활약도 120",},
        [13] = {304,"매일임무 활약도 150",},
        [14] = {400,"12시 군단보스 참여 1회",},
        [15] = {500,"19시 군단보스 참여 1회",},
        [16] = {600,"군단퀴즈 참여 1회",},
        [17] = {700,"군단시련 참여 1회",},
    }
}

return cake_task