--equipment_active

local equipment_active = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      money = 2,    --充值额度_math-int 
      name1 = 3,    --抽奖名称1-韩语-string 
      name2 = 4,    --抽奖名称2-韩语-string 
      time_name = 5,    --倒计时描述-韩语-string 
      hit_chat_1 = 6,    --被击喊话1-韩语-string 
      hit_chat_2 = 7,    --被击喊话2-韩语-string 
      hit_chat_3 = 8,    --被击喊话3-韩语-string 
      hit_chat_4 = 9,    --被击喊话4-韩语-string 
      hit_chat_5 = 10,    --被击喊话5-韩语-string 
      chat_1 = 11,    --常规喊话1-韩语-string 
      chat_2 = 12,    --常规喊话2-韩语-string 
      chat_3 = 13,    --常规喊话3-韩语-string 
      chat_4 = 14,    --常规喊话4-韩语-string 
      chat_5 = 15,    --常规喊话5-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,5000,"추격1회","추격10회","","그만쏴요! 엉엉엉~~~","사정 좀 봐주세요, 좋은 걸 드릴게요!","슬프도다! 받으시지요!","나 잡아봐라~","때리지 마요, 전부 드릴게요!","내 전포로 적색장비를 바꿀 수 있다는 건 손권과 유비의 음모가 분명해!","쳇! 날 따라잡는다면, 적색장비를 두 손으로 갖다 바치지.","명장으로서 적색장비 때문에 조정을 배신하지 마세요!","어떻게 근심을 해소하지, 오직 적색장비뿐이로구나!","내가 없었다면, 몇 명이나 적색장비를 갖고 있을지 모르겠군.",},
        [2] = {2,5000,"추격1회","추격10회","","그만쏴요! 엉엉엉~~~","사정 좀 봐주세요, 좋은 걸 드릴게요!","슬프도다! 받으시지요!","나 잡아봐라~","때리지 마요, 전부 드릴게요!","내 전포로 적색장비를 바꿀 수 있다는 건 손권과 유비의 음모가 분명해!","쳇! 날 따라잡는다면, 적색장비를 두 손으로 갖다 바치지.","명장으로서 적색장비 때문에 조정을 배신하지 마세요!","어떻게 근심을 해소하지, 오직 적색장비뿐이로구나!","내가 없었다면, 몇 명이나 적색장비를 갖고 있을지 모르겠군.",},
        [3] = {1001,5000,"천문1회","천문10회","청룡소멸","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.",},
        [4] = {1002,5000,"천문1회","천문10회","현무소멸|청룡소멸","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.",},
        [5] = {1003,5000,"천문1회","천문10회","현무소멸|백호소멸|성곤소멸|청룡소멸","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.",},
        [6] = {1004,5000,"천문1회","천문10회","현무소멸|연수소멸|백호소멸|기린소멸|성곤소멸|청룡소멸|주작소멸","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.","그만해요.",},
        [7] = {1401,5000,"훈마1회","훈마10회","","","","","","","","","","","",},
        [8] = {1501,5000,"훈마1회","훈마10회","오운답설소멸|야조옥사소멸|연지화룡소멸|비상천리소멸","","","","","","술잔을 잠시 거기 놓아두소서. 제가 금방 갔다 오겠습니다.","좋은 말 한 필이 있소.","좋은것의 본질은 변하지 않습니다.","좋은 말을 타고 천리를 누비겠소.","이런 사소한 일은 신경쓰지 않습니다.",},
    }
}

return equipment_active