--explore_discover

local explore_discover = {
    -- key
    __key_map = {
      id = 1,    --奇遇类型_key-int 
      name = 2,    --奇遇事件-韩语-string 
      description = 3,    --文本描述-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"수경학당","",},
        [2] = {2,"미니게임","",},
        [3] = {3,"미니게임","",},
        [4] = {4,"명장재림","인재등용 소식을 듣고 불세출의 인재인 제가 이렇게 찾아왔습니다!",},
        [5] = {5,"물자반값","이는 모두 밀수해온 물자입니다, 구매하신다면 전부 반값에 드리겠습니다!",},
        [6] = {6,"형양전투","동탁은 한헌제 유협을 협박하여 장안으로 천도하고 수백 만 낙양인들을 장안으로 이주시켰습니다. \n천도 전, 서량군이 집을 불태우고 사람을 죽여대는 바람에 낙양 반경 200리가 모두 폐허로 변했습니다.",},
        [7] = {7,"동탁의난","막강한 권력과 미녀 초선을 얻고 천하를 호령하니, 누가 감히 그에게 도전할 수 있겠는가!",},
        [8] = {8,"신비상자","이 신비한상자는 하상장인이 심혈을 기울여 만든 것입니다. 잠시만 기다려주세요",},
        [9] = {11,"돌파보상_남색보물","",},
        [10] = {12,"돌파보상_자색보물조각","",},
        [11] = {13,"돌파보상_자색보물","",},
        [12] = {14,"돌파보상_황색보물조각","",},
        [13] = {15,"돌파보상_황색보물","",},
    }
}

return explore_discover