--festival_res

local festival_res = {
    -- key
    __key_map = {
      id = 1,    --排序id_key-int 
      res_name = 2,    --资源名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"이벤트-폐기",},
        [2] = {2,"이벤트-폐기",},
        [3] = {3,"장수-폐기",},
        [4] = {4,"장비-폐기",},
        [5] = {5,"보물-폐기",},
        [6] = {6,"신병-폐기",},
        [7] = {7,"재화-폐기",},
        [8] = {8,"설명-공통",},
        [9] = {9,"설명-추석, 국경절",},
        [10] = {10,"설명-칠석",},
        [11] = {11,"설명-블랙프라이데이",},
        [12] = {12,"특별이벤트",},
        [13] = {13,"특별이벤트-칠석",},
        [14] = {14,"특별이벤트-추석",},
        [15] = {15,"특별이벤트-국경절",},
        [16] = {16,"특별이벤트-블랙프라이데이",},
        [17] = {17,"특별이벤트-서버통함",},
        [18] = {18,"특별이벤트-가을축제",},
        [19] = {19,"크리스마스",},
        [20] = {20,"새해",},
        [21] = {21,"설명-크리스마스",},
        [22] = {22,"설명-신년",},
        [23] = {23,"축제",},
        [24] = {24,"설명-축제",},
        [25] = {25,"특별이벤트-정월대보름",},
        [26] = {26,"설명-정월대보름",},
        [27] = {27,"축제",},
        [28] = {28,"축제",},
        [29] = {29,"축제",},
        [30] = {30,"축제",},
        [31] = {31,"여름",},
        [32] = {32,"여름",},
        [33] = {40,"특별이벤트",},
        [34] = {41,"특별이벤트",},
        [35] = {35,"블랙데이",},
        [36] = {36,"블랙데이",},
        [37] = {37,"블랙데이",},
        [38] = {38,"서버통합 이벤트",},
        [39] = {39,"서버통합 이벤트",},
        [40] = {42,"축제",},
        [41] = {43,"축제",},
        [42] = {44,"축제",},
        [43] = {45,"축제",},
        [44] = {46,"축제",},
        [45] = {47,"축제",},
        [46] = {48,"축제",},
        [47] = {49,"크리스마스",},
        [48] = {50,"크리스마스",},
        [49] = {51,"새해",},
        [50] = {52,"새해",},
    }
}

return festival_res