--function_preview

local function_preview = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      text = 2,    --文本描述-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"#level#레벨 해제, 장수등용으로 출전장수 명장책 활성가능,  전투력상승!",},
        [2] = {2,"#level#레벨 장비장착가능, 기본장비 메인던전 획득가능!",},
        [3] = {3,"#level#레벨 4번째장수 출전가능!",},
        [4] = {4,"#level#레벨 경기장해제, 순위상승으로 금화획득!",},
        [5] = {5,"#level#레벨 유람해제, 주사위를 굴리고 보물획득!",},
        [6] = {6,"#level#레벨 주인공과 장수 돌파+2 해제, 돌파를 통해 전투력상승!",},
        [7] = {8,"#level#레벨 5번째장수 출전가능!",},
        [8] = {9,"#level#레벨 관직해제, 관직을 상승시켜 삼국강자도전!",},
        [9] = {10,"#level#레벨 해제, 명장에 도전하고 장비정수 획득하여 강력한 장비로 교환 !",},
        [10] = {11,"#level#레벨 요일던전해제, 매일 필요한 아이템획득!",},
        [11] = {12,"#level#레벨 군단해제, 군단보스 처치하고 금화획득!",},
        [12] = {13,"#level#레벨 주인공과 장수 돌파+3 해제, 돌파를 통해 전투력상승!",},
        [13] = {14,"#level#레벨 6번째장수 출전가능!",},
        [14] = {15,"#level#레벨 영지순찰해제, 다양한 보상획득, 운이 좋으면 완제장수 획득!",},
        [15] = {16,"#level#레벨 지원군해제, 출정장수와 인연활성으로 전투력 상승!",},
        [16] = {17,"#level#레벨 주인공과 장수 돌파+4 해제, 돌파를 통해 전투력상승!",},
        [17] = {18,"#level#레벨 장비제련해제, 장비제련으로 전투력 상승!",},
        [18] = {19,"#level#레벨 명장던전해재, 금화와 장혼획득은 명장던전!",},
        [19] = {20,"#level#레벨 남만처치해제, 남만을 처치하고 다양한 보상획득!",},
        [20] = {21,"#level#레벨 보물제련해제, 보물제련석 필요!",},
        [21] = {22,"#level#레벨 장수각성해제, 장수의 기본속성 대폭상승!",},
        [22] = {23,"#level#레벨 영혼해제, 영혼의 전략적 배치로 무한승리도전!",},
        [23] = {24,"#level#레벨 변신해제, 주인공을 변신시켜 원하는 진형조합!",},
        [24] = {25,"#level#레벨 펫해제, 펫과 함께 삼국통솔!",},
        [25] = {26,"#level#레벨 재등용해제, 원하는 황색,적색장수 재등용으로 새로운 진형조합!",},
        [26] = {27,"#level#레벨 한계돌파해제, 황색장수로 천명을 바꾸라!",},
        [27] = {28,"#level#레벨 보석장착해제, 장비의 속성에 날개를 달자!",},
    }
}

return function_preview