--guild_stage_atk_reward

local guild_stage_atk_reward = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"대장군",},
        [2] = {2,"거기장군",},
        [3] = {3,"표기장군",},
        [4] = {4,"익군장군",},
        [5] = {5,"용양장군",},
        [6] = {6,"분위장군",},
        [7] = {7,"파로장군",},
        [8] = {8,"분위장군",},
        [9] = {9,"토역장군",},
        [10] = {10,"정로장군",},
        [11] = {11,"평동장군",},
        [12] = {12,"평남장군",},
        [13] = {13,"평서장군",},
        [14] = {14,"평북장군",},
        [15] = {15,"진군장군",},
        [16] = {16,"탕구장군",},
        [17] = {17,"평로장군",},
        [18] = {18,"위원장군",},
        [19] = {19,"수원장군",},
        [20] = {20,"아문장군",},
        [21] = {21,"무위장군",},
        [22] = {22,"무위장군",},
        [23] = {23,"평적장군",},
        [24] = {24,"위로장군",},
        [25] = {25,"양위장군",},
        [26] = {26,"진위장군",},
        [27] = {27,"진무장군",},
        [28] = {28,"응양장군",},
        [29] = {29,"편장군",},
        [30] = {30,"양무장군",},
        [31] = {31,"절충장군",},
        [32] = {32,"호익장군",},
        [33] = {33,"비장군",},
        [34] = {34,"횡야장군",},
        [35] = {35,"횡강장군",},
        [36] = {36,"건무장군",},
        [37] = {37,"복파장군",},
        [38] = {38,"호위장군",},
        [39] = {39,"호열장군",},
        [40] = {40,"교위",},
    }
}

return guild_stage_atk_reward