--guild_support_talks

local guild_support_talks = {
    -- key
    __key_map = {
      id = 1,    --说话id_key-int 
      talks = 2,    --援助看板娘随机说话文本，每次进入界面或者点击立绘头像随机播放文字-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"군단도움을 요청해 보세요!",},
        [2] = {2,"매일 군단도움을 통해 적색장수조각 3개 획득가능!",},
        [3] = {3,"매일 군단도움을 통해 자색장수조각 5개 획득가능!",},
        [4] = {4,"매일 군단도움을 통해 황색장수조각 4개 획득가능!",},
        [5] = {5,"군단도움을 이용해 보세요!",},
        [6] = {6,"남는 조각은 군단원에게 기부가능!",},
        [7] = {7,"장수조각을 기부하면 공헌획득!",},
        [8] = {8,"군단도움요청 3회 성공 시 추가 선물획득!",},
    }
}

return guild_support_talks