--guild_cross_war

local guild_cross_war = {
    -- key
    __key_map = {
      id = 1,    --索引id_key-int 
      point_name = 2,    --据点名字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"주둔지",},
        [2] = {2,"주둔지",},
        [3] = {3,"주둔지",},
        [4] = {4,"주둔지",},
        [5] = {5,"주둔지",},
        [6] = {6,"주둔지",},
        [7] = {7,"주둔지",},
        [8] = {8,"주둔지",},
        [9] = {9,"주둔지",},
        [10] = {10,"주둔지",},
        [11] = {11,"주둔지",},
        [12] = {12,"주둔지",},
        [13] = {13,"주둔지",},
        [14] = {14,"주둔지",},
        [15] = {15,"주둔지",},
        [16] = {16,"주둔지",},
        [17] = {17,"청주",},
        [18] = {18,"서주",},
        [19] = {19,"양주",},
        [20] = {20,"형주",},
        [21] = {21,"익주",},
        [22] = {22,"양주",},
        [23] = {23,"병주",},
        [24] = {24,"유주",},
        [25] = {25,"중주",},
    }
}

return guild_cross_war