--guild_stage_talk

local guild_stage_talk = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      talk1 = 2,    --说话1-韩语-string 
      talk2 = 3,    --说话2-韩语-string 
      talk3 = 4,    --说话3-韩语-string 
      talk4 = 5,    --说话4-韩语-string 
      talk5 = 6,    --说话5-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"아니......오해하지 마, 널 겨냥한 게 아니야.","여기 있는 사람들이......다 쓰레기라고!","내가 한 대 치면 끝날걸?","이기지 못하는 전투는 왜 하지?","내가 손가락만 까딱해도 끝나!",},
        [2] = {2,"이 기세를 몰아 적이 방심할 때 공격하자!","당신은 정말 대단한 적수이군요!","막상막하 군, 아주 마음에 들어!","오늘이 바로 너희 군단의 종말이야!","나랑 오늘 끝까지 싸워볼까?",},
        [3] = {3,"이렇게 낯짝이 두꺼운 사람은 처음 봐!","장군님, 살려주십시오! 제겐 부양해야 할 가족들이 있습니다!","비슷한 상대를 찾는 게 낫지 않아?","날 때려봤자 좋을 게 없을걸?","나보다 높은사람을 찾아가봐!",},
    }
}

return guild_stage_talk