--guild_boss_info

local guild_boss_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      city_name = 2,    --城池名称-韩语-string 
      name = 3,    --名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"연주","화웅",},
        [2] = {2,"서주","공손찬",},
        [3] = {3,"서성","방통",},
        [4] = {4,"가정","서서",},
        [5] = {5,"하구","감녕",},
        [6] = {6,"삼강구","여몽",},
        [7] = {7,"창정","조인",},
        [8] = {8,"오소","장합",},
        [9] = {9,"","위무제조조",},
        [10] = {10,"","와룡제갈량",},
        [11] = {11,"","대도독주유",},
        [12] = {12,"","전신여포",},
    }
}

return guild_boss_info