--head_frame

local head_frame = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {1,"프로필을 획득해 보세요","",1,},
        [2] = {2,"출석왕","누적출석365일 획득",1,},
        [3] = {3,"군단보스대가","군단BOSS 누적참가 99회",1,},
        [4] = {4,"군단퀴즈대가","군단퀴즈 누적참가 50회",1,},
        [5] = {5,"군단시련대가","군단시련 누적참가 50회",1,},
        [6] = {6,"삼국전기대가","삼국전기 누적참가 20회",1,},
        [7] = {7,"군단전대가","군단전 누적참가 20회",1,},
        [8] = {8,"게임대가","SP3전용",1,},
        [9] = {9,"명문귀족","SP7전용",1,},
        [10] = {10,"천하대세","SP12전용",1,},
        [11] = {11,"풍족생활","SP13전용",1,},
        [12] = {12,"금지옥엽","SP14전용",1,},
        [13] = {13,"귀한존재","SP15전용",1,},
        [14] = {14,"신의자손","SP16전용",1,},
        [15] = {15,"1주년기념","1주년 한정이벤트획득",0,},
        [16] = {16,"공훈","1주년 한정이벤트획득",1,},
        [17] = {17,"위대한공적","1주년 한정이벤트획득",1,},
        [18] = {18,"훌륭한명성","1주년 한정이벤트획득",1,},
        [19] = {19,"호연지기","견룡재천 한정이벤트획득",1,},
        [20] = {20,"숨은인재","견룡재천 한정이벤트획득",1,},
        [21] = {21,"수집천재","견룡재천 한정이벤트획득",1,},
    }
}

return head_frame