--horse_equipment

local horse_equipment = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --装备名称-string 
      description = 3,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"백옥안장","백옥으로 만든 고귀한 안장",},
        [2] = {102,"자금등","자금 보석을 끼워 만든 말등",},
        [3] = {103,"은환고삐","남색비단으로 만든 반들반들한 고삐",},
        [4] = {201,"창해벽안장","교룡의 영혼이 깃들어 있어 승리만 한다는 안장",},
        [5] = {202,"대막창낭등","푸른이리의 영혼이 깃들어 있어 묵묵히 주인을 보호하는 말등",},
        [6] = {203,"열일등사고삐","등사의 숨결이 깃을어 있어 구름을 타고 하늘을 나는 듯한 고삐",},
    }
}

return horse_equipment