--late_regist

local late_regist = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --条件名-string 
      button_txt = 3,    --按钮文字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"%d 레벨달성","수령",},
        [2] = {2,"%d 레벨달성","수령",},
        [3] = {3,"%d 레벨달성","수령",},
        [4] = {4,"%d 레벨달성","수령",},
        [5] = {5,"%d 레벨달성","수령",},
        [6] = {6,"%d 레벨달성","수령",},
        [7] = {7,"%d 레벨달성","수령",},
        [8] = {8,"%d 레벨달성","수령",},
        [9] = {9,"%d 레벨달성","수령",},
        [10] = {10,"%d 레벨달성","수령",},
        [11] = {11,"%d 레벨달성","수령",},
        [12] = {12,"%d 레벨달성","수령",},
        [13] = {13,"%d 레벨달성","수령",},
        [14] = {14,"%d 레벨달성","수령",},
    }
}

return late_regist