--monster_talk

local monster_talk = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      bubble = 2,    --战斗中说话内容，不要超过25个字-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"최근에 보물을 얻으셨다고 합니다.",},
        [2] = {2,"부적의 위력을 보여 주마!",},
        [3] = {3,"창천은 죽고 황천이 서리라!",},
        [4] = {4,"전투 초기분노 2 , 일반공격 분노 2 추가로 총 분노 4 사용 가능",},
        [5] = {5,"관은병은 메인 공격수이니 잘 키워 주세요.",},
        [6] = {6,"전방 배치는 위험해요, 후방에 배치해 주세요.",},
        [7] = {7,"전방 배치는 위험해요, 후방에 배치해 주세요.",},
        [8] = {8,"후방에 배치하면 더욱 안전해요.",},
        [9] = {9,"레벨업과 장비강화를 하셨나요~",},
        [10] = {10,"장양을 이기기위해서는 성장이 중요해요~",},
        [11] = {11,"저를 잘 키워주세요~",},
        [12] = {12,"저를 잘 키워주세요~",},
        [13] = {13,"저를 잘 키워주세요~",},
        [14] = {14,"저를 잘 키워주세요~",},
        [15] = {15,"저를 잘 키워주세요~",},
        [16] = {16,"저를 잘 키워주세요~",},
        [17] = {17,"저를 잘 키워주세요~",},
        [18] = {18,"저를 잘 키워주세요~",},
        [19] = {19,"경기장에서 얻은 금화 내놔!",},
        [20] = {20,"장수와 장비를 잘 키우지 못하면 날 이기지 못할것입니다.",},
        [21] = {21,"15레벨 2돌파 정도 되어야 승산이 있을거예요.",},
        [22] = {22,"장수와 장비를 잘 키우지 못하면 이기지 못할것입니다.",},
        [23] = {23,"20레벨 정도 되어야 나를 이길수 있을겁니다.",},
        [24] = {24,"23레벨 정도 되어야 나를 이길수 있을겁니다.",},
        [25] = {25,"26레벨 정도 되어야 나를 이길수 있을겁니다.",},
        [26] = {26,"29레벨 정도 되어야 나를 이길수 있을겁니다.",},
        [27] = {27,"경기장은 금화가 참많아!",},
        [28] = {28,"금화가 필요하면 경기장으로 고고!!",},
        [29] = {29,"16레벨이 되면 3성 돌파던전 소탕이 가능해요!",},
        [30] = {31,"16레벨이 되면 3성 돌파던전 소탕이 가능해요!",},
        [31] = {32,"25레벨에 3돌파가 가능하고, 첫턴에 스킬시전과 협공이 가능해요.",},
        [32] = {33,"레벨이 부족하다면 던전 소탕을 해보세요.",},
        [33] = {34,"레벨이 부족하다면 던전 소탕을 해보세요.",},
        [34] = {35,"레벨이 부족하다면 던전 소탕을 해보세요.",},
        [35] = {36,"레벨이 부족하다면 던전 소탕을 해보세요.",},
        [36] = {37,"25레벨에 3돌파가 가능하고, 첫턴에 스킬시전과 협공이 가능해요.",},
        [37] = {38,"25레벨에 3돌파가 가능하고, 첫턴에 스킬시전과 협공이 가능해요.",},
        [38] = {39,"소탕으로도 레벨업이 가능합니다!",},
        [39] = {40,"25레벨에 3돌파가 가능하고, 첫턴에 스킬시전과 협공이 가능해요.",},
        [40] = {41,"자색장수 보다 황색장수가 더 강해요!",},
        [41] = {42,"등용에서 황색장수를 얻을 수 있어요!",},
        [42] = {43,"황색장수가 없으면 등용으로 가보세요!",},
        [43] = {44,"황색장수가 없으면 등용으로 가보세요!",},
        [44] = {45,"황색장수 없이는 저를 이길수 없어요!",},
        [45] = {46,"황색장수가 좀 더 있다면 제가 못이길것 같아요!",},
        [46] = {47,"자색장수로만 전투를 한다고?",},
        [47] = {48,"황색장수가 없으면 나를 이길수 없지!",},
        [48] = {49,"나 하후연이 왜 자색장수지?",},
    }
}

return monster_talk