--official_rank

local official_rank = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --晋升名称-韩语-string 
      text_1 = 3,    --主界面提示文本-韩语-string 
      text_2 = 4,    --晋升提示文本-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {0,"평민","주인공 인연추가: 방어중권-방어추가 +70%","주인공 인연추가: 방어중권-방어추가 +70%",},
        [2] = {1,"호군","","",},
        [3] = {2,"사마","주인공 인연추가: 생명하권- 생명추가 +80%","주인공 인연추가: 생명하권- 생명추가 +80%",},
        [4] = {3,"도위","","",},
        [5] = {4,"교위","","",},
        [6] = {5,"태수","","",},
        [7] = {6,"자사","주인공 인연추가: 공격하권- 공격추가 +70%","주인공 인연추가: 공격하권- 공격추가 +70%",},
        [8] = {7,"중랑장","","",},
        [9] = {8,"경조윤","","",},
        [10] = {9,"상서령","","",},
        [11] = {10,"위장군","","",},
        [12] = {11,"대도독","","",},
        [13] = {12,"대장군","","",},
    }
}

return official_rank