--pet_map

local pet_map = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --图鉴名称-韩语-string 
      show_day = 3,    --达到开服天数显示-int 
      show = 4,    --是否显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"종령육수",1,1,},
        [2] = {2,"제풍랑월",1,1,},
        [3] = {3,"수화불용",21,1,},
        [4] = {4,"월무신상",21,1,},
        [5] = {5,"만천봉화",21,1,},
        [6] = {6,"절천용아",21,1,},
        [7] = {7,"초죽경란",21,1,},
        [8] = {8,"천외행운",21,1,},
        [9] = {9,"경전염화",10,1,},
        [10] = {10,"삼라만상",10,1,},
        [11] = {11,"하자월운",50,1,},
        [12] = {12,"청풍제월",50,1,},
        [13] = {13,"홍황유성",50,1,},
        [14] = {14,"절운열일",50,1,},
        [15] = {15,"파염",50,1,},
        [16] = {16,"파운",50,1,},
        [17] = {17,"봉흉화길",50,1,},
        [18] = {18,"지화천뢰",50,1,},
    }
}

return pet_map