--play_horse_bubble

local play_horse_bubble = {
    -- key
    __key_map = {
      rank = 1,    --名次_key-int 
      text_1 = 2,    --文本1-韩语-string 
      text_2 = 3,    --文本2-韩语-string 
      text_3 = 4,    --文本3-韩语-string 
      text_4 = 5,    --文本4-韩语-string 
      text_5 = 6,    --文本5-韩语-string 
      text_6 = 7,    --文本6-韩语-string 
      text_7 = 8,    --文本7-韩语-string 
      text_8 = 9,    --文本8-韩语-string 
      text_9 = 10,    --文本9-韩语-string 
      text_10 = 11,    --文本10-韩语-string 
      text_11 = 12,    --文本11-韩语-string 
      text_12 = 13,    --文本12-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"일등은 내몫이지","일등은 내가 가져가지","너희는 너무 느려, 완전히 상대가 안 되네","오늘 급식이 나쁘지 않았어","바람같이 빠르다고","진짜 실력을 보여주지","너네 발밑에 쇠라도 달았어? ","나 좀 응원해 줘","일등은 바로 나야","난 토끼띠야, 너네 거북이띠지?","덤빌 필요 없어, 일등은 바로 나야!","가자, 승리가 나를 부른다!",},
        [2] = {2,"뒷심을 발휘해야 해","내가 바로 따라잡아 주지","잘난 척할 거 없어, 바로 따라잡아 줄게!","다 뛰고 나면 같이 한잔하자","나는 아직 전력을 다하지 않았어","오늘은 네가 일등이 아니면 내가 이등이야...","일등하고 한발 차이야","내가 분명히 순위권에 들거야","일등 빼고 다른등수는 별 차이 없어","나는 이등 같은 건 안 할 거야!","마지막까지 힘을 내자","간발의 차이였어",},
        [3] = {3,"양보해 주지","내가 체력을 아껴둔 거야, 알았어?","내가 다크호스라고","무슨 쓸데없는 말이 많아!","승패를 얘기하기엔 아직 일러","내가 사뿐사뿐 걷는다고 우습게 보지 마","앞에 둘, 기다려!","느리다고 남탓은 하지말자","앞에 가는 사람, 바로 따라잡아 줄게!","힘을 내, 삼등도 괜찮아!","나야말로 삼등은 싫어","이번엔 져도 괜찮아",},
        [4] = {4,"내가 끝에서 두번째라니","내가 입은 장비가 무거워서 그래","아까 미끄러져서 그래, 막판 스퍼트가 있어","너무 뭐라고 하지마, 정말 노력했어","다들 발이 미끄러질 때가 있는 거잖아","바닥에 금화가 떨어졌어","뒤에 출발한 사람이 이긴다는거 몰라?","골인 지점이 저렇게 먼데, 날 죽일 셈이야?","나는 3등 안에 못 들 거 같아","절대 꼴찌는 안 할 거야.","곧 결승점이야. 꼴찌는 아니겠지","인생은 원래 힘든 거야",},
        [5] = {5,"시작이 늦었다고 계속 늦는 법은 없어.","5등이라고 무시하지마, 곧 1등 이니까","내가 느리다고 생각하지 말라고","급식을 많이 먹었더니 잘 못 뛰겠어","너무 힘들어서 못 뛰겠어","좀 기다려줘!!!","어제 일찍 잘걸 그랬어","퇴근하고 치맥이나 하자","다리 아파서 못 뛰겠어","너희 달리는게 너무 느려","너희 무슨 약이라도 먹은 거 아니야? ","나는 실력으로 5등한거야!",},
    }
}

return play_horse_bubble