--qin_monster

local qin_monster = {
    -- key
    __key_map = {
      id = 1,    --boss序号_key-int 
      small_name = 2,    --普通怪物名称-string 
      big_name = 3,    --普通怪物名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"선진갑사","황릉몽마",},
        [2] = {2,"선진갑사","황릉몽마",},
        [3] = {3,"선진갑사","황릉몽마",},
        [4] = {4,"선진도병","황릉몽마",},
        [5] = {5,"선진도병","황릉몽마",},
        [6] = {6,"선진도병","황릉몽마",},
        [7] = {7,"선진거병","황릉몽마",},
        [8] = {8,"선진거병","황릉몽마",},
        [9] = {9,"선진거병","황릉몽마",},
    }
}

return qin_monster