--resource

local resource = {
    -- key
    __key_map = {
      id = 1,    --资源id_key-int 
      name = 2,    --资源名称-韩语-string 
      description = 3,    --道具描述-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"금화","공을 세우는데는, 명장 등용과 아이템을 빼놓을 수 없지요.",},
        [2] = {2,"은화","화폐, 장비 강화, 장수 돌파 등등 모두 사용할 수 있어요.",},
        [3] = {3,"체력","메인, 정예, 명장 던전 시 체력이 필요합니다.",},
        [4] = {4,"기력","유람 시 필요합니다.",},
        [5] = {5,"경험","메인던전, 유람, 모험 모두 경혐 획득가능 ",},
        [6] = {6,"SP경험","SP 레벨을 높이면 더 많은 SP 기능을 해제할 수 있습니다.",},
        [7] = {7,"명성","경기장 상점에서 장수조각 혹은 돌파단을 교환할 수 있습니다.",},
        [8] = {8,"공훈","신병상점에서 신병과 신병진급석을 교환할 수 있습니다.",},
        [9] = {9,"장혼","장수상점에서 무장, 돌파단, 은화와 술을 교환할 수 있습니다.",},
        [10] = {10,"정철","장비상점에서 장비와 장비제련석을 교환할 수 있습니다.",},
        [11] = {11,"남만령","남만공격 소모 횟수",},
        [12] = {12,"도전횟수","과관참장의 도전 횟수, 과관참장에서 많은 장비를 획득할 수 있습니다.",},
        [13] = {13,"군단공헌","군단상점에서 장수와 필요 아이템을 교환할 수 있습니다.",},
        [14] = {14,"신혼","각성상점에서 각성 시 소모되는 아이템을 교환할 수 있습니다.",},
        [15] = {15,"신병의혼","신병 회수를하면, 신병상점에서 신병과 신병진급석을 교환할 수 있습니다",},
        [16] = {16,"충전금액","사용하면 누적 충전, 지정 충전의 이벤트 충전금액을 획득할 수 있습니다.",},
        [17] = {17,"보물의혼","보물상점에서 보물과 보물 진급석으로 교환할 수 있습니다.",},
        [18] = {18,"군단명성","누적 군단 명성으로 군단 레벨을 높일 수 있습니다.",},
        [19] = {19,"수혼","펫 상점에서 펫 또는 관련 아이템으로 교환할 수 있습니다.",},
        [20] = {20,"수정","충전으로 유용한 아이템을을 획득할 수 있으며, 수정상점에서 사용합니다.",},
        [21] = {21,"충전점수","충전으로 충전점수를 획득하며, 수정상점에서 많은 보상을 획득할 수 있습니다.",},
        [22] = {22,"식량","광산 이동 시 식량이 소모됩니다.",},
        [23] = {23,"공격령","광산에서 공격시마다 1회의 공격 횟수를 소모합니다.",},
        [24] = {24,"변신조각","신외화신 이벤트 기간 중, 변신상점에서 변신으로 교환 가능합니다.",},
        [25] = {25,"추격횟수","할수기포 이벤트 기간 중, 조조 추격에서 각종 보상을 획득할 수 있습니다.",},
        [26] = {26,"천문횟수","와룡관성 이벤트 기간 중 천문 관측으로 각종 보상을 획득할 수 있습니다.",},
        [27] = {27,"전속충전","사용하면 누적 충전 금액, 지정 충전 금액 이벤트의 귀속 충전 금액을 획득할 수 있습니다.",},
        [28] = {28,"마혼","탈것상점에서 탈것을 교환할 수 있습니다.",},
        [29] = {29,"도전","왕자상점에서 적색장비 및 적색영혼을 교환할 수 있습니다.",},
        [30] = {30,"옥혼","원석상점에서 원석으로 교환할 수 있습니다.",},
        [31] = {31,"공적","1주년 상점에서 필요 아이템을 교환할 수 있습니다.",},
        [32] = {32,"반리용의혼","견룡재천 이벤트 상점에서 필요한 아이템으로 교환할 수 있습니다.",},
    }
}

return resource