--return_privilege

local return_privilege = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      privilege_txt = 2,    --特权说明-string 
      button_txt = 3,    --按钮文字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"요일던전 초기화","초기화|전투",},
        [2] = {2,"과관참장 초기화","초기화|전투",},
        [3] = {3,"메인던전 보상 2배","전투",},
        [4] = {4,"정예던전 보상 2배 ","전투",},
        [5] = {5,"명장던전 보상 2배 ","전투",},
        [6] = {6,"유람 보물, 경험, 은화 2배","유람",},
        [7] = {7,"군단기부, 군단명성 2배","군단",},
        [8] = {8,"출석 보상 2배","수령",},
        [9] = {9,"매일선물 보상 2배","수령",},
        [10] = {10,"일일임무 보상 2배","수령",},
        [11] = {11,"요일던전 초기화","초기화|전투",},
        [12] = {12,"과관참장 초기화","초기화|전투",},
        [13] = {13,"메인던전 보상 2배","전투",},
        [14] = {14,"정예던전 보상 2배 ","전투",},
        [15] = {15,"명장던전 보상 2배 ","전투",},
        [16] = {16,"유람 보물, 경험, 은화 2배","유람",},
        [17] = {17,"군단기부, 군단명성 2배","군단",},
        [18] = {18,"출석 보상 2배","수령",},
        [19] = {19,"매일선물 보상 2배","수령",},
        [20] = {20,"일일임무 보상 2배","수령",},
        [21] = {21,"요일던전 초기화","초기화|전투",},
        [22] = {22,"과관참장 초기화","초기화|전투",},
        [23] = {23,"메인던전 보상 2배","전투",},
        [24] = {24,"정예던전 보상 2배 ","전투",},
        [25] = {25,"명장던전 보상 2배 ","전투",},
        [26] = {26,"유람 보물, 경험, 은화 2배","유람",},
        [27] = {27,"군단기부, 군단명성 2배","군단",},
        [28] = {28,"출석 보상 2배","수령",},
        [29] = {29,"매일선물 보상 2배","수령",},
        [30] = {30,"일일임무 보상 2배","수령",},
        [31] = {31,"요일던전 초기화","초기화|전투",},
        [32] = {32,"과관참장 초기화","초기화|전투",},
        [33] = {33,"메인던전 보상 2배","전투",},
        [34] = {34,"정예던전 보상 2배 ","전투",},
        [35] = {35,"명장던전 보상 2배 ","전투",},
        [36] = {36,"유람 보물, 경험, 은화 2배","유람",},
        [37] = {37,"군단기부, 군단명성 2배","군단",},
        [38] = {38,"출석 보상 2배","수령",},
        [39] = {39,"매일선물 보상 2배","수령",},
        [40] = {40,"일일임무 보상 2배","수령",},
        [41] = {41,"요일던전 초기화","초기화|전투",},
        [42] = {42,"과관참장 초기화","초기화|전투",},
        [43] = {43,"메인던전 보상 2배","전투",},
        [44] = {44,"정예던전 보상 2배 ","전투",},
        [45] = {45,"명장던전 보상 2배 ","전투",},
        [46] = {46,"유람 보물, 경험, 은화 2배","유람",},
        [47] = {47,"군단기부, 군단명성 2배","군단",},
        [48] = {48,"출석 보상 2배","수령",},
        [49] = {49,"매일선물 보상 2배","수령",},
        [50] = {50,"일일임무 보상 2배","수령",},
        [51] = {51,"요일던전 초기화","초기화|전투",},
        [52] = {52,"과관참장 초기화","초기화|전투",},
        [53] = {53,"메인던전 보상 2배","전투",},
        [54] = {54,"정예던전 보상 2배 ","전투",},
        [55] = {55,"명장던전 보상 2배 ","전투",},
        [56] = {56,"유람 보물, 경험, 은화 2배","유람",},
        [57] = {57,"군단기부, 군단명성 2배","군단",},
        [58] = {58,"출석 보상 2배","수령",},
        [59] = {59,"매일선물 보상 2배","수령",},
        [60] = {60,"일일임무 보상 2배","수령",},
    }
}

return return_privilege