--seven_days_admin

local seven_days_admin = {
    -- key
    __key_map = {
      day = 1,    --天数_key-int 
      name = 2,    --页签名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"매일혜택",},
        [2] = {1,"메인던전",},
        [3] = {1,"장비강화",},
        [4] = {1,"반값세일",},
        [5] = {2,"매일혜택",},
        [6] = {2,"유람경기",},
        [7] = {2,"보물성장",},
        [8] = {2,"반값세일",},
        [9] = {3,"매일혜택",},
        [10] = {3,"과관참장",},
        [11] = {3,"장비제련",},
        [12] = {3,"반값세일",},
        [13] = {4,"매일혜택",},
        [14] = {4,"남만처치",},
        [15] = {4,"신병성장",},
        [16] = {4,"반값세일",},
        [17] = {5,"매일혜택",},
        [18] = {5,"장수상점",},
        [19] = {5,"레벨돌파",},
        [20] = {5,"반값세일",},
        [21] = {6,"매일혜택",},
        [22] = {6,"군단보스",},
        [23] = {6,"보물제련",},
        [24] = {6,"반값세일",},
        [25] = {7,"매일혜택",},
        [26] = {7,"총전투력",},
        [27] = {7,"명장책",},
        [28] = {7,"반값세일",},
    }
}

return seven_days_admin