--shop

local shop = {
    -- key
    __key_map = {
      shop_id = 1,    --商店ID_key-int 
      shop_name = 2,    --商店名称-韩语-string 
      tab_name1 = 3,    --页签名称-韩语-string 
      tab_name2 = 4,    --页签名称-韩语-string 
      tab_name3 = 5,    --页签名称-韩语-string 
      tab_name4 = 6,    --页签名称-韩语-string 
      tab_name5 = 7,    --页签名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"잡화상점","아이템","상품","","","",},
        [2] = {2,"장비상점","아이템","자색장비","황색장비","보상","",},
        [3] = {3,"신병상점","아이템","","","","",},
        [4] = {4,"경기상점","아이템","장수","보상","","",},
        [5] = {5,"군단상점","아이템","위","촉","오","군웅",},
        [6] = {6,"장수상점","장수","","","","",},
        [7] = {7,"보물상점","아이템","자색보물","황색보물","","",},
        [8] = {8,"각성상점","아이템","","","","",},
        [9] = {9,"매일특별할인","","","","","",},
        [10] = {10,"매주특별할인","","","","","",},
        [11] = {11,"펫 상점","","","","","",},
        [12] = {12,"물자반값","","","","","",},
        [13] = {13,"변신상점","위","촉","오","군웅","",},
        [14] = {14,"세트장비","","","","","",},
        [15] = {15,"펫 상점","아이템","","","","",},
        [16] = {16,"각성상점","아이템","남색","자색","황색","적색",},
        [17] = {17,"천문상점","","","","","",},
        [18] = {18,"탈것상점","탈것","탈것장신구","","","",},
        [19] = {19,"왕자상점","","","","","",},
        [20] = {20,"원석상점","원석","","","","",},
        [21] = {21,"훈마상점","","","","","",},
        [22] = {22,"1주년상점","1일차","2일차","3일차","금화","",},
        [23] = {24,"금색장수상점","금색장수","구매","아이템","","",},
    }
}

return shop