--shop_crystal

local shop_crystal = {
    -- key
    __key_map = {
      good_id = 1,    --商品id_key-int 
      description = 2,    --说明-韩语-string 
      pay_amount = 3,    --条件值_math-int 
      size_2 = 4,    --奖励数量2_math-int 
      is_work = 5,    --开关_math-int 
    
    },
    -- data
    _data = {
        [1] = {101,"오늘 한번충전#num#원",3900,156,1,},
        [2] = {102,"오늘 한번충전#num#원",5900,236,1,},
        [3] = {103,"금주 한번충전 #num#원",19000,760,1,},
        [4] = {104,"12시 군단보스참가",1,0,1,},
        [5] = {105,"19시 군단보스참가",1,0,1,},
        [6] = {106,"군단시련참가",1,0,1,},
        [7] = {107,"군단퀴즈참가",1,0,1,},
        [8] = {108,"삼국전기참가",1,0,1,},
        [9] = {109,"진영경기참가",1,0,0,},
        [10] = {110,"금주 한번충전 #num#원",39000,1560,1,},
        [11] = {111,"퀴즈참가",1,156,1,},
        [12] = {201,"오늘 한번충전#num#원",3900,156,0,},
    }
}

return shop_crystal