--territory_performance

local territory_performance = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --城池名称-韩语-string 
      hero_name = 3,    --守关武将名字-韩语-string 
      directions = 4,    --城池描述-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"서주","태사자","    서주는 화동의 문호 도시로 환경이 아름답고, 인재가 많이 배출된 곳이다. 술 문화가 발달하여, 문인과 선비들이 술을 즐겼으며, 선조들이 고심하면서 술을 연구하고 빚어, 경험술이 많이 생산된다.",},
        [2] = {2,"예주","장소","    예주는 중원문명의 발상지로 오랫동안 중국의 정치, 경제, 문화의 중심지였다. 많은 군사 분야의 인재를 배출하였고, 장수경험 아이템과 장혼 등이 생산된다.",},
        [3] = {3,"형주","유표","    형산의 남쪽에 자리잡고 있어 형주라 불리며 많은 인재와 명장을 배출했다. 돌파단이 생산되는 군사적 요충지다.",},
        [4] = {4,"청주","조인","옛 명칭은 청주이며, 광산 자원이 풍부하여, 주철 공예가 발달했다. 각종 장비제련석, 정철 등이 생산된다.",},
        [5] = {5,"유주","유비","중국 수당시대 북방의 군사요지 였으며, 교통과 상업의 발달한 도시이다. 보물경험, 보물제련석등이 생산된다.",},
        [6] = {6,"연주","조조","연주는 위나라에 속하며, 공자, 맹자 등이 이곳에서 학문을 가르쳤다. 신병 진급석이 생산된다.",},
    }
}

return territory_performance