--title

local title = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      description = 4,    --详情描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"쌍삼국지최고","누적 로그인 99일 달성","누적 로그인 99일 달성",},
        [2] = {2,"모범생","화용도 누적 승리 99회","화용도 누적 승리 99회",},
        [3] = {3,"게임고수","황금보물상자에서 적색 장비 획득","황금보물상자에서 적색 장비 획득",},
        [4] = {4,"게임대가","와룡관성 펫 1마리 획득","와룡관성 펫 1마리 획득",},
        [5] = {5,"게임사부","할수기포 적색장비1개 획득","할수기포 적색장비1개 획득",},
        [6] = {6,"멋을아는자","신외화신 황색깃털 1개 획득","신외화신 황색깃털 1개 획득",},
        [7] = {7,"내가최고","경기장 순위 1위 달성","경기장 순위 1위 달성",},
        [8] = {8,"모든걸원해","모든 장수 보유(황색에서 적색 진급장수 제외)","모든 장수 보유(황색에서 적색 진급장수 제외)",},
        [9] = {9,"십대전투력","일일 전투력 순위 TOP10","일일 전투력 순위 TOP10",},
        [10] = {10,"함께하자","광산에서 999회 사망","광산에서 999회 사망",},
        [11] = {11,"위왕자","진영 경기 위 진영 우승","진영 경기 위 진영 우승",},
        [12] = {12,"촉왕자","진영 경기 촉 진영 우승","진영 경기 촉 진영 우승",},
        [13] = {13,"오왕자","진영 경기 오 진영 우승","진영 경기 오 진영 우승",},
        [14] = {14,"군웅왕자","진영 경기 군웅 진영 우승","진영 경기 군웅 진영 우승",},
        [15] = {15,"운수대통","신외화신 적색깃털 1개 획득","신외화신 적색깃털 1개 획득",},
        [16] = {16,"목표를정해요","모든 황색 변신 보유","모든 황색 변신 보유",},
        [17] = {17,"내가센터","전서버 개인전 4강","전서버 개인전 4강",},
        [18] = {18,"나만뛰어나","광산에서 유저 총 999명 처치","광산에서 유저 총 999명 처치",},
        [19] = {19,"권력자","왕자전쟁 시즌 결산 시 순위 2-10위","왕자전쟁 시즌 결산 시 순위 2-10위",},
        [20] = {20,"천하무쌍","매주 목요일 서버간 개인 결투 우승","매주 목요일 서버간 개인 결투 우승",},
        [21] = {21,"유아독존","왕자전쟁 시즌 결산 시 순위 1위","왕자전쟁 시즌 결산 시 순위 1위",},
        [22] = {22,"부유한영혼","모든 적색 변신 보유","모든 적색 변신 보유",},
        [23] = {23,"친절한가이드","게임 공식 가이드","게임 공식 가이드",},
        [24] = {24,"굳은의지","이벤트 획득 칭호","이벤트 획득 칭호",},
        [25] = {25,"하늘을가진자","케익이벤트 3위 한정","케익이벤트 한정 ",},
        [26] = {26,"바다를가진자","케익이벤트 2위 한정","케익이벤트 한정 ",},
        [27] = {27,"세상을가진자","케익이벤트 1위 한정","케익이벤트 한정 ",},
        [28] = {28,"수집천재","견룡재천 이벤트 전용 칭호","견룡재천 이벤트 전용 칭호",},
        [29] = {29,"미남자","견룡재천 이벤트 전용 칭호","견룡재천 이벤트 전용 칭호",},
        [30] = {30,"풍운인물","견룡재천 이벤트 전용 칭호","견룡재천 이벤트 전용 칭호",},
        [31] = {1001,"올해의인물","새해이벤트 시 로그인 1일","새해이벤트 시 로그인 1일",},
        [32] = {1002,"앞길창창","새해이벤트 시 20Lv 달성","새해이벤트 시 20Lv 달성",},
        [33] = {1003,"근하신년","새해이벤트 시 40Lv 달성","새해이벤트 시 40Lv 달성",},
        [34] = {1004,"부자될상","새해이벤트 시 임의금액 충전","새해이벤트 시 임의금액 충전",},
        [35] = {1005,"고귀한자","새해이벤트 시 지정금액 충전","새해이벤트 시 지정금액 충전",},
        [36] = {8023,"","","",},
        [37] = {8024,"","","",},
        [38] = {8025,"","","",},
        [39] = {8026,"","","",},
        [40] = {8027,"","","",},
        [41] = {8028,"","","",},
        [42] = {8029,"","","",},
    }
}

return title