--tree_info

local tree_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --主树名称-韩语-string 
      up_text = 3,    --升级提示文本-韩语-string 
      up_text_1 = 4,    --升级界面提示文本-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"도원","화단","신규장식해제: 화단",},
        [2] = {2,"도원","적영지","신규장식해제: 적영지",},
        [3] = {3,"도원","취죽림","신규장식해제: 취죽림",},
        [4] = {4,"도원","구천요지","신규장식해제: 구천요지",},
        [5] = {5,"도원","영롱옥결","신규장식해제: 영롱옥결",},
        [6] = {6,"도원","구화등","신규장식해제: 구화등",},
        [7] = {7,"도원","","",},
        [8] = {8,"도원","","",},
        [9] = {9,"도원","","",},
        [10] = {10,"도원","","",},
        [11] = {11,"도원","","",},
    }
}

return tree_info