--type_manage

local type_manage = {
    -- key
    __key_map = {
      id = 1,    --资源类型编号_key-int 
      name = 2,    --名称-韩语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"장수",},
        [2] = {2,"장비",},
        [3] = {3,"보물",},
        [4] = {4,"신병",},
        [5] = {5,"자원",},
        [6] = {6,"아이템",},
        [7] = {7,"조각",},
        [8] = {8,"보석",},
        [9] = {9,"변신",},
        [10] = {10,"펫",},
        [11] = {11,"영혼",},
        [12] = {12,"탈것",},
        [13] = {13,"역대명장",},
        [14] = {14,"역대명장무기",},
        [15] = {15,"탈것장비",},
        [16] = {16,"옥석",},
        [17] = {17,"프로필",},
        [18] = {18,"칭호",},
    }
}

return type_manage