--update_redpacket

local update_redpacket = {
    -- key
    __key_map = {
      id = 1,    --红包id_key-int 
      name = 2,    --红包名称-string 
    
    },
    -- data
    _data = {
        [1] = {99,"보너스축제",},
        [2] = {1,"적색장수정찰가",},
        [3] = {2,"적색장수조각정찰가",},
        [4] = {3,"적색신병정찰가",},
        [5] = {4,"적색만능신병정찰가",},
        [6] = {5,"춘추정찰가",},
        [7] = {6,"전국정찰가",},
        [8] = {7,"적색영혼정찰가",},
        [9] = {8,"황색영혼정찰가",},
        [10] = {9,"택현령정찰가",},
        [11] = {10,"택현거선령정찰가",},
    }
}

return update_redpacket