--festival_res

local festival_res = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --排序id-int 
      res_name = 2,    --资源名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"祭典-夏季汎用",},
        [2] = {2,"説明-夏季汎用",},
        [3] = {3,"祭典-汎用",},
        [4] = {4,"説明-汎用",},
        [5] = {5,"大感謝祭-七夕新バージョン",},
        [6] = {6,"説明-七夕真バージョン",},
        [7] = {7,"宣伝-七夕真バージョン",},
        [8] = {8,"祭典-サーバー統合",},
        [9] = {9,"説明-サーバー統合",},
        [10] = {10,"宣伝-国慶",},
        [11] = {11,"祭典-秋季汎用",},
        [12] = {12,"説明-秋季汎用",},
        [13] = {13,"祭典-11月11日セールの日祭り",},
        [14] = {14,"説明-11月11日セールの日祭り",},
        [15] = {15,"祭典-年越しの祭典",},
        [16] = {16,"説明-年越しの祭典",},
        [17] = {17,"メリークリスマス",},
        [18] = {18,"説明-メリークリスマス",},
        [19] = {19,"大感謝祭-新春お祝い-廃棄",},
        [20] = {20,"説明-新春お祝い",},
        [21] = {53,"大感謝祭-ほのぼの春",},
        [22] = {54,"説明-ほのぼの春",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [53] = 21,
        [54] = 22,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return festival_res