--fight_silkbag

local fight_silkbag = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --id-int 
      title = 2,    --锦囊组标题-string 
      desc = 3,    --描述-string 
    
    },
    -- data
    _data = {
        [1] = {11,"火計","高やけど確率と無敵封じに配慮する",},
        [2] = {12,"単体火力","ナビゲーション搭載で、打撃は精確",},
        [3] = {13,"範囲攻撃","高ダメージと一定のHP維持能力を保証",},
        [4] = {14,"縦列制御","縦列の怒気減少とめまい効果をアップ。",},
        [5] = {15,"単体制御","単体の怒気減少とめまい効果をアップ",},
        [6] = {16,"回復","回復量たっぷり。一気にHP全回復。",},
        [7] = {17,"支援共通","極めて穏当。生存を保証",},
        [8] = {18,"万毒帰宗","高い中毒確率と治療不能に注意",},
        [9] = {21,"火計","最高のやけど確率を保証し、やけどの追加効果を最大化する",},
        [10] = {22,"単体火力","致命的なダメージ、完璧な刺殺",},
        [11] = {23,"範囲攻撃","爆発的ダメージ。タンク役で火力もある",},
        [12] = {24,"前後縦列攻撃","桃園攻撃に必須。攻撃力をさらに上昇させる",},
        [13] = {25,"縦列制御","縦列の怒気減少とめまい効果をアップ。",},
        [14] = {26,"単体制御","単体の怒気減少とめまい効果をアップ",},
        [15] = {27,"回復","回復も潜伏もできる。秒殺さえされなければ回復して元に戻れる",},
        [16] = {28,"支援共通","全ての武将が使えるが、とにかく時間を稼ごう。",},
        [17] = {29,"万毒帰宗","中毒効果を確約し、生存率を飛躍的に高める。",},
        [18] = {31,"火計","最高のやけど確率を保証し、やけどの追加効果を最大化する",},
        [19] = {32,"単体火力","致命的なダメージ、完璧な刺殺",},
        [20] = {33,"範囲攻撃","爆発的ダメージ。タンク役で火力もある",},
        [21] = {34,"前後縦列攻撃","桃園挑戦に必須。攻撃力と生存能力をさらに高める",},
        [22] = {35,"縦列制御","縦列の怒気減少とめまい効果をアップ。",},
        [23] = {36,"単体制御","単体の怒気減少とめまい効果をアップ",},
        [24] = {37,"回復","回復量がさらに増加するうえ、ダメージ軽減の盾を付与し、攻撃されても死なない",},
        [25] = {38,"支援共通","全ての武将が使えるが、最終的な目標は生存だ。",},
        [26] = {39,"万毒帰宗","究極の毒ダメージ。豊富な中毒効果",},
    },

    -- index
    __index_id = {
        [11] = 1,
        [12] = 2,
        [13] = 3,
        [14] = 4,
        [15] = 5,
        [16] = 6,
        [17] = 7,
        [18] = 8,
        [21] = 9,
        [22] = 10,
        [23] = 11,
        [24] = 12,
        [25] = 13,
        [26] = 14,
        [27] = 15,
        [28] = 16,
        [29] = 17,
        [31] = 18,
        [32] = 19,
        [33] = 20,
        [34] = 21,
        [35] = 22,
        [36] = 23,
        [37] = 24,
        [38] = 25,
        [39] = 26,
    }
}

return fight_silkbag