--function_preview

local function_preview = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      text = 2,    --文本描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Lv#level#で開放。武将を登用すると、出陣武将の名将録が開放され、戦力が大幅に向上！",},
        [2] = {2,"Lv#level#で着用可能な装備。初級装備はストーリーで入手できます。",},
        [3] = {3,"Lv#level#で戦闘に出陣する武将が4人になる",},
        [4] = {4,"Lv#level#で競技場開放。挑戦すると大量の元宝が手に入り、ランキングが高いほど報酬が増えます！",},
        [5] = {5,"Lv#level#で周遊システムが開放。すごろくのように各地を周遊し、宝物や奇遇に出会える",},
        [6] = {6,"Lv#level#になると、プレイヤーおよび武将の突破+2が可能。突破するたび武将の戦闘力が大幅に上昇します",},
        [7] = {8,"Lv#level#で戦闘に出陣する武将が5人になる",},
        [8] = {9,"Lv#level#で官職を開放。官職が上がると、出陣武将すべての戦闘力が向上します",},
        [9] = {10,"Lv#level#で開放。歴代名将に挑戦し、装備の魂石、神装備を獲得しましょう！",},
        [10] = {11,"Lv#level#でデイリークエストが開放。毎日大量の資源がもらえます！",},
        [11] = {12,"Lv#level#で軍団開放。軍団ボスを倒して超大量の元宝を手に入れよう！",},
        [12] = {13,"Lv#level#になると、プレイヤーおよび武将の突破+3が可能",},
        [13] = {14,"Lv#level#で戦闘に出陣する武将が6人になる",},
        [14] = {15,"Lv#level#で領地巡回開放。名将を派遣して城市を巡回させると、大量の資源、さらには一定確率で完全な武将が手に入ります！",},
        [15] = {16,"Lv#level#で援軍が開放されます。武将を登用して援軍に出し、絆を開放すると、戦力が大幅にアップします！",},
        [16] = {17,"Lv#level#になると、プレイヤーおよび武将の突破+4が可能",},
        [17] = {18,"Lv#level#で装備精錬開放。装備精錬は戦闘力を大幅に上昇させます。精錬石集めをお忘れなく！",},
        [18] = {19,"Lv#level#で名将伝が開放され、大量の元宝や魂の勾玉が手に入ります",},
        [19] = {20,"Lv#level#で南蛮侵攻開放。野蛮な暴徒に挑戦して、神器利器を手に入れよう！",},
        [20] = {21,"Lv#level#で宝物精錬が開放されます。宝物精錬石をたくさん購入しよう！",},
        [21] = {22,"Lv#level#で武将の覚醒が開放。武将を覚醒させると基本ステータスが大きくアップしますよ！",},
        [22] = {23,"Lv#level#で錦袋システムを開放。錦袋を装備すれば武将の特性が大幅に強化され、より多彩なプレイが楽しめますよ！",},
        [23] = {24,"Lv#level#で変身カード開放。メインキャラクターを自由に変更し、好きなように陣営を組めれば、もっと楽しめます！",},
        [24] = {25,"Lv#level#で神獣機能開放。可愛いペットがいれば、天下はあなたのもの！",},
        [25] = {26,"Lv#level#で武将交換が開放。武将(橙/赤)を自由に入れ替え、様々な陣容が楽しめます！",},
        [26] = {27,"Lv#level#で限界突破開放。武将(ｵﾚﾝｼﾞ)が天命に逆らい、実力が急上昇！",},
        [27] = {28,"Lv#level#で玉石装着開放。装備のステータスが上昇し、戦闘力がランクアップ！",},
        [28] = {29,"レベル#level#で戦法を開放する",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 9,
        [11] = 10,
        [12] = 11,
        [13] = 12,
        [14] = 13,
        [15] = 14,
        [16] = 15,
        [17] = 16,
        [18] = 17,
        [19] = 18,
        [2] = 2,
        [20] = 19,
        [21] = 20,
        [22] = 21,
        [23] = 22,
        [24] = 23,
        [25] = 24,
        [26] = 25,
        [27] = 26,
        [28] = 27,
        [29] = 28,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [8] = 7,
        [9] = 8,
    }
}

return function_preview