--guild_boss_info

local guild_boss_info = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --id-int 
      city_name = 2,    --城池名称-string 
      name = 3,    --名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"兗州","華雄",},
        [2] = {2,"徐州","公孫瓚",},
        [3] = {3,"西城","龐統",},
        [4] = {4,"街亭","徐庶",},
        [5] = {5,"夏口","甘寧",},
        [6] = {6,"三江口","呂蒙",},
        [7] = {7,"倉亭","曹仁",},
        [8] = {8,"烏巣","張郃",},
        [9] = {9,"","魏の武帝、曹操",},
        [10] = {10,"","臥龍・諸葛亮",},
        [11] = {11,"","大都督・周瑜",},
        [12] = {12,"","戦神呂布",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return guild_boss_info