--guild_cross_war

local guild_cross_war = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --索引id-int 
      name = 2,    --BOSS名称-string 
      point_name = 3,    --据点名字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"黄巾賊亡霊","邯鄲の北",},
        [2] = {2,"黄巾賊亡霊","邯鄲東",},
        [3] = {3,"黄巾賊亡霊","合肥北",},
        [4] = {4,"黄巾賊亡霊","合肥南",},
        [5] = {5,"黄巾賊亡霊","武陵東",},
        [6] = {6,"黄巾賊亡霊","武陵南",},
        [7] = {7,"黄巾賊亡霊","白帝の南",},
        [8] = {8,"黄巾賊亡霊","白帝西",},
        [9] = {9,"黄巾賊亡霊","街亭南",},
        [10] = {10,"黄巾賊亡霊","街亭北",},
        [11] = {11,"黄巾賊亡霊","石城南",},
        [12] = {12,"黄巾賊亡霊","石城北",},
        [13] = {13,"黄巾賊亡霊","朔方西",},
        [14] = {14,"黄巾賊亡霊","朔方北",},
        [15] = {15,"黄巾賊亡霊","烏巣西",},
        [16] = {16,"黄巾賊亡霊","烏巣東",},
        [17] = {17,"","邯鄲",},
        [18] = {18,"","合肥",},
        [19] = {19,"","武陵",},
        [20] = {20,"","白帝",},
        [21] = {21,"","街亭",},
        [22] = {22,"","石城",},
        [23] = {23,"","朔方",},
        [24] = {24,"","烏巣",},
        [25] = {25,"","宛城",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [25] = 25,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return guild_cross_war