--guild_build_postion

local guild_build_postion = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --建筑id-int 
      name = 2,    --建筑名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"軍団大殿",},
        [2] = {2,"軍団の支援",},
        [3] = {3,"軍団商店",},
        [4] = {4,"あずまや",},
        [5] = {5,"軍団ボス",},
        [6] = {6,"軍団献納",},
        [7] = {7,"軍需所",},
        [8] = {8,"軍団の試練",},
        [9] = {9,"東城門",},
        [10] = {10,"軍団戦",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return guild_build_postion