--guild_support_talks

local guild_support_talks = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --说话id-int 
      talks = 2,    --援助看板娘随机说话文本，每次进入界面或者点击立绘头像随机播放文字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"まだ軍団に支援していないのですか?早く支援しましょう！",},
        [2] = {2,"毎日支援すると、武将の欠片(赤)3個を獲得できます。",},
        [3] = {3,"支援すると、紫の欠片(紫)を5個獲得できます",},
        [4] = {4,"支援すると、武将の欠片(ｵﾚﾝｼﾞ)を4個獲得できます",},
        [5] = {5,"まだ支援していない?早く軍団に呼びかけましょう！",},
        [6] = {6,"余っている武将の欠片は同軍団の隊員に贈れます。",},
        [7] = {7,"武将の欠片を贈ると、軍団貢献を獲得できる",},
        [8] = {8,"支援を3回完了すると、星彩が心を込めて準備した豪華報酬を獲得できますよ。",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
    }
}

return guild_support_talks