--head_frame

local head_frame = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --序号-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"さあフレームを開放しよう","",},
        [2] = {2,"春に芽吹く","累計ログイン2日で獲得",},
        [3] = {3,"覇を哮る","軍団ボスに累計20回参加して入手",},
        [4] = {4,"百鬼夜行","軍団クイズに合計15回参加すると獲得。",},
        [5] = {5,"血を賭した","軍団の試練に累計20回参加して入手",},
        [6] = {6,"阿修羅","三国戦記に累計10回参加して入手",},
        [7] = {7,"桜花爛漫","軍団戦に合計10回参加すると獲得。",},
        [8] = {8,"紅葉と黄月","親密度3専用",},
        [9] = {9,"蒼天鯉路","親密度6限定",},
        [10] = {10,"おぉ女神様","親密度9限定",},
        [11] = {11,"フレーム-高貴な身分","親密度13限定",},
        [12] = {12,"フレーム-貴人","親密度14限定",},
        [13] = {13,"フレーム-貴き御身","親密度15専用",},
        [14] = {14,"フレーム-高貴な血統","親密度16限定",},
        [15] = {15,"フレーム-1周年","1周年イベント期間にのみ獲得",},
        [16] = {16,"フレーム-建功立業","1周年記念イベント期間限定入手",},
        [17] = {17,"フレーム-偉大な功績","1周年記念イベント期間限定入手",},
        [18] = {18,"フレーム-名声不滅","1周年記念イベント期間限定入手",},
        [19] = {19,"フレーム-交際","真龍降臨イベント期間限定入手",},
        [20] = {20,"フレーム-賢人を求めて","真龍降臨イベント期間限定入手",},
        [21] = {21,"フレーム-真龍降臨","真龍降臨イベント期間限定入手",},
        [22] = {22,"フレーム-文人の酒会","饗宴の宴イベント期間限定入手",},
        [23] = {23,"フレーム-詩酒風流","饗宴の宴イベント期間限定入手",},
        [24] = {24,"フレーム-人生謳歌","饗宴の宴イベント期間限定入手",},
        [25] = {25,"フレーム-七夕","七夕イベント期間限定入手",},
        [26] = {26,"フレーム-中秋節","中秋イベントで期間限定入手",},
        [27] = {27,"フレーム-祝賀","祝日祭典期間限定入手",},
        [28] = {28,"五福臨門アイコンフレーム","饗宴の宴イベント期間限定入手",},
        [29] = {29,"幸運降臨フレーム","饗宴の宴イベント期間限定入手",},
        [30] = {1000,"白銀の彩","累計ログイン7日で獲得",},
        [31] = {1001,"夏の息吹","",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [1000] = 30,
        [1001] = 31,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [25] = 25,
        [26] = 26,
        [27] = 27,
        [28] = 28,
        [29] = 29,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return head_frame