--return_activity

local return_activity = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      mission_description = 2,    --任务说明-string 
    
    },
    -- data
    _data = {
        [1] = {1,"12:00の軍団ボスイベントに参加する",},
        [2] = {2,"軍団クイズイベントに参加",},
        [3] = {3,"軍団試練イベントに参加",},
        [4] = {4,"19:00の軍団ボスイベントに参加する",},
        [5] = {5,"陣営競技に参加する",},
        [6] = {6,"軍団戦に参加",},
        [7] = {7,"三国戦記に参加する",},
        [8] = {8,"華容道に#num#回参加する",},
        [9] = {9,"12:00の軍団ボスイベントに参加する",},
        [10] = {10,"軍団クイズイベントに参加",},
        [11] = {11,"軍団試練イベントに参加",},
        [12] = {12,"19:00の軍団ボスイベントに参加する",},
        [13] = {13,"陣営競技に参加する",},
        [14] = {14,"軍団戦に参加",},
        [15] = {15,"三国戦記に参加する",},
        [16] = {16,"華容道に#num#回参加する",},
        [17] = {17,"12:00の軍団ボスイベントに参加する",},
        [18] = {18,"軍団クイズイベントに参加",},
        [19] = {19,"軍団試練イベントに参加",},
        [20] = {20,"19:00の軍団ボスイベントに参加する",},
        [21] = {21,"陣営競技に参加する",},
        [22] = {22,"軍団戦に参加",},
        [23] = {23,"三国戦記に参加する",},
        [24] = {24,"華容道に#num#回参加する",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return return_activity