--shop_crystal

local shop_crystal = {
    version =  1,
    -- key
    __key_map = {
      good_id = 1,    --商品id-int 
      description = 2,    --说明-string 
    
    },
    -- data
    _data = {
        [1] = {101,"今日は#num#元を単発チャージ",},
        [2] = {102,"今日は#num#元を単発チャージ",},
        [3] = {103,"その週に1回で#num#元チャージする",},
        [4] = {104,"12時の軍団ボスに参加する",},
        [5] = {105,"19時の軍団ボスに参加する",},
        [6] = {106,"軍団の試練に参加する",},
        [7] = {107,"クイズイベントに参加する",},
        [8] = {108,"三国戦記に参加",},
        [9] = {109,"陣営競技に参加する",},
        [10] = {110,"その週に1回で#num#元チャージする",},
        [11] = {111,"クイズイベントに参加する",},
        [12] = {201,"今日は#num#元を単発チャージ",},
    },

    -- index
    __index_good_id = {
        [101] = 1,
        [102] = 2,
        [103] = 3,
        [104] = 4,
        [105] = 5,
        [106] = 6,
        [107] = 7,
        [108] = 8,
        [109] = 9,
        [110] = 10,
        [111] = 11,
        [201] = 12,
    }
}

return shop_crystal