--tree_buff

local tree_buff = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      screen_comment = 2,    --屏幕生效提示-string 
      description = 3,    --祝福描述-string 
      name = 4,    --祝福名称-string 
      color_text = 5,    --品质名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"[神樹の祝福]#name#有効化。始皇帝陵イベント時間+#value#分","助けて、まだ行ける。始皇帝陵イベント時間+#value#分(70分上限を突破可能)","神灯祈祷","おみくじ-吉",},
        [2] = {2,"","神機妙算、神のごとく先を見通す。軍団クイズで自動的に#value#個の誤った選択肢を除外する。","神機妙算","おみくじ-末吉",},
        [3] = {3,"[神樹の祝福]#name#有効化。軍団Bonus#value#元宝を獲得","気前よくカネを出し、進んで喜捨。#value#元宝の軍団Bonusを獲得しました。早くみんなに配りましょう！","博施済衆 ","おみくじ-平",},
        [4] = {4,"[神樹の祝福]#name#有効化。その回で答えを間違えても脱落しない","免死金牌を下賜し、罪を許してやろう。今日の全サーバークイズで、間違えても死なないチャンスが#times#回あります。","丹書鉄券","おみくじ-平",},
        [5] = {5,"[神樹の祝福]#name#の効果により、今回は失敗しても挑戦回数を消費しない。","失敗は成功の父！今日の軍団の試練で最初の#times#回の戦闘は敗北したため、回数を消費しません。","東山再起","おみくじ-平",},
        [6] = {6,"[神樹の祝福]#name#有効化。その回の終点に到達すると、伯楽の相馬経を#value#冊獲得","千里を駆ける良駒、その大才を発揮する。「跳べ！的盧！」で終点に到達すると伯楽の相馬経#value#冊を獲得。","駿馬良駒","おみくじ-平",},
        [7] = {7,"[神樹の祝福]#name#の効果により、今回は獲得する軍団貢献度+#value#%。","うちの門前には2本の棗の木がある。今日の軍団の試練に勝利し、軍団貢献+#value#%。","戦功卓越","おみくじ-末吉",},
        [8] = {8,"[神樹の祝福]#name#有効化。その回は戦死してもその場で復活する","態勢を立て直し捲土重来！軍団戦で撃破されると、その場で#times#回まで復活できる。","捲土重来","おみくじ-平",},
        [9] = {9,"","勝利に乗じて追撃せよ。戦は迅速な行動を最も尊ぶ。軍団戦の攻撃クールダウン時間-#value#秒。","兵貴神速","おみくじ-末吉",},
        [10] = {10,"","兵は強く馬は頑丈、向かうところ敵なし。軍団戦でのHP+#value#%。","兵強馬壮","おみくじ-末吉",},
        [11] = {11,"","城を攻め土地を奪え、鉄を泥のように削れ。軍団戦での建造物に与えるダメージ+#value#%。","斬鉄如泥","おみくじ-吉",},
        [12] = {12,"","徒手空拳、無から有を生む。軍団ボスに挑戦すると、さらに#value#回略奪できる。","無中生有","おみくじ-平",},
        [13] = {13,"[神樹の祝福]#name#有効化。その回の奪取ポイント+#value#%","決まった収入だけでは金持ちになれない。軍団ボス挑戦で奪うポイント+#value#%。","順手牽羊","おみくじ-平",},
        [14] = {14,"[神樹の祝福]#name#の効果により、今回は失敗しても奪取回数を消費しない。","金蝉の神技、身を守りつつ退く。軍団ボス挑戦で略奪に失敗すると回数を消費せず、クールダウンに入りません。","金蝉脱殻","おみくじ-平",},
        [15] = {15,"[神樹の祝福]#name#の効果により、今回は与えるダメージ+#value#%。","万矢を一斉に放ち勇往邁進。三国戦記でボスにダメージを与えると+#value#%。","万矢斉射","おみくじ-平",},
        [16] = {16,"","高倍率に賭けて、海辺に別荘を建てよう。華容道では毎回選手1人に支持券#value#枚を投じることができます。","乾坤一擲","おみくじ-吉",},
        [17] = {17,"[神樹の祝福]#name#有効化。その回の移動費用が低下","何をするにも準備が大事。鉱山戦の移動では、#times#鉱山を通過するまでは兵糧を消費しません。","糧秣先行","おみくじ-末吉",},
        [18] = {18,"[神樹の祝福]#name#の効果により、今回の購入では優待を獲得。","五穀豊穣、安常処順。兵糧購入の最初の#times#回の価格-#value#%。","五穀豊穣","おみくじ-平",},
        [19] = {19,"[神樹の祝福]#name#の効果により、今回の購入では優待を獲得。","良い品お安く、誠実商い。攻撃令の最初の#times#回の購入価格-#value#%。","良品廉価","おみくじ-平",},
        [20] = {20,"[神樹の祝福]#name#有効化。その回の攻撃は兵力を余分に損失させる","奮戦、向かうところ敵無し。鉱山戦で敵を攻撃し、#value#ptの兵力損失を与えました。","浴血奮戦","おみくじ-吉",},
        [21] = {21,"","鉱山戦の採掘収益+#value#%","","おみくじ-大吉",},
        [22] = {22,"","今日「跳べ！的盧！」で終点に到達すると、伯楽の相馬経#value#冊を#times#回獲得","","おみくじ-中吉",},
        [23] = {23,"","南蛮侵攻での孟獲(神)の発見確率+#value#%","慧眼識珠","おみくじ-小吉",},
        [24] = {24,"[神樹の祝福]#name#の効果により、今回は与えるダメージ+#value#%。","力を溜めているクロスサーバーBOSSを攻撃時、#value#%のダメージボーナスを獲得","戦況無常","おみくじ-吉",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return tree_buff