--update_redpacket

local update_redpacket = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --红包id-int 
      name = 2,    --红包名称-string 
    
    },
    -- data
    _data = {
        [1] = {99,"カーニバルビッグBonus",},
        [2] = {1,"単体武将(赤)の即決価格",},
        [3] = {2,"武将の欠片(赤)即決価格",},
        [4] = {3,"神器(赤)即決価格",},
        [5] = {4,"万能神器(赤)の即決価格",},
        [6] = {5,"春秋即決価格",},
        [7] = {6,"戦国即決価格",},
        [8] = {7,"錦袋(赤)即決価格",},
        [9] = {8,"錦袋(ｵﾚﾝｼﾞ)即決価格",},
        [10] = {9,"陣営交換令の即決価格",},
        [11] = {10,"求賢求善令の即決価格",},
    },

    -- index
    __index_id = {
        [1] = 2,
        [10] = 11,
        [2] = 3,
        [3] = 4,
        [4] = 5,
        [5] = 6,
        [6] = 7,
        [7] = 8,
        [8] = 9,
        [9] = 10,
        [99] = 1,
    }
}

return update_redpacket