--horse_tu_res

local horse_tu_res = {
    -- key
    __key_map = {
      id = 1,    --道具id-int 
      index = 2,    --层次-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Titik awal",},
        [2] = {2,"Titik akhir",},
        [3] = {3,"Rintangan",},
        [4] = {4,"Rintangan",},
        [5] = {5,"Jalan",},
        [6] = {6,"Jalan",},
        [7] = {7,"Jalan",},
        [8] = {8,"Koin",},
        [9] = {9,"Koin",},
        [10] = {10,"Jalan",},
        [11] = {11,"Jalan",},
        [12] = {12,"Jalan",},
        [13] = {13,"Jalan",},
        [14] = {21,"Jalan",},
        [15] = {22,"Jalan",},
        [16] = {23,"Jalan",},
        [17] = {24,"Jalan",},
        [18] = {25,"Jalan",},
        [19] = {26,"Jalan",},
        [20] = {27,"Jalan",},
        [21] = {28,"Jalan",},
        [22] = {29,"Jalan",},
        [23] = {30,"Jalan",},
        [24] = {31,"Jalan",},
        [25] = {32,"Jalan",},
        [26] = {33,"Jalan",},
        [27] = {34,"Jalan",},
        [28] = {35,"Jalan",},
        [29] = {36,"Jalan",},
        [30] = {37,"Jalan",},
        [31] = {38,"Jalan",},
        [32] = {39,"Jalan",},
        [33] = {40,"Jalan",},
        [34] = {41,"Jalan",},
        [35] = {42,"Jalan",},
        [36] = {43,"Jalan",},
        [37] = {61,"中景",},
        [38] = {62,"中景",},
        [39] = {63,"远景山",},
        [40] = {64,"中景",},
        [41] = {65,"中景",},
        [42] = {66,"中景",},
        [43] = {67,"中景",},
        [44] = {68,"中景",},
        [45] = {69,"远景山",},
        [46] = {70,"起点-前景",},
        [47] = {71,"Awan",},
        [48] = {72,"Awan",},
        [49] = {73,"Awan",},
        [50] = {74,"中景",},
        [51] = {75,"终点-前景",},
    }
}

return horse_tu_res