--act_week_discount

local act_week_discount = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --礼包名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ยากำลัง",},
        [2] = {2,"ยาพลังสติ",},
        [3] = {3,"ยาทะลวง",},
        [4] = {4,"ดวงจิตสมบัติ",},
        [5] = {5,"ตู้คัง10ปี",},
        [6] = {6,"จิตขุนพล",},
        [7] = {7,"หินสกัดขั้นสูง",},
        [8] = {8,"หินเลื่อนขั้นศาสตราวุธ",},
        [9] = {9,"ศาสตราวุธสารพัดนึกสีส้ม",},
        [10] = {10,"แท่นหมึกทอง",},
        [11] = {11,"หินสกัดสมบัติ",},
        [12] = {12,"ยากำลัง",},
        [13] = {13,"ยาพลังสติ",},
        [14] = {14,"ยาทะลวง",},
        [15] = {15,"ดวงจิตสมบัติ",},
        [16] = {16,"ตู้คัง10ปี",},
        [17] = {17,"จิตขุนพล",},
        [18] = {18,"หินสกัดขั้นสูง",},
        [19] = {19,"หินเลื่อนขั้นศาสตราวุธ",},
        [20] = {20,"ศาสตราวุธสารพัดนึกสีส้ม",},
        [21] = {21,"หินสกัดสมบัติ",},
        [22] = {22,"หินสกัดขั้นสูง",},
        [23] = {23,"เงินทอง",},
        [24] = {24,"ยากำลัง",},
        [25] = {25,"ยาพลังสติ",},
        [26] = {26,"ยาทะลวง",},
        [27] = {27,"ตู้คัง10ปี",},
        [28] = {28,"จิตขุนพล",},
        [29] = {29,"หินสกัดขั้นสูง",},
        [30] = {30,"หินเลื่อนขั้นศาสตราวุธ",},
        [31] = {31,"ศาสตราวุธสารพัดนึกสีส้ม",},
        [32] = {32,"ยาปลุก",},
        [33] = {33,"หินสกัดสมบัติ",},
        [34] = {34,"เงินทอง",},
        [35] = {35,"ยากำลัง",},
        [36] = {36,"ยาพลังสติ",},
        [37] = {37,"ยาทะลวง",},
        [38] = {38,"ตู้คัง10ปี",},
        [39] = {39,"จิตขุนพล",},
        [40] = {40,"หินสกัดขั้นสูง",},
        [41] = {41,"หินเลื่อนขั้นศาสตราวุธ",},
        [42] = {42,"ศาสตราวุธสารพัดนึกสีส้ม",},
        [43] = {43,"ยาปลุก",},
        [44] = {44,"หินสกัดสมบัติ",},
    }
}

return act_week_discount