--act_dinner

local act_dinner = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --名称-泰语-string 
      chat_before = 3,    --领取前对话-泰语-string 
      chat_after = 4,    --领取后对话-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ลันช์","นายท่านหิวยัง?มากินเร็ว～","นายท่านอย่าลืมมาอีกเวลา18:00นะ～",},
        [2] = {2,"เย็น","นายท่านหิวยัง?มากินเร็ว～","นายท่านอย่าลืมมาอีกเวลา21:00นะ～",},
        [3] = {3,"มื้อดึก","เชิญนายท่านกินให้เต็มที่!","นายท่านคืนนี้ไม่ไปไหนหรอ?",},
    }
}

return act_dinner