--act_level_discount

local act_level_discount = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --物品名称-string 
      show_level = 3,    --显示等级-int 
      unlock_level = 4,    --解锁等级_math-int 
    
    },
    -- data
    _data = {
        [1] = {1,"หีบเลือกขุนพลม่วง",30,30,},
        [2] = {2,"หีบเลือกอัญมณีสีส้ม",30,35,},
        [3] = {3,"หินสกัดขั้นสูง",30,40,},
        [4] = {4,"หินสกัดขั้นสูง",30,40,},
        [5] = {5,"หินเลื่อนขั้นศาสตราวุธ",40,46,},
        [6] = {6,"หีบเลือกศาสตราวุธสีส้ม",40,46,},
        [7] = {7,"ศาสตราวุธสารพัดนึกสีส้ม",40,46,},
        [8] = {8,"หินสกัดสมบัติ",46,50,},
        [9] = {9,"หีบเลือกพิชัยยุทธ์สีส้ม",46,50,},
        [10] = {10,"หีบเลือกตราสมบัติสีส้ม",46,50,},
        [11] = {11,"ถุงแพรกวนอิ๋นผิง",50,58,},
        [12] = {12,"ถุงแพรเตียวซี",50,58,},
        [13] = {13,"ถุงแพรกวนอู",50,58,},
        [14] = {14,"ยันต์แทนที่",60,75,},
        [15] = {15,"หินดิบมังกรเขียว",75,83,},
        [16] = {16,"หินดิบพยัคฆ์ขาว",75,83,},
        [17] = {17,"ชุนชิว",83,85,},
        [18] = {18,"กลียุค",83,85,},
        [19] = {19,"หนังสือหลี่จี้",85,90,},
        [20] = {20,"โจวอี้",85,90,},
        [21] = {21,"หินดิบหงส์ไฟ",90,95,},
        [22] = {22,"หินดิบเต่าดำ",90,95,},
        [23] = {23,"ชุนชิว",95,100,},
        [24] = {24,"กลียุค",95,100,},
        [25] = {25,"หนังสือหลี่จี้",100,102,},
        [26] = {26,"โจวอี้",100,102,},
        [27] = {27,"หินดิบมังกรเขียว",102,104,},
        [28] = {28,"หินดิบพยัคฆ์ขาว",102,104,},
        [29] = {29,"ชุนชิว",104,106,},
        [30] = {30,"กลียุค",104,106,},
        [31] = {31,"หนังสือหลี่จี้",106,108,},
        [32] = {32,"โจวอี้",106,108,},
        [33] = {33,"ปีกจำแลงไตรวิสุทธิ์",108,110,},
    }
}

return act_level_discount