--act_admin

local act_admin = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --活动名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เช็คชื่อ",},
        [2] = {2,"งานเลี้ยง",},
        [3] = {3,"การ์ดหรูหรา",},
        [4] = {40,"ทุนเติบโต",},
        [5] = {41,"ทุนเติบโต1",},
        [6] = {42,"ทุนเติบโต2",},
        [7] = {43,"ทุนเติบโต3",},
        [8] = {44,"ทุนเติบโต4",},
        [9] = {45,"ทุนเติบโต5",},
        [10] = {46,"ทุนเติบโต6",},
        [11] = {47,"ทุนเติบโต7",},
        [12] = {48,"ทุนเติบโต8",},
        [13] = {49,"ทุนเติบโต9",},
        [14] = {50,"ทุนเติบโต10",},
        [15] = {51,"ทุนเติบโต11",},
        [16] = {52,"ทุนเติบโต12",},
        [17] = {53,"ทุนเติบโต13",},
        [18] = {54,"ทุนเติบโต14",},
        [19] = {55,"ทุนเติบโต15",},
        [20] = {56,"ทุนเติบโต16",},
        [21] = {57,"ทุนเติบโต17",},
        [22] = {5,"แพ็ครายวัน",},
        [23] = {6,"ชามสมบัติ",},
        [24] = {7,"แพ็คราย\nสัปดาห์",},
        [25] = {8,"แพ็คเลเวล",},
        [26] = {9,"นัดOBT",},
        [27] = {10,"คืนโบนัสเติมเงิน",},
        [28] = {11,"หาคืน\nทรัพยากร",},
        [29] = {12,"พืชสมบูรณ์",},
        [30] = {80,"后加入",},
    }
}

return act_admin