--auction

local auction = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --子叶签-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {101,"BOSSกองทัพ",},
        [2] = {102,"ตอบคำถามกองทัพ",},
        [3] = {103,"ทดสอบกองทัพ",},
        [4] = {104,"ศึกสามก๊ก",},
        [5] = {105,"ศึกกองทัพ",},
        [6] = {201,"ทั้งเซิร์ฟ",},
        [7] = {301,"ประลองค่าย",},
        [8] = {401,"ร้านค้าเหมือง",},
        [9] = {501,"ร้านค้าลึกลับ",},
        [10] = {601,"ส่วนตัวข้ามเซิร์ฟ",},
        [11] = {701,"ศึกกองทัพข้ามเซิร์ฟ",},
    }
}

return auction