--boss_content

local boss_content = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      text = 2,    --相关文本-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"นายท่าน ท้ารบBOSSกองทัพครั้งนี้ จำนวนคนที่เข้าร่วมกองทัพของท่าน#number#คน, คะแนนกองทัพอันดับที่#rank# ได้รับชื่อเสียงกองทัพ#prestige#, รางวัลจะถูกส่งไปยังประมูลและจดหมาย",},
        [2] = {2,"นายท่าน ท้ารบBOSSกองทัพครั้งนี้ คะแนนของท่านอยู่อันดับที่#rank# รางวัลจะส่งไปทางจดหมาย(เข้าร่วมกองทัพจะได้รับรางวัลมากขึ้นนะ!)",},
        [3] = {3,"#name1#ชิง#name2##integral#คะแนนสำเร็จ",},
        [4] = {4,"#name1#ถูก#name2#ชิง#integral#คะแนน",},
        [5] = {5,"#name1#ท้ารบBossโลกได้รับ#integral#คะแนน",},
        [6] = {6,"ถูก#name#ชิง#integral#คะแนน",},
        [7] = {7,"ท้ารบBossโลกครั้งนี้ได้รับ#integral#คะแนน",},
        [8] = {8,"ชิง#name##integral#คะแนนสำเร็จ",},
    }
}

return boss_content