--bubble

local bubble = {
    -- key
    __key_map = {
      id = 1,    --对话id-int 
      content = 2,    --对话内容-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1001,"นายท่าน ดูยากำลัง ยาพลังสติและเงินทองที่ข้าหามาให้ท่านสิ!",},
        [2] = {1002,"นายท่าน รอข้าหาจิตขุนพลจำนวนมาก ไอเทมEXPให้ได้ก่อนแล้วจะกลับมา!",},
        [3] = {1003,"นายท่าน มีข้าอยู่ ก็ไม่ต้องห่วงว่ายาทะลวงจะไม่พอแล้ว!",},
        [4] = {1004,"นายท่าน ดูหินสกัดอุปกรณ์ที่ข้าหามาให้ท่านสิ!",},
        [5] = {1005,"นายท่าน เลี้ยงสมบัติไม่ต้องกังวล รอข้ารวบรวมหินสกัดสมบัติให้มากขึ้นก่อนนะ!",},
        [6] = {1006,"นายท่าน หยิบหินเลื่อนขั้นศาสตราวุธมากขึ้น เลี้ยงดูศาสตรา ข้าก็จะสามารถเฆี่ยนตีคนอื่นได้แล้ว!",},
        [7] = {1007,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [8] = {1008,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [9] = {1009,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [10] = {1010,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [11] = {1011,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [12] = {1012,"ภายใต้การป้องของ ท่านกันของเจ้า ทำ ให้เหมืองเจริญขึ้น โปรดรับรางวัลเลย!",},
        [13] = {1013,"นายท่านสู้ๆ ข้าจะไปลาดตระเวนแล้ว!",},
        [14] = {1101,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [15] = {1102,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [16] = {1103,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [17] = {1104,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [18] = {1105,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [19] = {1106,"อยากเอาชนะข้าก็ต้องใช้ฝีมือหน่อยนะ!",},
        [20] = {1201,"นายท่านผู้ยิ่งใหญ่",},
        [21] = {1202,"รักนายท่านมากเลย",},
        [22] = {1203,"จุ๊บๆนายท่าน",},
        [23] = {1204,"นายท่านน่ารักจัง ข้าอยากจะมีลูกให้ท่าน!",},
        [24] = {1205,"ปีศาจชั่ว!",},
        [25] = {1206,"แม่จ๋า กลัวๆ!",},
        [26] = {1207,"อ๊ะๆ รีบหนีเร็ว!",},
        [27] = {1208,"น่าเกลียด หึ!",},
        [28] = {1301,"ทหารกบฎมาแล้ว ช่วยข้าด้วย!",},
        [29] = {1302,"กำลังขอกองหนุน!",},
        [30] = {1303,"บัดซบ!ข้าจะต้องตายอยู่ที่นี่จริงๆเหรอ?",},
        [31] = {1304,"ควบคุมไม่อยู่แล้ว รีบมาช่วยข้าที!",},
        [32] = {1305,"พี่ใหญ่ โปรดเมตตา ช่วยเหลือที!",},
        [33] = {1401,"ความโดดเดี่ยวช่างเหงาเหลือเกิน!",},
        [34] = {1402,"พวกกากเดน ไม่เข้าใจความโดดเดี่ยวของข้าหรอก!",},
        [35] = {1403,"ตายซะเถอะ พวกงี่เง่า!",},
        [36] = {1404,"คิดถึงตัวละครร่าเริงในยุคของข้า พราวเสน่ห์เพียงผู้เดียว!",},
        [37] = {2000,"รวมแผ่นดิน ไม่ใช่ข้าก็ไม่มีใครแล้ว!",},
        [38] = {2001,"เลเวลขุนพลผู้ใต้บังคับบัญชาไม่พอ รีบอัปเลเวลเถอะ",},
        [39] = {2002,"ขุนพลผู้ใต้บังคับบัญชายังสามารถทะลวงถึงเลเวลที่สูงขึ้นได้!",},
        [40] = {2003,"ปลุกขุนพลสามารถมอบพลังรบจำนวนมากได้นะ～",},
        [41] = {2004,"ขุนพลพวกเรายังต้องการอุปกรณ์ที่เลเวลสูงกว่า",},
        [42] = {2005,"สกัดอุปกรณ์สามารถเพิ่มพลังรบได้จำนวนมาก!",},
        [43] = {2006,"สมบัติยังไม่ได้รับการอัปเกรดที่เพียงพอ",},
        [44] = {2007,"สกัดสมบัติสามารถมอบพลังรบที่แข็งแกร่งมากได้",},
        [45] = {2008,"เลื่อนขั้นศาสตราวุธถึงLv.25 สามารถปลดล็อคสกิลที่แข็งแกร่งขึ้นได้!",},
    }
}

return bubble