--cake_task

local cake_task = {
    -- key
    __key_map = {
      id = 1,    --id_math-int 
      desc = 2,    --描述_翻译-string 
    
    },
    -- data
    _data = {
        [1] = {100,"ท้ารบหลักหรือดันเจี้ยนมือเอก 25 ครั้ง",},
        [2] = {101,"ท้ารบหลักหรือดันเจี้ยนมือเอก 50 ครั้ง",},
        [3] = {102,"ท้ารบหลักหรือดันเจี้ยนมือเอก 75 ครั้ง",},
        [4] = {103,"ท้ารบหลักหรือดันเจี้ยนมือเอก 100 ครั้ง",},
        [5] = {200,"พเนจร25ครั้ง",},
        [6] = {201,"พเนจร50ครั้ง",},
        [7] = {202,"พเนจร75ครั้ง",},
        [8] = {203,"พเนจร100ครั้ง",},
        [9] = {300,"ค่าแอ็คทีฟภารกิจแต่ละวันถึง30",},
        [10] = {301,"ค่าแอ็คทีฟภารกิจแต่ละวันถึง60",},
        [11] = {302,"ค่าแอ็คทีฟภารกิจแต่ละวันถึง90",},
        [12] = {303,"ค่าแอ็คทีฟภารกิจแต่ละวันถึง120",},
        [13] = {304,"ค่าแอ็คทีฟภารกิจแต่ละวันถึง150",},
        [14] = {400,"เข้าร่วมกิจกรรมBOSSกองทัพ1ครั้ง12น.",},
        [15] = {500,"เข้าร่วมกิจกรรมBOSSกองทัพ1ครั้ง19น.",},
        [16] = {600,"เข้าร่วมกิจกรรมตอบคำถาม1ครั้ง",},
        [17] = {700,"เข้าร่วมทดสอบกองทัพ1ครั้ง",},
    }
}

return cake_task