--equipment

local equipment = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-泰语-string 
      description = 3,    --装备描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {101,"ดาบกู่ติ้ง","ใช้เหล็กดี ทำด้วยวิธีโบราณ หนัก 19 กิโล มักเป็นอาวุธที่ใช่บ่อย",1,},
        [2] = {102,"เกราะเหล็ก","ใช้เหล็กดี ทำด้วย 49 วัน ไม่ใช่เกราะที่อาวุธธรรมดาจะทำลายได้",1,},
        [3] = {103,"ผ้าอิสระ","ใช้ผ้าดี แช่ด้วยยาชั้นดี คุ้มกายและใจ ทำให้คนรู้สึกมีสติตลอดเวลา",1,},
        [4] = {104,"บูทมัวเร","ใช้หนังดี ทำด้วยกรรมวิธีลับ ดูดซึมเหงื่อดีมาก สวมได้เป็นเวลานาน",1,},
        [5] = {201,"กระบี่ไอซ์","ทำด้วยเหล็ก ตัวกระบีหนาว ตัวยังไม่มาความหนาวมาก่อน ล้อมศัตรูไว้ด้วยแสงหนาว",1,},
        [6] = {202,"เกราะโซ่","หลอมจากเหล็กกล้า ใช้แผ่นเหล็ก 108 แผ่นมาทำเป็นเกราะ ป้องกันดีและเบา",1,},
        [7] = {203,"หมวกเงิน","หลอมจากเหล็กกล้า ใช้มิธริลฉาบผิว มีผลในการปกป้องส่วนหัว ต้านโจมตี",1,},
        [8] = {204,"บูทตัวมิงค์","เย็บจากหนังเตียว หนึ่งเตียวรองเท้าหนึ่งข้าง อบอุ่นในฤดูหนาวเย็นสบายในฤดูร้อน ของดีในการรบ",1,},
        [9] = {301,"ทวนยาวฟ้า","เหล็กกล้าร้อยหลอม หลอมด้วยสายฟ้า โบกสะบัดเกิดสายฟ้า เสียงกัมปนาท",1,},
        [10] = {302,"เกราะศึก","เหล็กกล้าร้อยหลอม จำลองมายา ทำให้ศัตรูเกิดภาพลวงตา โจมตีอากาศ",1,},
        [11] = {303,"มงกุฎมูน","เสี้ยวจันทร์ถักทอ จันทร์เพ็ญเต็มดวง ตะวันพักจันทราโผล่ มีพลังแสงจันทร์",1,},
        [12] = {304,"บูทเงา","ทำจากค้างคาว คล่องแคล่วว่องไว สวมแล้วเดินทางได้ร้อยลี้ในวันเดียวไม่ต้องพัก",1,},
        [13] = {305,"ขวานศึก","ว่ากันว่าขวานนี้ฆ่าศัตรูมานับพัน วิญญาณที่ตายไม่ยอมไปไหน เมื่อเจอศัตรู ตัดวิญญาณก่อน",1,},
        [14] = {306,"เกราะฟ้าผ่า","ใช้มิธริลอย่างดี ใส่สายฟ้าเก้าสวรรค์ มักมีสายฟ้าผ่าอยู่ด้านบน",1,},
        [15] = {307,"หมวกศึกไฟ","ใช้เหล็กภูเขาไฟ หลอมรวมไฟดิน มักมีสายฟ้าเป็นประกายด้านบน",1,},
        [16] = {308,"บูทสลาตัน","ใช้ปีกอินทรีย์ ผสมพลังแห่งลม เดินทางไวปานสลาตัน",1,},
        [17] = {401,"ธนูกิเลน","ธนูเทพที่มีพลังกิเลน ไม่ใช่พลังพันชั่งไม่มีทางง้างออก",1,},
        [18] = {402,"เกราะมังกร","ใช้หนังมังกรน้ำ มีพลังปากว้าจักรวาล",1,},
        [19] = {403,"หมวกฟินิกซ์","เกราะหัวปักหางหงส์ มีพลังหงส์ไว้",1,},
        [20] = {404,"บูทวชิระ","หลอมด้วยเหล็กกล้า แข็งมาก แฝงพลังเคออส",1,},
        [21] = {405,"กระบี่จิงเซง","ใช้น้ำแข็งสวรรค์ชั้นเก้า หลอมในอุณหภูมิต่ำ ว่ากันว่าเป็นกระบี่รักของจิวยี่แม่ทัพภาค",1,},
        [22] = {406,"เกราะขน","ว่ากันว่าเป็นเกราะที่โจจู๋ผลิตขึ้นเพื่อคนที่สวรรค์ลิขิต สกัดจากมรกต ทอด้วยขนนกสีแดงทำให้ยิ่งมีพลังเซียนปกป้องของโจจู๋",1,},
        [23] = {407,"มงกุฎหยก","ของที่ใช้ในตระกูลชนชั้นสูง ทอด้วยเส้นไหมอย่างดี กับตัวหยกดำ ดูหรูหรา",1,},
        [24] = {408,"บูทไหม","ผลิตจากไหมนุ่มอย่างดีกับมรกต ดูหรูหรา เมื่อเผชิญกับศัตรูยังมีพลังปกป้องที่ไม่เลว",1,},
        [25] = {409,"โนวา·หอก","ชิ้นส่วนของชุดโนวา เคยมีขุนพลอาจหาญถือทวนนี้ ต่อสู้ทหารศัตรูเจ็ดเข้าเจ็ดออกโดยไร้พ่าย",1,},
        [26] = {410,"โนวา·เกราะ","ชิ้นส่วนของชุดโนวา ไหลทั้งสองเป็นรูปหมาป่า สวมเกราะแล้วมีอำนาจหมาป่า",1,},
        [27] = {411,"โนวา·หมวก","ชิ้นส่วนของชุดโนวา หลอมจากมิธริลล้ำค่า รูปร่างเหมือนสิงโต อำนาจล้นเหลือ",1,},
        [28] = {412,"โนวา·บูท","ชิ้นส่วนของชุดโนวา ภายนอกเสริมแผ่นอุกกาบาต ภายในมีหนักสัตว์บุ เมื่อชูขึ้น มีบารมีย่ำสวรรค์",1,},
        [29] = {501,"4เทพ·ทวน","ชิ้นส่วนของชุด4เทพ ผสมกลิ่นอสูรเทพมังกร เมื่อโบกสะบัดมีเสียงคำรามมังกร สั่นสะเทือนศัตรูโดยไร้รูป",1,},
        [30] = {502,"4เทพ·เกราะ","ชิ้นส่วนของชุด4เทพ ผสมกลิ่นอสูรเทพเต่า มีผลในการป้องกันอย่างสมบูรณ์แบบ",1,},
        [31] = {503,"4เทพ·หมวก","ชิ้นส่วนของชุด4เทพ ผสมกลิ่นอสูรเทพพเสือ ทำให้มีพลังรบไม่ธรรมดา ก้าวหน้าขึ้นอีกขั้น",1,},
        [32] = {504,"4เทพ·บูท","ชิ้นส่วนของชุด4เทพ ผสมกลิ่นอสูรเทพหงส์ พลังหงส์ไฟทำให้จิตวิญญาณของคนเหนือกว่าทั่วไป",1,},
        [33] = {601,"8ดิน·ง้าว","ชิ้นส่วนของชุด8ดิน มีพลังจิตของอสูรร้ายโบราณเทาเทีย เมื่อต่อสู้เหมือนมีเทพช่วย ไม่ธรรมดา",1,},
        [34] = {602,"8ดิน·เกราะ","ชิ้นส่วนของชุด8ดิน มีพลังจิตของอสูรร้ายโบราณฉงฉี ป้องกันแข็งแกร่ง ไม่อาจพังทลาย",1,},
        [35] = {603,"8ดิน·มงกุฏ","ชิ้นส่วนของชุด8ดิน มีพลังจิตของอสูรร้ายโบราณถาวอู้ ปณิธานหนักแน่น ยึดมั่นจิตใจ",1,},
        [36] = {604,"8ดิน·บูท","ชิ้นส่วนของชุด8ดิน มีพลังจิตของอสูรร้ายโบราณฮุ่นตุ้น ทำให้คนมีทางรอดมหาศาล",1,},
    }
}

return equipment