--equip_essence_stage

local equip_essence_stage = {
    -- key
    __key_map = {
      id = 1,    --关卡id-int 
      name = 2,    --关卡名-泰语-string 
      combat = 3,    --推荐战力-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เตียวคับ","40000",},
        [2] = {2,"อุยเอี๋ยน","70000",},
        [3] = {3,"ซุนซ่างเซียง","120000",},
        [4] = {4,"อิเกียด","170000",},
        [5] = {5,"เตียวเลี้ยว","260000",},
        [6] = {6,"เกียงอุย","640000",},
        [7] = {7,"ซุนเกี๋ยน","1350K",},
        [8] = {8,"เตียวก๊ก","2500K",},
        [9] = {9,"เคาทู","4500K",},
        [10] = {10,"ฮองตง","7170K",},
        [11] = {11,"กำเหลง","11000K",},
        [12] = {12,"กองซุนจ้าน","16800K",},
        [13] = {13,"เตียนอุย","25400K",},
        [14] = {14,"ม้าเฉียว","38900K",},
        [15] = {15,"ลิบอง","57700K",},
        [16] = {16,"กาเซี่ยง","88400K",},
        [17] = {17,"โจหยิน","138500K",},
        [18] = {18,"เตียวหุย","206250K",},
        [19] = {19,"ซุนกวน","315000K",},
        [20] = {20,"ฮัวหยง","457000K",},
        [21] = {21,"แฮหัวตุ้น","620000K",},
        [22] = {22,"กวนอู","790000K",},
        [23] = {23,"ไทสูจู้","1024000K",},
        [24] = {24,"ตั๋งโต๊ะ","1320000K",},
        [25] = {25,"กุยแก","1700000K",},
        [26] = {26,"อุยซี","2200000K",},
        [27] = {27,"เสี่ยวเกี้ยว","2800000K",},
        [28] = {28,"เตียวเสี้ยน","3600000K",},
        [29] = {29,"ซุนฮก","4700000K",},
        [30] = {30,"เล่าปี่","5000000K",},
        [31] = {31,"ไต้เกี้ยว","6000000K",},
        [32] = {32,"ฮัวโต๋","74ร้อยล้าน",},
        [33] = {33,"โจผี","97ร้อยล้าน",},
        [34] = {34,"บังทอง","127ร้อยล้าน",},
        [35] = {35,"ลกซุน","166ร้อยล้าน",},
        [36] = {36,"อ้วนเสี้ยว","220ร้อยล้าน",},
        [37] = {37,"เอียนสี","290ร้อยล้าน",},
        [38] = {38,"ชีซี","300ร้อยล้าน",},
        [39] = {39,"โลซก","400ร้อยล้าน",},
        [40] = {40,"อ้วนสุด","500ร้อยล้าน",},
        [41] = {41,"สุมาอี้","600ร้อยล้าน",},
        [42] = {42,"จูล่ง","700ร้อยล้าน",},
        [43] = {43,"ซุนเซ็ก","800ร้อยล้าน",},
        [44] = {44,"โจจู๋","900ร้อยล้าน",},
        [45] = {45,"โจโฉ","1000ร้อยล้าน",},
        [46] = {46,"จูกัดเหลียง","1100ร้อยล้าน",},
        [47] = {47,"จิวยี่","1200ร้อยล้าน",},
        [48] = {48,"ลิโป้","1300ร้อยล้าน",},
    }
}

return equip_essence_stage