--explore

local explore = {
    -- key
    __key_map = {
      id = 1,    --章节-int 
      name = 2,    --章节名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"สวนท้อ",},
        [2] = {2,"ซีจิ๋ว",},
        [3] = {3,"ด่านเฮาโลก๋วน",},
        [4] = {4,"ทุ่งราบอู่จั้ง",},
        [5] = {5,"ด่านประตูหยก",},
        [6] = {6,"ทะเลสาบโป๋หยาง",},
        [7] = {7,"เนินมังกรหลับ",},
        [8] = {8,"ผาแดง",},
        [9] = {9,"อัวเจ๋า",},
        [10] = {10,"ฮูโต๋",},
        [11] = {11,"เสียงสาน",},
        [12] = {12,"ซินเอี้ย",},
        [13] = {13,"ซีหลง",},
        [14] = {14,"แห้ฝือ",},
        [15] = {15,"อ้วนเซีย",},
        [16] = {16,"แม่น้ำผาน",},
        [17] = {17,"ตันลิว",},
        [18] = {18,"ลกเอี๋ยง",},
        [19] = {19,"กิสาน",},
        [20] = {20,"เนินเตียวปันโป๋",},
        [21] = {21,"อิวจิ๋ว",},
        [22] = {22,"เกเต๋ง",},
        [23] = {23,"เป๊กเต้",},
        [24] = {24,"กัวต๋อ",},
    }
}

return explore