--explore_discover

local explore_discover = {
    -- key
    __key_map = {
      id = 1,    --奇遇类型-int 
      name = 2,    --奇遇事件-泰语-string 
      description = 3,    --文本描述-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ห้องเรียนสุ่ยจิ้ง","",},
        [2] = {2,"มินิเกม","",},
        [3] = {3,"มินิเกม","",},
        [4] = {4,"ชื่นชม","ได้ยินว่านายท่านรับสมัครปราชญ์คนเก่งที่มีใจเป็นห่วงบ้านเมือง!มาเข้าร่วม!",},
        [5] = {5,"ทรัพยากรครึ่งราคา","นายท่านพวกนี้เป็นทรัพยากที่แอบลักลอบนำเข้ามาขอเพียงนายท่านยินดีข้าก็จะขายพวกเขาครึ่งราคา!",},
        [6] = {6,"ศึกลกเอี๋ยง","ตั๋งโต๊ะจับฮั่นเหี้ยนเต้เล่าเหียบไปทางตะวันตกเมืองเตียงฮันและกวาดต้อนชาวบ้านนับล้านของลกเอี๋ยงให้เดินทางไปเตียงฮัน\nก่อนออกเดินทางกองทัพเสเหลียงได้เผาปล้นสดมภ์ชาวบ้านรอบลกเอี๋ยงสองร้อยลี้บ้านแตกสาแหรกขาด",},
        [7] = {7,"ภัยศึกตั๋งโต๊ะ","แสวงหาอำนาจสาวงามเตียวเสี้ยนจับโอรสสวรรค์บัญชาเจ้าเมืองใครจะทำอะไรข้าได้?",},
        [8] = {8,"หีบสมบัติลับ","หีบสมบัติลับนี้คือผลงานของช่างยุคเซี่ยซางสร้างอย่างเหนื่อยยากนายท่านคอยซักครู่",},
        [9] = {11,"รางวัลรูปพเนจร_สมบัติสีฟ้า","",},
        [10] = {12,"รางวัลรูปพเนจร_เศษสมบัติสีม่วง","",},
        [11] = {13,"รางวัลรูปพเนจร_สมบัติครบชิ้นสีม่วง","",},
        [12] = {14,"รางวัลรูปพเนจร_เศษสมบัติสีส้ม","",},
        [13] = {15,"รางวัลรูปพเนจร_สมบัติครบชิ้นสีส้ม","",},
    }
}

return explore_discover