--festival_res

local festival_res = {
    -- key
    __key_map = {
      id = 1,    --排序id_key-int 
      res_name = 2,    --资源名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เทศกาลฉลอง-เลิก",},
        [2] = {2,"เทศกาลฉลอง-เลิก",},
        [3] = {3,"ขุนพล-เลิก",},
        [4] = {4,"อุปกรณ์-เลิก",},
        [5] = {5,"สมบัติ-เลิก",},
        [6] = {6,"ศาสตรา-เลิก",},
        [7] = {7,"สมบัติ-เลิก",},
        [8] = {8,"อธิบาย-ใช้ทั่วไป",},
        [9] = {9,"อธิบาย-ฤดูใบไม้ร่วง, วันชาติจีน",},
        [10] = {10,"อธิบาย-ชีซี",},
        [11] = {11,"อธิบาย-วันคนโสด",},
        [12] = {12,"เทศกาลฉลอง-ใช้ทั่วไป",},
        [13] = {13,"เทศกาลฉลอง-ชีซี",},
        [14] = {14,"เทศกาลฉลอง-ฤดูใบไม้ร่วง",},
        [15] = {15,"เทศกาลฉลอง-วันชาติจีน",},
        [16] = {16,"เทศกาลฉลอง-วันคนโสด",},
        [17] = {17,"เทศกาลฉลอง-รวมเซิร์ฟ",},
        [18] = {18,"เทศกาลฉลอง-วัน1212",},
        [19] = {19,"เทศกาลฉลอง-คริสต์มาส",},
        [20] = {20,"เทศกาลฉลอง-ปีใหม่",},
        [21] = {21,"อธิบาย-คริสต์มาส",},
        [22] = {22,"อธิบาย-ปีใหม่",},
        [23] = {23,"เทศกาลฉลอง-ตรุษจีน",},
        [24] = {24,"อธิบาย-ตรุษจีน",},
        [25] = {25,"เทศกาลฉลอง-เทศกาลโคมไฟ",},
        [26] = {26,"อธิบาย-เทศกาลโคมไฟ",},
        [27] = {27,"อธิบาย-ใช้ทั่วไป",},
        [28] = {28,"เทศกาลฉลอง-ใช้ทั่วไป",},
        [29] = {29,"เทศกาลฉลอง-เชงเม้ง",},
        [30] = {30,"อธิบาย-เชงเม้ง",},
        [31] = {31,"เทศกาลฉลอง-วันแรงงาน",},
        [32] = {32,"อธิบาย-วันแรงงาน",},
        [33] = {40,"เทศกาลฉลอง-ใช้ทั่วไป",},
        [34] = {41,"อธิบาย-ใช้ทั่วไป",},
        [35] = {35,"เทศกาลฉลอง-เวอร์ชั่นใหม่ชีซี",},
        [36] = {36,"อธิบาย-เวอร์ชั่นใหม่ชีซี",},
        [37] = {37,"",},
        [38] = {38,"",},
        [39] = {39,"",},
        [40] = {42,"",},
        [41] = {43,"",},
        [42] = {44,"",},
        [43] = {45,"",},
        [44] = {46,"",},
        [45] = {47,"",},
        [46] = {48,"",},
        [47] = {49,"",},
        [48] = {50,"",},
        [49] = {51,"เทศกาลฉลอง-ตรุษจีน",},
        [50] = {52,"",},
    }
}

return festival_res