--function_preview

local function_preview = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      text = 2,    --文本描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Lv.#level#เปิดรับสมัครสามารถเปิดใช้สมุดขุนพลออกรบได้พลังรบจะเพิ่มขึ้นจำนวนมาก!",},
        [2] = {2,"Lv.#level#สามารถสวมใส่อุปกรณ์ได้อุปกรณ์ขั้นต้นสามารถได้รับจากดันเจี้ยนสายหลัก!",},
        [3] = {3,"Lv.#level#เปิดตำแหน่งค่ายที่4สามารถออกรบขุนพลคนที่4ได้!",},
        [4] = {4,"Lv.#level# เปิดสนามประลอง ท้ารบจะได้รับตำลึงจำนวนมาก อันดับยิ่งสูงรางวัลยิ่งเยอะ!",},
        [5] = {5,"Lv.#level#เปิดระบบพเนจรพเนจรในดินแดนเสินโจวกระตุ้นสิ่งอัศจรรย์จะได้รับสมบัติ!",},
        [6] = {6,"บรรลุ Lv.#level# ตัวเอกและขุนพล สามารถทะลวง+2 ทะลวงแต่ละครั้งจะเพิ่มพลังรบจำนวนมาก!",},
        [7] = {8,"Lv.#level#เปิดตำแหน่งค่ายที่5สามารถออกรบขุนพลคนที่5ได้!",},
        [8] = {9,"Lv.#level#เปิดยศขุนนางเลื่อนชั้นยศขุนนางแย่งชิงสุดยอดเกียรติยศ!",},
        [9] = {10,"Lv.#level#เปิดท้ารบยอดขุนพลแห่งยุคแย่งชิงแก่นอุปกรณ์อุปกรณ์เทพรอเจ้าอยู่นะ!",},
        [10] = {11,"Lv.#level#เปิดดันเจี้ยนรายวันทรัพยากรมหาศาลรับได้ทุกวัน!",},
        [11] = {12,"Lv.#level#เปิดกองทัพตีBOSSกองทัพรับเงินปันผลตำลึงจำนวนมาก!",},
        [12] = {13,"บรรลุ Lv.#level# ตัวเอกและขุนพล สามารถทะลวง+3!",},
        [13] = {14,"Lv.#level#เปิดตำแหน่งค่ายที่6สามารถออกรบขุนพลคนที่6ได้!",},
        [14] = {15,"Lv.#level#เปิดลาดตระเวนฐานทัพส่งขุนพลลาดตระเวนเหมืองได้รับทรัพยากรมหาศาลและยังมีโอกาสได้พบกับขุนพลอีกด้วย!",},
        [15] = {16,"Lv.#level#เปิดทหารสนับสนุนรับสมัครขุนพลออกรบช่วยสนับสนุนเปิดใช้พันธนาการรับโบนัสพลังรบจำนวนมาก!",},
        [16] = {17,"บรรลุ Lv.#level# ตัวเอกและขุนพล สามารถทะลวง+4!",},
        [17] = {18,"Lv.#level#เปิดสกัดอุปกรณ์สกัดอุปกรณ์สามารถเพิ่มพลังรบได้จำนวนมากอย่าลืมรวบรวมหินสกัดให้มากๆนะ!",},
        [18] = {19,"Lv.#level#เปิดดันเจี้ยนยอดขุนพลตำลึงมหาศาลจิตขุนพลรอเจ้าอยู่!",},
        [19] = {20,"Lv.#level#เปิดหนานหมานบุกรุกท้ารบศิษย์ชั่วอำมหิตได้รับอาวุธศาสตรา!",},
        [20] = {21,"Lv.#level#เปิดสกัดสมบัตินายท่านอย่าลืมซื้อหินสกัดสมบัติเยอะๆนะ!",},
        [21] = {22,"Lv.#level#เปิดปลุกขุนพลปลุกขุนพลสามารถเพิ่มสเตตัสพื้นฐานขุนพลได้จำนวนมาก!",},
        [22] = {23,"Lv.#level# เปิดระบบถุง ติดตั้งถุงเพิ่มสเตตัสพิเศษขุนพลจำนวนมาก การเล่นเปลี่ยนแปลงมากขึ้นนะ!",},
        [23] = {24,"Lv.#level# เปิดการ์ดแปลงร่าง สามารถเปลี่ยนตัวเอกได้อย่างอิสระ จัดระเบียบค่ายตามใจชอบ เล่นสนุกมากขึ้น!",},
        [24] = {25,"Lv.#level#เปิดฟังก์ชั่นอสูรเทพสัตว์น่ารักอยู่ในมือข้ามีทั่วโลก!",},
        [25] = {26,"Lv.#level#เปิดการแทนที่ขุนพลสามารถแทนที่ขุนพลสีส้มสีแดงได้จัดกระบวนทัพตามใจชอบ!",},
        [26] = {27,"Lv.#level#เปิดทะลวงขีดจำกัดขุนพลสีส้มเปลี่ยนชะตาชีวิตระเบิดความแข็งแกร่ง!",},
        [27] = {28,"Lv.#level#เปิดการฝังหินหยกสเตตัสอุปกรณ์เหมือนเสือติดปีกพลังรบก้าวหน้าไปอีกขั้น!",},
    }
}

return function_preview