--gemstone

local gemstone = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --名称-string 
      bag_description = 3,    --背包描述-string 
      description = 4,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"ผลึกเขียวโจมตี","อัญมณีผลึกเจิดจรัสสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีเขียวสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [2] = {102,"ผลึกเขียวป้องกัน","อัญมณีผลึกเจิดจรัสสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีเขียวสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [3] = {103,"ผลึกเขียวHP","อัญมณีผลึกเจิดจรัสสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีเขียวสีเขียวสดใสทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [4] = {104,"ม้วนเขียวปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีเขียวมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีเขียวได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [5] = {201,"ผลึกฟ้าโจมตี","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [6] = {202,"ผลึกฟ้าป้องกัน","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [7] = {203,"ผลึกฟ้าHP","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [8] = {204,"ม้วนฟ้าปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีฟ้ามีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีฟ้าได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [9] = {301,"ลึกไห่หนานโจมตี","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [10] = {302,"ผลึกไห่หนานป้องกัน","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [11] = {303,"ผลึกไห่หนานHP","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีผลึกเจิดจรัสสีฟ้าครามทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [12] = {304,"ม้วนครามปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีฟ้ามีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีฟ้าได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [13] = {401,"ผลึกม่วงโจมตี","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [14] = {402,"ผลึกม่วงป้องกัน","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [15] = {403,"ผลึกม่วงHP","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [16] = {404,"ม้วนม่วงปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [17] = {501,"ผลึกม่วงจรัสโจมตี","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [18] = {502,"ผลึกม่วงจรัสป้องกัน","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [19] = {503,"ผลึกม่วงจรัสHP","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [20] = {504,"ม้วนม่วงจรัสปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [21] = {601,"ผลึกดาวโจมตี","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [22] = {602,"ผลึกดาวป้องกัน","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [23] = {603,"ผลึกดาวHP","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย","อัญมณีสีม่วงขั้นสูงจับแล้วรู้สึกเย็นสบาย",},
        [24] = {604,"ม้วนดาวปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีม่วงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [25] = {701,"ผลึกเหลืองโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [26] = {702,"ผลึกเหลืองป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [27] = {703,"ผลึกเหลืองHP","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [28] = {704,"ม้วนเหลืองปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [29] = {801,"ผลึกมังกรโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [30] = {802,"ผลึกมังกรป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [31] = {803,"ผลึกมังกรHP","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [32] = {804,"ม้วนมังกรปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [33] = {901,"ผลึกตะวันโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [34] = {902,"ผลึกตะวันป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [35] = {903,"ผลึกตะวันHP","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [36] = {904,"ม้วนตะวันปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [37] = {1001,"ผลึกเจิดจรัสโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [38] = {1002,"ผลึกเจิดจรัสป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [39] = {1003,"ผลึกเจิดจรัสHP","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีส้มทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [40] = {1004,"ม้วนเจิดจรัสปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีส้มได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [41] = {1101,"ผลึกแดงโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [42] = {1102,"ผลึกแดงป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [43] = {1103,"ผลึกแดงHP","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [44] = {1104,"ม้วนแดงปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [45] = {1201,"ผลึกไฟโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [46] = {1202,"ผลึกไฟป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [47] = {1203,"ผลึกไฟHP","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [48] = {1204,"ม้วนไฟปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [49] = {1301,"ผลึกโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [50] = {1302,"ผลึกเลือดป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [51] = {1303,"ผลึกเลือดHP","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [52] = {1304,"ม้วนเลือดปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
        [53] = {1401,"ผลึกสว่างโจมตี","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [54] = {1402,"ผลึกสว่างป้องกัน","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [55] = {1403,"ผลึกสว่างHP","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย","อัญมณีขั้นสูงสุดเปล่งแสงสีแดงทั่วร่างจับแล้วรู้สึกเย็นสบาย",},
        [56] = {1404,"ม้วนสว่างปลุก","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ","ม้วนดั้งเดิมที่กำเนิดอัญมณีสีแดงได้ยินว่ามีอำนาจมากมีพลังงานที่น่าเหลือเชื่อ",},
    }
}

return gemstone