--gold_hero_train

local gold_hero_train = {
    -- key
    __key_map = {
      limit_level = 1,    --养成等级-int 
      name_1 = 2,    --材料1名称-string 
      name_2 = 3,    --材料2名称-string 
      name_3 = 4,    --材料3名称-string 
      name_4 = 5,    --材料4名称-string 
      break_name = 6,    --突破消耗名称-string 
    
    },
    -- data
    _data = {
        [1] = {0,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
        [2] = {1,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
        [3] = {2,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
        [4] = {3,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
        [5] = {4,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
        [6] = {5,"วัน","ปกครองบ้าน","ฝึกตน","สงบแผ่นดิน","เงินทอง",},
    }
}

return gold_hero_train