--guild_cross_war

local guild_cross_war = {
    -- key
    __key_map = {
      id = 1,    --索引id-int 
      point_name = 2,    --据点名字-string 
      name = 3,    --BOSS名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [2] = {2,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [3] = {3,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [4] = {4,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [5] = {5,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [6] = {6,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [7] = {7,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [8] = {8,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [9] = {9,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [10] = {10,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [11] = {11,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [12] = {12,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [13] = {13,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [14] = {14,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [15] = {15,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [16] = {16,"ฐานทัพค่ายทหาร","วิญญาณโจรผ้าเหลือง",},
        [17] = {17,"เฉงจิ๋ว","",},
        [18] = {18,"ซีจิ๋ว","",},
        [19] = {19,"หยางโจว","",},
        [20] = {20,"เกงจิ๋ว","",},
        [21] = {21,"เอ็กจิ๋ว","",},
        [22] = {22,"เลียงจิ๋ว","",},
        [23] = {23,"เป๊งจิ๋ว","",},
        [24] = {24,"อิวจิ๋ว","",},
        [25] = {25,"เซียงจิ๋ว","",},
    }
}

return guild_cross_war