--guild_boss_info

local guild_boss_info = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      city_name = 2,    --城池名称-泰语-string 
      name = 3,    --名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"กุนจิ๋ว","ฮัวหยง",},
        [2] = {2,"ซีจิ๋ว","กองซุนจ้าน",},
        [3] = {3,"ซีเฉิง","บังทอง",},
        [4] = {4,"เกเต๋ง","ชีซี",},
        [5] = {5,"แฮเค้า","กำเหลง",},
        [6] = {6,"ปากสามแม่น้ำ","ลิบอง",},
        [7] = {7,"ซองเต๋ง","โจหยิน",},
        [8] = {8,"อัวเจ๋า","เตียวคับ",},
        [9] = {9,"","โจโฉ",},
        [10] = {10,"","จูกัดเหลียง",},
        [11] = {11,"","จิวยี่",},
        [12] = {12,"","ลิโป้",},
    }
}

return guild_boss_info