--guild_news

local guild_news = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      news = 2,    --描述-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"#name#เพิ่มเข้ากองทัพ",},
        [2] = {2,"#name#ถูกเตะออกกองทัพ",},
        [3] = {3,"#name#ออกกองทัพแล้ว",},
        [4] = {4,"#name#ถูกแต่งตั้งเป็น#position#, ทุกคนต่างเชียร์ร้อง",},
        [5] = {5,"#name#ถูกปลดออกจากตำแหน่ง#position#",},
        [6] = {6,"#name#เนื่องจากไม่สร้างผลงานเป็นเวลานานในที่สุดก็ถูกถอดถอน",},
        [7] = {7,"#name#ทำศึกอย่างกล้าหาญในที่สุดก็ผ่านด่าน#stage#ทุกคนรีบไปชิงคลังสมบัติเร็ว",},
        [8] = {8,"#name#ช่วยอย่างใจกว้างทำการ#id#เพิ่มชื่อเสียงให้กองทัพ#prestige#",},
        [9] = {9,"#name#ทำภารกิจสนับสนุนกองทัพสำเร็จแล้วเพิ่มชื่อเสียงให้กองทัพ#prestige#",},
    }
}

return guild_news