--guild_war_city

local guild_war_city = {
    -- key
    __key_map = {
      id = 1,    --城池id-int 
      name = 2,    --城池名字-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ด่านเฮาโลก๋วน",},
        [2] = {2,"ด่านหานกู่",},
        [3] = {3,"หอกระบี่",},
        [4] = {4,"เซียวเหยาจิน",},
        [5] = {5,"ด่านเยี่ยนเหมินกวน",},
        [6] = {6,"ด่านภูผานที",},
        [7] = {7,"ด่านเองเปงก๋วน",},
        [8] = {8,"ด่าน7ดาว",},
        [9] = {9,"อี๋หลิง",},
        [10] = {10,"กังเหลง",},
    }
}

return guild_war_city