--guild_war

local guild_war = {
    -- key
    __key_map = {
      id = 1,    --索引id-int 
      name = 2,    --据点名字-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ค่ายทหารบุกเมือง",},
        [2] = {2,"ชัยภูมิเหนือ1",},
        [3] = {3,"ชัยภูมิใต้1",},
        [4] = {4,"ชัยภูมิเหนือ2",},
        [5] = {5,"ชัยภูมิใต้2",},
        [6] = {6,"ประตูเมือง",},
        [7] = {7,"เสามังกร",},
        [8] = {8,"ในเมืองเหนือ",},
        [9] = {9,"ในเมืองใต้",},
        [10] = {10,"ค่ายทหารเฝ้าเมือง",},
        [11] = {11,"ไปโจมตีเมือง",},
        [12] = {12,"ค่ายทหารบุกเมือง",},
        [13] = {13,"ค่ายทหารบุกเมือง",},
        [14] = {14,"ชัยภูมิเหนือ1",},
        [15] = {15,"ชัยภูมิใต้1",},
        [16] = {16,"ชัยภูมิเหนือ2",},
        [17] = {17,"ชัยภูมิกลาง2",},
        [18] = {18,"ชัยภูมิใต้2",},
        [19] = {19,"ประตูเมืองภาคเหนือ",},
        [20] = {20,"ประตูเมืองภาคใต้",},
        [21] = {21,"เมืองในตกเฉียงเหนือ",},
        [22] = {22,"เมืองในตกเฉียงใต้",},
        [23] = {23,"เสามังกร",},
        [24] = {24,"เมืองในออกเฉียงเหนือ",},
        [25] = {25,"ค่ายทหารเฝ้าเมือง",},
        [26] = {26,"กลับเมืองป้องกัน",},
        [27] = {27,"กลับเมืองป้องกัน",},
        [28] = {28,"ไปโจมตีเมือง",},
        [29] = {29,"เมืองในออกเฉียงใต้",},
        [30] = {30,"ค่ายทหารบุกเมือง",},
        [31] = {31,"ค่ายทหารบุกเมือง",},
        [32] = {32,"ค่ายทหารบุกเมือง",},
        [33] = {33,"ชัยภูมิเหนือ1",},
        [34] = {34,"ชัยภูมิกลาง1",},
        [35] = {35,"ชัยภูมิใต้1",},
        [36] = {36,"ชัยภูมิเหนือ2",},
        [37] = {37,"ชัยภูมิใต้2",},
        [38] = {38,"ชัยภูมิเหนือ3",},
        [39] = {39,"ชัยภูมิใต้3",},
        [40] = {40,"ประตูเมืองเหนือ",},
        [41] = {41,"ประตูเมืองกลาง",},
        [42] = {42,"ประตูเมืองใต้",},
        [43] = {43,"เมืองในตกเฉียงเหนือ",},
        [44] = {44,"เมืองในตกเฉียงใต้",},
        [45] = {45,"เสามังกร",},
        [46] = {46,"เมืองในออกเฉียงเหนือ",},
        [47] = {47,"เมืองในออกเฉียงใต้",},
        [48] = {48,"ค่ายทหารเฝ้าเมือง",},
        [49] = {49,"กลับไปป้องกัน",},
        [50] = {50,"กลับไปป้องกัน",},
        [51] = {51,"กลับไปป้องกัน",},
        [52] = {52,"เมืองในตะวันตก",},
        [53] = {53,"เมืองในตะวันออก",},
    }
}

return guild_war