--guild_support_talks

local guild_support_talks = {
    -- key
    __key_map = {
      id = 1,    --说话id-int 
      talks = 2,    --援助看板娘随机说话文本，每次进入界面或者点击立绘头像随机播放文字-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ยังมีมีกองทัพช่วยเหลือหรอ?รีบไปขอกองหนุนเร็ว!",},
        [2] = {2,"ขอความช่วยเหลือทุกวันจะได้รับเศษขุนพลสีแดง3ชิ้น!",},
        [3] = {3,"ขอความช่วยเหลือทุกวันจะได้รับเศษขุนพลสีม่วง5ชิ้น!",},
        [4] = {4,"ขอความช่วยเหลือทุกวันจะได้รับเศษขุนพลสีส้ม4ชิ้นล่ะ!",},
        [5] = {5,"ยังขอกองหนุนไม่สำเร็จ?รีบไปเรียกกองทัพสิ!",},
        [6] = {6,"เศษขุนพลที่เกินสามารถมอบให้สมาชิกกองทัพเดียวกันได้!",},
        [7] = {7,"มอบเศษขุนพลจะได้รับอุทิศกองทัพ",},
        [8] = {8,"ขอความช่วยเหลือสำเร็จ3ครั้งจะได้รับรางวัลที่ตั้งใจเตรียมไว้!",},
    }
}

return guild_support_talks