--guild_build_postion

local guild_build_postion = {
    -- key
    __key_map = {
      id = 1,    --建筑id-int 
      name = 2,    --建筑名称-泰语-string 
      name_postion_x = 3,    --标题X坐标-int 
      name_postion_y = 4,    --标题Y坐标-int 
    
    },
    -- data
    _data = {
        [1] = {1,"ตำหนักใหญ่กองทัพ",1280,720,},
        [2] = {2,"ช่วยสนับสนุนกองทัพ",670,506,},
        [3] = {3,"ร้านกองทัพ",970,680,},
        [4] = {4,"ศาลา",1038,807,},
        [5] = {5,"BOSSกองทัพ",1000,510,},
        [6] = {6,"บริจาคกองทัพ",1300,484,},
        [7] = {7,"ค่ายยุทธโธปกรณ์ทหาร",1144,361,},
        [8] = {8,"ทดสอบกองทัพ",508,652,},
        [9] = {9,"ประตูเมืองตะวันออก",1436,431,},
        [10] = {10,"ศึกกองทัพ",1750,435,},
    }
}

return guild_build_postion