--guild_stage_atk_reward

local guild_stage_atk_reward = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --名称-泰文-string 
    
    },
    -- data
    _data = {
        [1] = {1,"แม่ทัพใหญ่",},
        [2] = {2,"แม่ทัพรถม้า",},
        [3] = {3,"แม่ทัพอาชา",},
        [4] = {4,"แม่ทัพกองปีก",},
        [5] = {5,"แม่ทัพขี่มังกร",},
        [6] = {6,"แม่ทัพฮึกเหิม",},
        [7] = {7,"แม่ทัพหาญกล้า",},
        [8] = {8,"ทหารหาญ",},
        [9] = {9,"แม่ทัพปราบกบฏ",},
        [10] = {10,"แม่ทัพพิชิตเชลย",},
        [11] = {11,"แม่ทัพปราบตะวันออก",},
        [12] = {12,"แม่ทัพปราบแดนใต้",},
        [13] = {13,"แม่ทัพปราบตะวันตก",},
        [14] = {14,"แม่ทัพปราบแดนเหนือ",},
        [15] = {15,"แม่ทัพปกครองทหาร",},
        [16] = {16,"แม่ทัพปราบโจม",},
        [17] = {17,"แม่ทัพปราบเชลย",},
        [18] = {18,"แม่ทัพบารมีไกล",},
        [19] = {19,"แม่ทัพเกรียงไกร",},
        [20] = {20,"แม่ทัพศาลากลาง",},
        [21] = {21,"แม่ทัพอิทธิพล",},
        [22] = {22,"แม่ทัพปกป้อง",},
        [23] = {23,"แม่ทัพปราบชนเผ่า",},
        [24] = {24,"แม่ทัพข่มเชลย",},
        [25] = {25,"แม่ทัพกึกก้อง",},
        [26] = {26,"แม่ทัพเรืองฤทธิ์",},
        [27] = {27,"ทหารเจิ้น",},
        [28] = {28,"แม่ทัพอินทรีย์",},
        [29] = {29,"แม่ทัพข้าง",},
        [30] = {30,"ทหารหยาง",},
        [31] = {31,"แม่ทัพดักรถเสบียง",},
        [32] = {32,"แม่ทัพปีกพยัคฆ์",},
        [33] = {33,"แม่ทัพรอง",},
        [34] = {34,"แม่ทัพป่าเถื่อน",},
        [35] = {35,"แม่ทัพธารา",},
        [36] = {36,"ทหารเจี้ยน",},
        [37] = {37,"แม่ทัพคลื่นซุ่ม",},
        [38] = {38,"แม่ทัพบารมีพยัคฆ์",},
        [39] = {39,"แม่ทัพพยัคฆ์ดุ",},
        [40] = {40,"เจ้าเมืองโท",},
    }
}

return guild_stage_atk_reward