--guild_stage_talk

local guild_stage_talk = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      talk1 = 2,    --说话1-泰语-string 
      talk2 = 3,    --说话2-泰语-string 
      talk3 = 4,    --说话3-泰语-string 
      talk4 = 5,    --说话4-泰语-string 
      talk5 = 6,    --说话5-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ไม่ใช่……อย่าเข้าใจผิดข้าไม่ได้เพ่งเล็งเจ้า","ข้าบอกว่าทุกคนที่นี่……เป็นแค่เศษสวะ","ข้าต่อยหมัดนี้ออกไปเจ้าต้องตายแน่!","คนอ่อนแอใยต้องต่อสู้?!","ข้าใช้แค่นิ้วเดียวก็ฆ่าเจ้าได้แล้ว!",},
        [2] = {2,"ไหลตามน้ำไปลอบโจมตีศัตรู!","เจ้าคือคู่ต่อสู้ที่น่านับถือ!","คู่ต่อสู้ที่ฝีมือสูสีข้าชอบนัก!","วันนี้คือวันสุดท้ายของกองทัพพวกเจ้า!","อย่าหนี!วันนี้จะต่อสู้กับเจ้าซัก300รอบ!",},
        [3] = {3,"ข้าไม่เคยเจอคนที่หน้าด้านขนาดเจ้ามาก่อน!","ท่านแม่ทัพอภัยให้ด้วยข้าน้อยยังมีพ่อแม่ชราและลูกเล็ก!","ไม่หาคู่ต่อสู้ที่ฝีมือสูสีหรอ?","สีข้ามีประโยชน์อะไรกับเจ้า!","ข้าแนะนำให้เจ้าไปหาคนเหนือกว่าข้า!",},
    }
}

return guild_stage_talk