--head_frame

local head_frame = {
    -- key
    __key_map = {
      id = 1,    --序号-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {1,"ปลดล็อกกรอบรูป","",1,},
        [2] = {2,"กรอบรูปรัก","เช็คชื่อสะสมถึง365วันจะได้รับ",1,},
        [3] = {3,"กรอบรูปเหนือ","เข้าร่วมBOSSกองทัพสะสม99ครั้ง",1,},
        [4] = {4,"กรอบรูปเก่ง","เข้าร่วมตอบคำถามกองทัพสะสม50ครั้งได้รับ",1,},
        [5] = {5,"กรอบรูปเลิศ","เข้าร่วมทดสอบกองทัพสะสม50ครั้งได้รับ",1,},
        [6] = {6,"กรอบรูปกล้า","เข้าร่วมศึกสามก๊กสะสม 20 ครั้งได้รับ",1,},
        [7] = {7,"กรอบรูปชนะ","เข้าร่วมศึกกองทัพสะสม20ครั้งได้รับ",1,},
        [8] = {8,"กรอบรูปผู้ดี","เฉพาะชนชั้นสูง3",1,},
        [9] = {9,"กรอบรูปดัง","เฉพาะชนชั้นสูง7",1,},
        [10] = {10,"กรอบรูปรวย","เฉพาะชนชั้นสูง12",1,},
        [11] = {11,"กรอบรูปทอง","เฉพาะชนชั้นสูง13",1,},
        [12] = {12,"กรอบรูปหยก","เฉพาะชนชั้นสูง14",1,},
        [13] = {13,"กรอบรูปสูงส่ง","เฉพาะชนชั้นสูง15",1,},
        [14] = {14,"กรอบรูปมังกร","เฉพาะชนชั้นสูง16",1,},
        [15] = {15,"กรอบรูปครบ1ปี","จำกัดเวลากิจกรรมครบรอบ1ปีจะได้รับ",0,},
        [16] = {16,"กรอบรูปสำเร็จ","ฉายาจำกัดเฉพาะกิจกรรมเค้ก",1,},
        [17] = {17,"กรอบรูปผลงาน","ฉายาจำกัดเฉพาะกิจกรรมเค้ก",1,},
        [18] = {18,"กรอบรูปเยี่ยม","ฉายาจำกัดเฉพาะกิจกรรมเค้ก",1,},
        [19] = {19,"กรอบรูปคบหา","จำกัดเวลากิจกรรมพบมังกรในทุ่งได้รับ",0,},
        [20] = {20,"กรอบรูปซ่อน","จำกัดเวลากิจกรรมพบมังกรในทุ่งได้รับ",0,},
        [21] = {21,"กรอบรูปพบมังกร","จำกัดเวลากิจกรรมพบมังกรในทุ่งได้รับ",0,},
    }
}

return head_frame