--historical_hero_arm

local historical_hero_arm = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --名称-string 
    
    },
    -- data
    _data = {
        [1] = {101,"อาวุธเกาเจี้ยนหลี",},
        [2] = {102,"อาวุธจิงเคอ",},
        [3] = {103,"อาวุธหานซิ่น",},
        [4] = {104,"อาวุธจางเหลียง",},
        [5] = {201,"อาวุธจิ๋นซีฮ่องเต้",},
        [6] = {202,"อาวุธฮั่นอู่ตี้",},
        [7] = {203,"อาวุธเซี่ยงอวี่",},
        [8] = {204,"อาวุธหยูจี",},
    }
}

return historical_hero_arm