--historical_hero

local historical_hero = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --名称-string 
      description = 3,    --描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"เกาเจี้ยนหลี","เกาเจี้ยนหลี",},
        [2] = {102,"จิงเคอ","จิงเคอ",},
        [3] = {103,"หานซิ่น","หานซิ่น",},
        [4] = {104,"จางเหลียง","จางเหลียง",},
        [5] = {201,"จิ๋นซีฮ่องเต้","จิ๋นซีฮ่องเต้",},
        [6] = {202,"ฮั่นอู่ตี้","ฮั่นอู่ตี้",},
        [7] = {203,"เซี่ยงอวี่","เซี่ยงอวี่",},
        [8] = {204,"หยูจี","หยูจี",},
    }
}

return historical_hero