--horse_tu_res

local horse_tu_res = {
    -- key
    __key_map = {
      id = 1,    --道具id-int 
      index = 2,    --层次-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"จุดเริ่ม",},
        [2] = {2,"จุดท้าย",},
        [3] = {3,"อุปสรรค",},
        [4] = {4,"อุปสรรค",},
        [5] = {5,"ลู้",},
        [6] = {6,"ลู้",},
        [7] = {7,"ลู้",},
        [8] = {8,"เหรียญทอง",},
        [9] = {9,"เหรียญทอง",},
        [10] = {10,"ลู้",},
        [11] = {11,"ลู้",},
        [12] = {12,"ลู้",},
        [13] = {13,"ลู้",},
        [14] = {21,"ลู้",},
        [15] = {22,"ลู้",},
        [16] = {23,"ลู้",},
        [17] = {24,"ลู้",},
        [18] = {25,"ลู้",},
        [19] = {26,"ลู้",},
        [20] = {27,"ลู้",},
        [21] = {28,"ลู้",},
        [22] = {29,"ลู้",},
        [23] = {30,"ลู้",},
        [24] = {31,"ลู้",},
        [25] = {32,"ลู้",},
        [26] = {33,"ลู้",},
        [27] = {34,"ลู้",},
        [28] = {35,"ลู้",},
        [29] = {36,"ลู้",},
        [30] = {37,"ลู้",},
        [31] = {38,"ลู้",},
        [32] = {39,"ลู้",},
        [33] = {40,"ลู้",},
        [34] = {41,"ลู้",},
        [35] = {42,"ลู้",},
        [36] = {43,"ลู้",},
        [37] = {61,"วิวกลาง",},
        [38] = {62,"วิวกลาง",},
        [39] = {63,"ภูเขาวิวไกล",},
        [40] = {64,"วิวกลาง",},
        [41] = {65,"วิวกลาง",},
        [42] = {66,"วิวกลาง",},
        [43] = {67,"วิวกลาง",},
        [44] = {68,"วิวกลาง",},
        [45] = {69,"ภูเขาวิวไกล",},
        [46] = {70,"จุดเริ่ม-ฉากก่อน",},
        [47] = {71,"อวิ๋น",},
        [48] = {72,"อวิ๋น",},
        [49] = {73,"อวิ๋น",},
        [50] = {74,"วิวกลาง",},
        [51] = {75,"จุดท้าย-ฉากก่อน",},
    }
}

return horse_tu_res