--horse_equipment

local horse_equipment = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-string 
      description = 3,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"อานม้าหยกขาว","อานม้าที่ทำจากหยกขาวล้ำค่ามาก",},
        [2] = {102,"โกลนม้าทองม่วง","โกลนม้าที่ฝังด้วยทองม่วงดูงามสง่า",},
        [3] = {103,"เชือกห่วงเงิน","เลือกที่ทำจากไหมน้ำเงินเงาวาววับ",},
        [4] = {201,"อานทะเลมรกต","ว่ากันว่ามีวิญญาณมังกรน้ำสิงอยู่คุ้มครองให้ออกรบชนะตลอด",},
        [5] = {202,"โกลนหมาป่า","โกลนม้าที่มีจิตหมาป่าคุ้มครองคอยพิทักษ์เจ้านายอยู่เงียบๆ",},
        [6] = {203,"เชือกม้าอสรพิษ","เชือกที่อาบลมหายใจงูเถิงเมื่อขี่จะเหมือนบินอยู่บนเมฆ",},
    }
}

return horse_equipment