--horse_group

local horse_group = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --图鉴名称-string 
      show_day = 3,    --达到开服天数显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"เงาเขียว",1,},
        [2] = {2,"ขยี้พุทรา",1,},
        [3] = {3,"ราตรีขาว",1,},
        [4] = {4,"มรกตเปื้อนป่าแดง",1,},
        [5] = {5,"บินหิมะขาว",1,},
        [6] = {6,"กำเนิดผาเมฆาม่าวง",1,},
        [7] = {7,"ควันแดงไขหยก",1,},
        [8] = {8,"เงามรกตส่องจันทร์",1,},
        [9] = {11,"หินอัคคีแสงสายฟ้า",999,},
        [10] = {9,"เป่าหิมะ",1,},
        [11] = {10,"ราตรีเพลิง",1,},
    }
}

return horse_group