--horse_star

local horse_star = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-string 
      skill = 3,    --技能描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ม้าชิงจุย","[ม้าชิงจุย]โบนัสโจมตีขุนพลขี่พาหนะ+1%",},
        [2] = {1,"ไล่วายุ·ม้าชิงจุย","[ไล่วายุ·ม้าชิงจุย]โบนัสโจมตีขุนพลขี่พาหนะ+2%",},
        [3] = {1,"ไล่ตะวัน·ม้าชิงจุย","[ไล่ตะวัน·ม้าชิงจุย]โบนัสโจมตีขุนพลขี่พาหนะ+3%",},
        [4] = {2,"ม้าหูเขียว","[ม้าหูเขียว]โบนัสป้องกันขุนพลขี่พาหนะ+1%",},
        [5] = {2,"ไล่วายุ·ม้าหูเขียว","[ไล่วายุ·ม้าหูเขียว]โบนัสป้องกันขุนพลขี่พาหนะ+2%",},
        [6] = {2,"ไล่ตะวัน·ม้าหูเขียว","[ไล่ตะวัน·ม้าหูเขียว]โบนัสป้องกันขุนพลขี่พาหนะ+3%",},
        [7] = {3,"ม้าชูหวาง","[ม้าชูหวาง]โบนัสHPขุนพลขี่พาหนะ+1%",},
        [8] = {3,"ไล่วายุ·ม้าชูหวาง","[ไล่วายุ·ม้าชูหวาง]โบนัสHPขุนพลขี่พาหนะ+2%",},
        [9] = {3,"ไล่ตะวัน·ม้าชูหวาง","[ไล่ตะวัน·ม้าชูหวาง]โบนัสHPขุนพลขี่พาหนะ+3%",},
        [10] = {4,"ม้าเจาหลิว","[ม้าเจาหลิว]โบนัสดาเมจคริขุนพลขี่พาหนะ+1%",},
        [11] = {4,"ไล่วายุ·ม้าเจาหลิว","[ไล่วายุ·ม้าเจาหลิว]โบนัสดาเมจคริขุนพลขี่พาหนะ+2%",},
        [12] = {4,"ไล่ตะวัน·ม้าเจาหลิว","[ไล่ตะวัน·ม้าเจาหลิว]โบนัสดาเมจคริขุนพลขี่พาหนะ+3%",},
        [13] = {5,"ม้าหิมะขาว","[ม้าหิมะขาว]โบนัสดาเมจขุนพลขี่พาหนะ+3%",},
        [14] = {5,"ไล่วายุ·ม้าหิมะขาว","[ไล่วายุ·ม้าหิมะขาว]โบนัสดาเมจขุนพลขี่พาหนะ+6%",},
        [15] = {5,"ไล่ตะวัน·ม้าหิมะขาว","[ไล่ตะวัน·ม้าหิมะขาว]โบนัสดาเมจขุนพลขี่พาหนะ+9%",},
        [16] = {6,"ม้าซ่าลู่ซื่อ","[ม้าซ่าลู่ซื่อ]ลดดาเมจที่ได้รับขุนพลขี่พาหนะ+3%",},
        [17] = {6,"ไล่วายุ·ม้าซ่าลู่ซื่อ","[ไล่วายุ·ม้าซ่าลู่ซื่อ]ลดดาเมจที่ได้รับขุนพลขี่พาหนะ+6%",},
        [18] = {6,"ไล่ตะวัน·ม้าซ่าลู่ซื่อ","[ไล่ตะวัน·ม้าซ่าลู่ซื่อ]ลดดาเมจที่ได้รับขุนพลขี่พาหนะ+9%",},
        [19] = {7,"ม้าหงอวี้เหนี่ยน","[ม้าหงอวี้เหนี่ยน]โบนัสHPขุนพลขี่พาหนะ+3%",},
        [20] = {7,"ไล่วายุ·ม้าหงอวี้เหนี่ยน","[ไล่วายุ·ม้าหงอวี้เหนี่ยน]โบนัสHPขุนพลขี่พาหนะ+6%",},
        [21] = {7,"ไล่ตะวัน·ม้าหงอวี้เหนี่ยน","[ไล่ตะวัน·ม้าหงอวี้เหนี่ยน]โบนัสHPขุนพลขี่พาหนะ+9%",},
        [22] = {8,"ม้าปี้ชง","[ม้าปี้ชง]โบนัสอัตราคริขุนพลขี่พาหนะ+3%",},
        [23] = {8,"ไล่วายุ·ม้าปี้ชง","[ไล่วายุ·ม้าปี้ชง]โบนัสอัตราคริขุนพลขี่พาหนะ+6%",},
        [24] = {8,"ไล่ตะวัน·ม้าปี้ชง","[ไล่ตะวัน·ม้าปี้ชง]โบนัสอัตราคริขุนพลขี่พาหนะ+9%",},
        [25] = {9,"ม้าพันลี้","[ม้าพันลี้]เปลี่ยนดาเมจที่ฝ่ายศัตรูสร้างขึ้น20%เป็นรักษารักษาเป้าหมายฝ่ายเราที่เลือดน้อยสุด",},
        [26] = {9,"ไล่วายุ·ม้าพันลี้","[ไล่วายุ·ม้าพันลี้]โจมตีเปลี่ยนดาเมจที่ฝ่ายศัตรูสร้างขึ้น30%เป็นรักษารักษาเป้าหมายฝ่ายเราที่เลือดน้อยสุดและฟื้นฟูเลือดให้กับเป้าหมายนี้เพิ่มอีกMax.HP10%",},
        [27] = {9,"ไล่ตะวัน·ม้าพันลี้","[ไล่ตะวัน·ม้าพันลี้]โจมตีเปลี่ยนดาเมจที่ฝ่ายศัตรูสร้างขึ้น30%เป็นรักษารักษาเป้าหมายฝ่ายเราที่เลือดน้อยสุดและฟื้นฟูเลือดให้กับเป้าหมายนี้เพิ่มอีกMax.HP30%",},
        [28] = {10,"ม้าเมฆดำ","[ม้าเมฆดำ] โจมตีสร้างดาเมจใส่ฝ่ายศัตรูเพิ่มอีก 16%",},
        [29] = {10,"ไล่ลม·ม้าเมฆดำ","[ไล่ลม·ม้าเมฆดำ] โจมตีสร้างดาเมจใส่ฝ่ายศัตรูเพิ่มอีก 25% ฆ่าเป้าหมายแล้วมีโอกาส 50% ฟื้นฟูโทสะของตนเอง 1 แต้ม",},
        [30] = {10,"ไล่ซัน·ม้าเมฆดำ","[ไล่ซัน·ม้าเมฆดำ] โจมตีสร้างดาเมจใส่ฝ่ายศัตรูเพิ่มอีก 25% ฆ่าเป้าหมายแล้วฟื้นฟูโทสะตนเอง 1 แต้ม และเมื่อคืนโทสะครั้งหน้าฟื้นฟูโทสะเพิ่มอีก 1 แต้ม",},
        [31] = {11,"ม้ามังกรไฟ","[ม้ามังกรไฟ] เอฟเฟกต์รักษาเพิ่ม 10% รักษาเป้าหมายที่ถูกผนึกรักษา จะพ่วงโล่ดูดซับดาเมจให้เขาต่อเนื่อง 1 รอบ ดูดับดาเมจ 40% ของปริมาณรักษา",},
        [32] = {11,"ไล่ลม·ม้ามังกรไฟ","[ไล่ลม·ม้ามังกรไฟ] เอฟเฟกต์รักษาเพิ่ม 18% รักษาเป้าหมายที่ถูกผนึกรักษา จะพ่วงโล่ดูดซับดาเมจให้เขาต่อเนื่อง 1 รอบ ดูดับดาเมจ 70% ของปริมาณรักษา",},
        [33] = {11,"ไล่ซัน·ม้ามังกรไฟ","[ไล่ลม·ม้ามังกรไฟ] เอฟเฟกต์รักษาเพิ่ม 25% รักษาเป้าหมายที่ถูกผนึกรักษา จะพ่วงโล่ดูดซับดาเมจให้เขาต่อเนื่อง 1 รอบ ดูดับดาเมจ 70% ของปริมาณรักษา",},
        [34] = {12,"ม้ายู่ซือ","[ม้ายู่ซือ] ในการต่อสู้ทุกรอบได้รับเอฟเฟกต์ลดโทสะมากสุด 2 แต้ม",},
        [35] = {12,"ไล่ลม·ม้ายู่ซือ","[ไล่ลม·ม้ายู่ซือ] ก่อนต่อสู้ได้รับเอฟเฟกต์ลดโทสะมากสุด 1 แต้ม ในการต่อสู้ทุกรอบได้รับเอฟเฟกต์ลดโทสะมากสุด 2 แต้ม",},
        [36] = {12,"ไล่ซัน·ม้ายู่ซือ","[ไล่ซัน·ม้ายู่ซือ] ก่อนต่อสู้ได้รับเอฟเฟกต์ลดโทสะมากสุด 1 แต้ม ในการต่อสู้ทุกรอบได้รับเอฟเฟกต์ลดโทสะมากสุด 1 แต้ม",},
        [37] = {15,"ม้าสายฟ้า","[ม้าสายฟ้า] ค่า Max.HP เพิ่ม 15% ครั้งแรกในการต่อสู้ที่ได้รับดาเมจปลิดชีพ ไม่ตายและจะฟื้นฟู HP ด้วยค่า Max.HP20%",},
        [38] = {15,"ไล่ลม·ม้าสายฟ้า","[ไล่ลม·ม้าสายฟ้า] ค่า Max.HP เพิ่ม 30% ครั้งแรกในการต่อสู้ที่ได้รับดาเมจปลิดชีพ ไม่ตายและจะฟื้นฟู HP ด้วยค่า Max.HP 40% ฟื้นฟูโทสะของตนเอง 2 แต้ม",},
        [39] = {15,"ไล่ซัน·ม้าสายฟ้า","[ไล่ซัน·ม้าสายฟ้า] ค่า Max.HP เพิ่ม 45% ครั้งแรกในการต่อสู้ที่ได้รับดาเมจปลิดชีพ ไม่ตายและจะฟื้นฟู HP ด้วยค่า Max.HP 60% ฟื้นฟูโทสะของตนเอง 4 แต้ม",},
        [40] = {13,"ม้าเจ่าหวง","[ม้าเจ่าหวง] โปรดอดใจรอ",},
        [41] = {13,"จันทร์เพ็ญ·ม้าเจ่าหวง","[จันทร์เพ็ญ·ม้าเจ่าหวง] โปรดอดใจรอ",},
        [42] = {13,"ย่ำสวรรค์·ม้าเจ่าหวง","[ย่ำสวรรค์·ม้าเจ่าหวง] โปรดอดใจรอ",},
        [43] = {14,"ม้าเต๊กเลาฟ้าผ่า","[ม้าเต๊กเลาฟ้าผ่า]โปรดอดใจรอ",},
        [44] = {14,"จันทร์เพ็ญ·ม้าเต๊กเลาฟ้าผ่า","[จันทร์เพ็ญ·ม้าเต๊กเลาฟ้าผ่า]โปรดอดใจรอ",},
        [45] = {14,"ย่ำสวรรค์·ม้าเต๊กเลาฟ้าผ่า","[ย่ำสวรรค์·ม้าเต๊กเลาฟ้าผ่า]โปรดอดใจรอ",},
    }
}

return horse_star