--jade

local jade = {
    -- key
    __key_map = {
      id = 1,    --玉石id-int 
      equipment = 2,    --适用装备_math-string 
      name = 3,    --玉石名称-string 
      profile = 4,    --玉石短描述-string 
      description = 5,    --玉石详情-string 
      bag_description = 6,    --背包玉石描述-string 
      button_txt = 7,    --按钮文字-string 
    
    },
    -- data
    _data = {
        [1] = {1101,"601|501|409","หยกดาวมังกร·โจมตี","โจมตี+5000","โจมตี+5000(ตัวเอกอัป1เลเวลโจมตี+100เป็นพิเศษ)","โจมตี+5000","ฝัง",},
        [2] = {1102,"601|501|409","หยกดาวมังกร·รักษา","โบนัสรักษา+8%","โบนัสรักษา+8%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+8%","ฝัง",},
        [3] = {1103,"601|501|409","หยกดาวมังกร·คริ","โอกาสคริ+12%","โอกาสคริ+12%","โอกาสคริ+12%","ฝัง",},
        [4] = {1104,"602|502|410","หยกดาวเต่า·กาย","ป้องกันกายภาพ+2500","ป้องกันกายภาพ+2500(ตัวเอกอัป1เลเวลป้องกันกายภาพ+50เป็นพิเศษ)","ป้องกันกายภาพ+2500","ฝัง",},
        [5] = {1105,"602|502|410","หยกดาวเต่า·สมาน","อัตราถูกรักษา+8%","อัตราถูกรักษา+8%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+8%","ฝัง",},
        [6] = {1106,"602|502|410","หยกดาวเต่า·ต้าน","โอกาสต้านคริ+12%","โอกาสต้านคริ+12%","โอกาสต้านคริ+12%","ฝัง",},
        [7] = {1107,"603|503|411","หยกดาวเสือ·เวทย์","ป้องกันเวทย์+2500","ป้องกันเวทย์+2500 (ตัวเอกอัป1เลเวล ป้องกันเวทย์+50)","ป้องกันเวทย์+2500","ฝัง",},
        [8] = {1108,"603|503|411","หยกดาวเสือ·สมาน","อัตราถูกรักษา+8%","อัตราถูกรักษา+8%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+8%","ฝัง",},
        [9] = {1109,"603|503|411","หยกดาวเสือ·หลบ","โอกาสหลบหลีก+12%","โอกาสหลบหลีก+12%","โอกาสหลบหลีก+12%","ฝัง",},
        [10] = {1110,"604|504|412","หยกดาวหงส์·เลือด","HP+37500","HP+37500(ตัวเอกอัป1เลเวลHP+750เป็นพิเศษ)","HP+37500","ฝัง",},
        [11] = {1111,"604|504|412","หยกดาวหงส์·รักษา","โบนัสรักษา+8%","โบนัสรักษา+8%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+8%","ฝัง",},
        [12] = {1112,"604|504|412","หยกดาวหงส์·ชีวิต","โอกาสHIT+12%","โอกาสHIT+12%","โอกาสHIT+12%","ฝัง",},
        [13] = {1201,"601|501|409","หยกมูนมังกร·โจมตี","โบนัสโจมตี+12%","โบนัสโจมตี+12%","โบนัสโจมตี+12%","ฝัง",},
        [14] = {1202,"601|501|409","หยกมูนมังกร·รักษา","โบนัสรักษา+12%","โบนัสรักษา+12%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+12%","ฝัง",},
        [15] = {1203,"601|501|409","หยกมูนมังกร·คริ","โอกาสคริ+22%","โอกาสคริ+22%","โอกาสคริ+22%","ฝัง",},
        [16] = {1204,"602|502|410","หยกมูนเต่า·กาย","โบนัสป้องกันกายภาพ+12%","โบนัสป้องกันกายภาพ+12%","โบนัสป้องกันกายภาพ+12%","ฝัง",},
        [17] = {1205,"602|502|410","หยกมูนเต่า·สมาน","อัตราถูกรักษา+12%","อัตราถูกรักษา+12%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+12%","ฝัง",},
        [18] = {1206,"602|502|410","หยกมูนเต่า·ต้าน","โอกาสต้านคริ+22%","โอกาสต้านคริ+22%","โอกาสต้านคริ+22%","ฝัง",},
        [19] = {1207,"603|503|411","หยกมูนเสือว·เวทย์","โบนัสป้องกันเวทย์+12%","โบนัสป้องกันเวทย์+12%","โบนัสป้องกันเวทย์+12%","ฝัง",},
        [20] = {1208,"603|503|411","หยกมูนเสือ·สมาน","อัตราถูกรักษา+12%","อัตราถูกรักษา+12%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+12%","ฝัง",},
        [21] = {1209,"603|503|411","หยกมูนเสือ·หลบ","โอกาสหลบหลีก+22%","โอกาสหลบหลีก+22%","โอกาสหลบหลีก+22%","ฝัง",},
        [22] = {1210,"604|504|412","หยกมูนหงส์·เลือด","โบนัสHP+12%","โบนัสHP+12%","โบนัสHP+12%","ฝัง",},
        [23] = {1211,"604|504|412","หยกมูนหงส์·รักษา","โบนัสรักษา+12%","โบนัสรักษา+12%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+12%","ฝัง",},
        [24] = {1212,"604|504|412","หยกมูนหงส์·ชีวิต","โอกาสHIT+22%","โอกาสHIT+22%","โอกาสHIT+22%","ฝัง",},
        [25] = {1301,"601|501|409","หยกซันมังกร·ดาเมจ","โบนัสดาเมจ+18%","โบนัสดาเมจ+18%","โบนัสดาเมจ+18%","ฝัง",},
        [26] = {1302,"601|501|409","หยกซันมังกร·รักษา","โบนัสรักษา+18%","โบนัสรักษา+18%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+18%","ฝัง",},
        [27] = {1303,"601|501|409","หยกซันมังกร·คริ","โอกาสคริ+32%","โอกาสคริ+32%","โอกาสคริ+32%","ฝัง",},
        [28] = {1304,"601|501|409","หยกซันมังกร·ข่ม","เพิ่มดาเมจPVP+18%","เพิ่มดาเมจPVP+18%","เพิ่มดาเมจPVP+18%","ฝัง",},
        [29] = {1305,"602|502|410","หยกซันเต่า·ปกป้อง","ลดดาเมจ+18%","ลดดาเมจ+18%","ลดดาเมจ+18%","ฝัง",},
        [30] = {1306,"602|502|410","หยกซันเต่า·สมาน","อัตราถูกรักษา+18%","อัตราถูกรักษา+18%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+18%","ฝัง",},
        [31] = {1307,"602|502|410","หยกซันเต่า·ต้าน","โอกาสต้านคริ+32%","โอกาสต้านคริ+32%","โอกาสต้านคริ+32%","ฝัง",},
        [32] = {1308,"602|502|410","หยกซันเต่า·เหนียว","ลดดาเมจPVP+18%","ลดดาเมจPVP+18%","ลดดาเมจPVP+18%","ฝัง",},
        [33] = {1309,"603|503|411","หยกซันเสือ ·ปกป้อง","ลดดาเมจ+18%","ลดดาเมจ+18%","ลดดาเมจ+18%","ฝัง",},
        [34] = {1310,"603|503|411","หยกซันเสือ ·สมาน","อัตราถูกรักษา+18%","อัตราถูกรักษา+18%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","อัตราถูกรักษา+18%","ฝัง",},
        [35] = {1311,"603|503|411","หยกซันเสือ ·หลบ","โอกาสหลบหลีก+32%","โอกาสหลบหลีก+32%","โอกาสหลบหลีก+32%","ฝัง",},
        [36] = {1312,"603|503|411","หยกซันเสือ ·เหนียว","ลดดาเมจPVP+18%","ลดดาเมจPVP+18%","ลดดาเมจPVP+18%","ฝัง",},
        [37] = {1313,"604|504|412","หยกซันหงส์·ดาเมจ","โบนัสดาเมจ+18%","โบนัสดาเมจ+18%","โบนัสดาเมจ+18%","ฝัง",},
        [38] = {1314,"604|504|412","หยกซันหงส์·รักษา","โบนัสรักษา+18%","โบนัสรักษา+18%(มีผลกับการรักษาขุนพลในประเภทรักษาเท่านั้น)","โบนัสรักษา+18%","ฝัง",},
        [39] = {1315,"604|504|412","หยกซันหงส์·ชีวิต","โอกาสHIT+32%","โอกาสHIT+32%","โอกาสHIT+32%","ฝัง",},
        [40] = {1316,"604|504|412","หยกซันหงส์·ข่ม","เพิ่มดาเมจPVP+18%","เพิ่มดาเมจPVP+18%","เพิ่มดาเมจPVP+18%","ฝัง",},
        [41] = {2101,"601|501","หยกจิตมังกร·สังหาร","โจมตีเป้าหมายที่ถูกควบคุมจะเพิ่มดาเมจ","เมื่อโจมตีเป้าหมายที่ถูกเอฟเฟกต์ควบคุม(มึนงง เงียบขรึม เหน็บชา) เพิ่มดาเมจ15%","โจมตีเป้าหมายที่ถูกควบคุมจะเพิ่มดาเมจ","ฝัง",},
        [42] = {2102,"601|501","หยกจิตมังกร·บ้าเลือด","โจมตีสกิลสามารถสร้างดาเมจพิเศษได้","เมื่อจำนวนเป้าหมายโจมตีเป็น1/2/3/4/6คน สร้างดาเมจHPสูงสุดของเป้าหมาย15%/7.5%/5%/3.75%/ 2.5%เป็นพิเศษ","โจมตีสกิลสามารถสร้างดาเมจพิเศษได้","ฝัง",},
        [43] = {2103,"601|501","หยกจิตมังกร·ร่วมใจ","สร้างดาเมจหรือรักษาเพิ่มขึ้น","เมื่อร่ายสกิลหรือโจมตีทั่วไป ทำให้ตนเองสร้างดาเมจหรือรักษาเพิ่มขึ้น(ฝ่ายเราเมื่อมีขุนพลคนที่อยู่ค่ายเดียวกับเราทุกๆ1คน ดาเมจหรือรักษา+3.75%)","สร้างดาเมจหรือรักษาเพิ่มขึ้น","ฝัง",},
        [44] = {2104,"601|501","หยกจิตมังกร·สมหวัง","สังหารเป้าหมายสามารถกำจัดเอฟเฟกต์ผิดปกติได้","หลังจากสังหารเป้าหมาย กำจัดเอฟเฟกต์ผิดปกติทั้งหมด(เผาไหม้ ถูกพิษ มึนงง เงียบขรึม เหน็บชา)ที่เป้าหมายนี้ร่ายก่อนตายบนตัวของขุนพลฝ่ายเรา","สังหารเป้าหมายสามารถกำจัดเอฟเฟกต์ผิดปกติได้","ฝัง",},
        [45] = {2105,"602|502","หยกวชิระเต่า·ดูดดาว","ได้รับโล่ดูดซับดาเมจก่อนเริ่มรอบ","ก่อนเริ่มต่อสู้ ทำให้ตนเองได้รับโล่ดูดซับดาเมจ1อัน ดูดซับดาเมจทันที30%ของเลือดสูงสุดของตนเอง ต่อเนื่อง1รอบ","ได้รับโล่ดูดซับดาเมจก่อนเริ่มรอบ","ฝัง",},
        [46] = {2106,"602|502","หยกวชิระเต่า·เกล็ดเงิน","หลังจากลงมือจะได้รับโล่ดูดซับดาเมจ","หลังจากตนเองลงมือ ทำให้ตนเองได้รับโล่ดูดซับดาเมจ1อัน ดูดซับดาเมจทันที15%ของHPสูงสุดของตนเอง ต่อเนื่อง1รอบ(ในรอบของตนเองจะกระตุ้นเพียง1ครั้ง)","หลังจากลงมือจะได้รับโล่ดูดซับดาเมจ","ฝัง",},
        [47] = {2107,"602|502","หยกวชิระเต่า·รวมสมุทร","เมื่อตายจะทำให้เพื่อนร่วมทีมได้รับโล่อมตะู","เมื่อตาย ทำให้เป้าหมายฝ่ายเพื่อนที่มีเลือดน้อยที่สุดได้รับโล่อมตะ 1 อัน ต่อเนื่อง 1 รอบ (ความแข็งแกร่งของโล่เทียบเท่ากับ โล่ที่เพิ่มเติมเมื่อเตียวคับทะลวง 5 )","เมื่อตายจะทำให้เพื่อนร่วมทีมได้รับโล่อมตะู","ฝัง",},
        [48] = {2108,"602|502","หยกวชิระเต่า·สลายเจ็บ","เมื่อถูกดาเมจรุนแรงจะได้รับลดดาเมจ","เมื่อถูกดาเมจทันทีขุนพล ถ้าดาเมจนี้เกิน50%ของHPสูงสุดของตนเอง จะลดดาเมจครั้งนี้30%","เมื่อถูกดาเมจรุนแรงจะได้รับลดดาเมจ","ฝัง",},
        [49] = {2109,"603|503","หยกโกรธเสือ ·ฟื้นคืน","ฟื้นฟูโทสะเมื่อสิ้นสุดรอบ","หลังจากตนเองลงมือ จะฟื้นฟูโทสะของตนเอง1แต้ม(ในรอบของตนเองจะกระตุ้นเพียง1ครั้ง)","ฟื้นฟูโทสะเมื่อสิ้นสุดรอบ","ฝัง",},
        [50] = {2110,"603|503","หยกโกรธเสือ·หลินเซง","เพื่อนร่วมทีมร่ายสกิลมีโอกาสฟื้นฟูโทสะ","หลังจากเพื่อนร่วมทีมร่ายสกิล มีโอกาส 20% ฟื้นฟูโทสะของตนเอง 1 แต้ม","เพื่อนร่วมทีมร่ายสกิลมีโอกาสฟื้นฟูโทสะ","ฝัง",},
        [51] = {2111,"603|503","หยกโกรธเสือ·สลายขั้ว","เมื่อสิ้นสุดรอบทั้งหมดจะมีโอกาสฟื้นฟูโทสะ","เมื่อสิ้นสุดรอบทั้งหมด ถ้าโทสะของตนเองต่ำกว่า4แต้ม จะมีโอกาส35%ฟื้นฟูโทสะถึง4แต้ม","เมื่อสิ้นสุดรอบทั้งหมดจะมีโอกาสฟื้นฟูโทสะ","ฝัง",},
        [52] = {2112,"603|503","หยกโกรธเสือ·ตลบนิ่ม","ร่ายสกิลมีโอกาสฟื้นฟูโทสะที่ใช้","หลังจากร่ายสกิล มีโอกาส25%ได้รับโทสะ50%ที่สกิลครั้งนี้ใช้ มากสุดไม่เกิน4แต้ม","ร่ายสกิลมีโอกาสฟื้นฟูโทสะที่ใช้","ฝัง",},
        [53] = {2113,"604|504","หยกชีวะหงส์·เจตนา","ร่ายสกิลมีโอกาสทำให้เพื่อนร่วมทีมต้านทานการควบคุมเพิ่มขึ้น","หลังจากร่ายสกิล มีโอกาส50%ทำให้เป้าหมายฝ่ายเพื่อนที่อยู่ใกล้เคียงถูกอัตราเอฟเฟกต์ควบคุม(มึนงง เงียบขรึม เหน็บชา)ลดลง35% ต่อเนื่อง1รอบ","ร่ายสกิลมีโอกาสทำให้เพื่อนร่วมทีมต้านทานการควบคุมเพิ่มขึ้น","ฝัง",},
        [54] = {2114,"604|504","หยกชีวะหงส์·เสริม","เมื่อตนเองฟื้นฟูโทสะจะสามารถฟื้นฟูเลือดได้","ในรอบของตนเอง ในขณะที่ฟื้นฟูโทสะ จะฟื้นฟูเลือด15%ของHPสูงสุดของตนเอง","เมื่อตนเองฟื้นฟูโทสะจะสามารถฟื้นฟูเลือดได้","ฝัง",},
        [55] = {2115,"604|504","หยกชีวะหงส์·รวมสติ","เมื่อตนเองยังไม่ได้ลงมือจะได้รับโล่ป้องกันควบคุม","เมื่อสิ้นสุดรอบของตนเอง ถ้ารอบนี้ไม่ได้เปิดฉากลงมือ จะได้รับโล่คุ้มกันเอฟเฟกต์ควบคุม(มึนงง เงียบขรึม เหน็บชา)1อัน ต่อเนื่อง1รอบ","เมื่อตนเองยังไม่ได้ลงมือจะได้รับโล่ป้องกันควบคุม","ฝัง",},
        [56] = {2116,"604|504","หยกชีวะหงส์·สุทธิ์","มีโอกาสกำจัดเอฟเฟกต์ผิดปกติของตนเองก่อนเริ่มรอบ","ก่อนเริ่มรอบของตนเอง มีโอกาส25%กำจัดเอฟเฟกต์ผิดปกติ(เผาไหม้ ถูกพิษ มึนงง เงียบขรึม เหน็บชา)ทั้งหมดของตนเอง","มีโอกาสกำจัดเอฟเฟกต์ผิดปกติของตนเองก่อนเริ่มรอบ","ฝัง",},
    }
}

return jade