--mail_lang

local mail_lang = {
    -- key
    __key_map = {
      id = 1,    --ID_key-int 
      mail_name = 2,    --发件人-泰语-string 
      mail_title = 3,    --邮件标题-越南语-string 
      mail_text = 4,    --邮件文本-简中-string 
    
    },
    -- data
    _data = {
        [1] = {8401,"เสี่ยวเกี้ยว","เตือนเติมเงิน","ในปีxxxxเดือนxวันx เวลาxx:xx:xxน. ท่านซื้อ#name#ทางเว็บไซด์ รางวัลส่งให้ในบัญชีที่ท่านกำหนดแล้ว พร้อมกับเปิดใช้กิจกรรมสะสมในวันนี้ ขอบคุณที่สนับสนุน!",},
        [2] = {8402,"เสี่ยวเกี้ยว","เตือนเติมเงิน","ในปีxxxxเดือนxวันx เวลาxx:xx:xxน. ท่านซื้อ#name#ทางอินเตอร์เน็ต รางวัลบางส่วนให้ในบัญชีของท่านโดยตรง รางวัลที่เหลือไปรับได้ในหน้าที่เหมาะสมในเกม พร้อมกับเปิดกิจกรรมสะสมเติมเงินที่เหมาะสม ขอบคุณที่สนับสนุน!",},
    }
}

return mail_lang