--mine_output

local mine_output = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      description = 2,    --状态描述-泰语-string 
      output_show = 3,    --显示产量-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ปกติ","",},
        [2] = {2,"ปกติ","",},
        [3] = {3,"ปกติ","",},
        [4] = {4,"ปกติ","",},
        [5] = {5,"ปกติ","",},
        [6] = {6,"ปกติ","600/วัน",},
        [7] = {7,"เบียด","480/วัน",},
        [8] = {8,"เต็ม","360/วัน",},
        [9] = {9,"เต็ม","360/วัน",},
        [10] = {10,"เต็ม","360/วัน",},
        [11] = {11,"ปกติ","400/วัน",},
        [12] = {12,"เบียด","320/วัน",},
        [13] = {13,"เต็ม","240/วัน",},
        [14] = {14,"เต็ม","240/วัน",},
        [15] = {15,"เต็ม","240/วัน",},
        [16] = {16,"ปกติ","200/วัน",},
        [17] = {17,"เบียด","160/วัน",},
        [18] = {18,"เต็ม","120/วัน",},
        [19] = {19,"เต็ม","120/วัน",},
        [20] = {20,"เต็ม","120/วัน",},
    }
}

return mine_output