--mine_pit

local mine_pit = {
    -- key
    __key_map = {
      pit_id = 1,    --矿坑id-int 
      pit_name = 2,    --矿坑名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {100,"ลกเอี๋ยง",},
        [2] = {101,"ฮูโต๋",},
        [3] = {102,"ตันลิว",},
        [4] = {103,"ปักเอี้ยง",},
        [5] = {104,"แห้ฝือ",},
        [6] = {105,"จิ้นหยาง",},
        [7] = {106,"หนานผี",},
        [8] = {107,"เพงงวน",},
        [9] = {108,"เสียวพ่าย",},
        [10] = {109,"ปักไฮ",},
        [11] = {110,"เงียบกุ๋น",},
        [12] = {201,"เตียงฮัน",},
        [13] = {202,"ซงหยง",},
        [14] = {203,"อ้วนเซีย",},
        [15] = {204,"ฮั่นต๋ง",},
        [16] = {205,"หยงอัน",},
        [17] = {206,"กังจิ๋ว",},
        [18] = {207,"ซ่างยง",},
        [19] = {208,"เทียนสุ่ย",},
        [20] = {209,"อันติ้ง",},
        [21] = {210,"เฉิงตู",},
        [22] = {301,"ฉิวฉุน",},
        [23] = {302,"กังแฮ",},
        [24] = {303,"ชีสอง",},
        [25] = {304,"โลกั๋ง",},
        [26] = {305,"กังเหลง",},
        [27] = {306,"บุเหลง",},
        [28] = {307,"เตียงสา",},
        [29] = {308,"ไคว่จี",},
        [30] = {309,"หวูจวิ้น",},
        [31] = {310,"เจี้ยนเอี้ย",},
    }
}

return mine_pit