--mine_battle_buff

local mine_battle_buff = {
    -- key
    __key_map = {
      buff_id = 1,    --id-int 
      buff_name = 2,    --类型名称-越南语-string 
      buff_txt = 3,    --类型描述-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {101,"เหนื่อย","ค่าเหนื่อย50, ในการต่อสู้ดาเมจลดลง5%",},
        [2] = {102,"เหนื่อย","ค่าเหนื่อย55, ในการต่อสู้ดาเมจลดลง10%",},
        [3] = {103,"เหนื่อย","ค่าเหนื่อย60, ในการต่อสู้ดาเมจลดลง15%",},
        [4] = {104,"เหนื่อย","ค่าเหนื่อย65, ในการต่อสู้ดาเมจลดลง20%",},
        [5] = {105,"เหนื่อย","ค่าเหนื่อย70, ในการต่อสู้ดาเมจลดลง25%",},
        [6] = {106,"เหนื่อย","ค่าเหนื่อย75, ในการต่อสู้ดาเมจลดลง30%",},
        [7] = {107,"เหนื่อย","ค่าเหนื่อย80, ในการต่อสู้ดาเมจลดลง35%",},
        [8] = {108,"เหนื่อย","ค่าเหนื่อย85, ในการต่อสู้ดาเมจลดลง40%",},
        [9] = {109,"เหนื่อย","ค่าเหนื่อย90, ในการต่อสู้ดาเมจลดลง45%",},
        [10] = {110,"เหนื่อย","ค่าเหนื่อย100, ในการต่อสู้ดาเมจลดลง50%",},
        [11] = {200,"ยึดครอง","กองทัพยึดครองเขตเหมืองในปัจจุบันเพียงผู้เดียว ในขณะต่อสู้จะถูกดาเมจลดลง10%",},
    }
}

return mine_battle_buff