--mine_event

local mine_event = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      count_down_title = 2,    --倒计时标题-泰语-string 
      count_down_txt = 3,    --倒计时说明-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เปิดเขตเหมืองรอบนอก: ","ในเขตเหมืองทั่วไปต่อสู้ไม่ได้",},
        [2] = {2,"เปิดเขตเหมืองขั้นสูง: ","ในเขตเหมืองขั้นสูงสามารถกำจัดทหารศัตรู ยึดครองเขตเหมืองได้",},
        [3] = {3,"เปิดเขตเหมืองสุดขีด: ","แย่งชิงเหมืองแร่ขั้นสูงสุด ได้รับผลประโยชน์สูงสุด",},
    }
}

return mine_event