--mine_district

local mine_district = {
    -- key
    __key_map = {
      district_id = 1,    --矿区id-int 
      district_name = 2,    --矿区名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เขตเหมืองจงหยวน",},
        [2] = {2,"เขตเหมืองฮอตั๋ง",},
        [3] = {3,"เขตเหมืองห้วยหนำ",},
        [4] = {4,"เขตเหมืองฮั่นต๋ง",},
        [5] = {5,"เขตเหมืองซั่วฟาง",},
        [6] = {6,"เขตเหมืองโยวเยี่ยน",},
        [7] = {7,"เขตเหมืองกังตั๋ง",},
        [8] = {8,"เขตเหมืองหนานเยว่",},
        [9] = {9,"เขตเหมืองรัฐปาสู่",},
        [10] = {10,"เขตเหมืองซีหลง",},
    }
}

return mine_district