--notification

local notification = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      time_txt = 2,    --标题-泰语-string 
      chat_before = 3,    --文本-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"งานเลี้ยงกลางวันเริ่มแล้ว","นายท่านทุกคน งานเลี้ยงกลางวันเริ่มแล้ว รีบไปเข้าร่วมงานเลี้ยงกลางวันเติมกำลังมากมายสิ!",},
        [2] = {2,"งานเลี้ยงเย็นเริ่มแล้ว","นายท่านทุกคน งานเลี้ยงเย็นเริ่มแล้ว รีบไปเข้าร่วมงานเลี้ยงเย็นเติมกำลังมากมายสิ!",},
        [3] = {3,"อาหารมื้อดึกเริ่มแล้ว","นายท่านทุกคน อาหารมื้อดึกเริ่มแล้ว รีบไปเข้าร่วมอาหารมื้อดึกเติมกำลังมากมายสิ!",},
        [4] = {4,"BOSSกองทัพมาแล้ว","BOSSกองทัพจะเริ่มหลังจากนี้อีก5นาที นายท่านเชิญไปท้ารบ ขับไล่BOSSแล้วจะเข้าร่วมประมูลกับรับโบนัส!",},
        [5] = {5,"BOSSกองทัพมาแล้ว","BOSSกองทัพจะเริ่มหลังจากนี้อีก5นาที นายท่านเชิญไปท้ารบ ขับไล่BOSSแล้วจะเข้าร่วมประมูลกับรับโบนัส!",},
        [6] = {6,"每日早上礼物","各位主公, 快点登陆领取您的早上礼物吧~~~",},
        [7] = {7,"เปิดศึกสามก๊ก","สมรภูมิสามก๊กกำลังจะเปิดศึกหลังจากนี้5นาที ท้ารบBOSSและเอาชนะ สามารถเข้าร่วมประมูลกับรับโบนัส!",},
        [8] = {8,"เปิดศึกประลองค่าย","ประลองค่ายกำลังจะเปิดศึกหลังจากนี้5นาที ใครคือราชาแห่งแคมป์ เชิญไปประลองเทียบฝีมือ!",},
        [9] = {9,"เปิดศึกกองทัพ","ศึกกองทัพกำลังจะเปิดศึกหลังจากนี้5นาที ชิงยึดครองเมือง เป็นสุดยอดกองทัพ ขึ้นอยู่กับตอนนี้!",},
    }
}

return notification