--official_rank

local official_rank = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --晋升名称-泰语-string 
      text_1 = 3,    --主界面提示文本-泰语-string 
      text_2 = 4,    --晋升提示文本-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {0,"ประชาชน","เลื่อนชั้นครั้งนี้เพิ่มวาสนาตัวเอก:ป้องกันเล่ม2—โบนัสป้องกัน+70%","เพิ่มวาสนาตัวเอก:ป้องกันเล่ม2—โบนัสป้องกัน+70%",},
        [2] = {1,"ทหาร","","",},
        [3] = {2,"ซือหม่า","เลื่อนชั้นครั้งนี้เพิ่มวาสนาตัวเอก:HPเล่ม3—โบนัสHP+80%","เพิ่มวาสนาตัวเอก:HPเล่ม3—โบนัสHP+80%",},
        [4] = {3,"ผู้บัญชาการ","","",},
        [5] = {4,"เจ้าเมืองโท","","",},
        [6] = {5,"เจ้าเมืองเอก","","",},
        [7] = {6,"ผู้ว่าแคว้น","เลื่อนชั้นครั้งนี้เพิ่มวาสนาตัวเอก:โจมตีเล่ม3—โบนัสโจมตี+70%","เพิ่มวาสนาตัวเอก:โจมตีเล่ม3—โบนัสโจมตี+70%",},
        [8] = {7,"เจ้ากรม","","",},
        [9] = {8,"เลขาธิการ","","",},
        [10] = {9,"ราชเลขา","","",},
        [11] = {10,"แม่ทัพ","","",},
        [12] = {11,"แม่ทัพภาค","","",},
        [13] = {12,"แม่ทัพใหญ่","","",},
    }
}

return official_rank