--parameter_lang

local parameter_lang = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      content = 2,    --参数内容-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {14001,"วัน",},
        [2] = {14002,"ชั่วโมง",},
        [3] = {14003,"นาที",},
        [4] = {14004,"วินาที",},
        [5] = {174,"ไม่มี",},
        [6] = {245,"กองทัพ",},
        [7] = {31501,"วุยก๊ก",},
        [8] = {31502,"จ๊กก๊ก",},
        [9] = {31503,"ง่อก๊ก",},
        [10] = {31504,"กลุ่มก๊ก",},
        [11] = {42101,"[เหมืองสองเท่า]",},
        [12] = {42102,"[เหมืองสามเท่า]",},
        [13] = {321,"แข่ง16คนสุดท้าย",},
        [14] = {322,"แข่ง8คนสุดท้าย",},
        [15] = {323,"แข่ง4คนสุดท้าย",},
        [16] = {324,"แข่งเซมิไฟนอล",},
    }
}

return parameter_lang