--pet

local pet = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --名称-泰语-string 
      description = 3,    --宠物描述-泰语-string 
      description1 = 4,    --show宠物描述1-泰语-string 
      description2 = 5,    --show宠物描述2-泰语-string 
      skill_name = 6,    --show宠物技能名称-泰语-string 
      skill_description = 7,    --show宠物技能描述-泰语-string 
      is_fight = 8,    --无差别竞技里是否可用_math-int 
    
    },
    -- data
    _data = {
        [1] = {1,"หมีแพนด้า","แพนด้า หรือเรียกว่าสัตว์กินเหล็ก พ่อแพนด้าดุร้ายมีกำลัง เบบี้แพนด้าฉลาดน่ารัก พ่อลูกร่วมมือ ดั่งลมกระพือ","พ่อแพนด้าดุร้ายมีกำลัง เบบี้แพนด้าฉลาดน่ารัก","พ่อลูกร่วมมือ ดั่งลมกระพือ","[คำรามขวัญผวา]","สร้างดาเมจเดี่ยวใส่ศัตรู",0,},
        [2] = {2,"กวางแสนรู้","กวางแสนรู้ สัตว์วิเศษที่เติบโตในฟ้าดิน เขากวางรวมไอวิญญาณฟ้าดิน เมื่อปล่อยไอสามารถช่วยให้คนตายฟื้นชีพได้","สัตว์วิเศษที่เติบโตในฟ้าดิน","เขากวางรวมไอวิญญาณฟ้าดิน","[ดอกไม้บานสะพรั่ง]","รักษาเพื่อนร่วมทีมฝ่ายตนเองที่HPน้อยสุด",0,},
        [3] = {3,"จิ้งจอกไฟ","จิ้งจอกไฟ ว่ากันว่าจิ้งจอกนี้มี3หาง สี่กงเล็กมีไฟ ดุร้ายหยิ่งยโส แต่แยกแยะบุญคุณความแค้น มีบุญคุณต้องทดแทน มีแค้นต้องชำระ","สามหาง สี่กีบเท้ามีไฟ","แยกแยะบุญคุณความแค้น มีบุญคุณต้องทดแทน มีแค้นต้องชำระ","[จิ้งจอกไฟม้วนหาง]","สร้างดาเมจใส่แถวหลังฝ่ายศัตรู",0,},
        [4] = {4,"ปักษาจื่อชิง","ปักษาจื่อชิง สีปีกงดงาม ม่วงปนเขียว คนโบราณมองสีแดงเป็นหงส์ สีเขียวคือหลวน ว่ากันว่าชิงหลวนเป็นสัญลักษณ์แห่งความรัก เมื่อร้องเพลงทำให้คนทั้งเมืองมีความรักเบ่งบาน","สีปีกงดงาม ม่วงปนเขียว","ว่ากันว่าเป็นสัญลักษณ์แห่งความรัก","[พายุหมุนเศษเมฆ]","สร้างดาเมจใส่ฝ่ายศัตรูแถวหน้า",0,},
        [5] = {5,"เสือขาวสายฟ้า","เสือขาวสายฟ้า หนึ่งในสี่อสูรเทพ ตัวเป็นสีขาว แสงม่วงเปล่งประกาย สามารถใช้พลังสายฟ้าได้","ตัวเป็นสีขาว แสงม่วงเปล่งประกาย","สามารถใช้พลังสายฟ้าได้","[สายฟ้าผ่าตะวัน]","ก่อนรบลดโกรธ ระหว่างรบลดโกรธอีก",1,},
        [6] = {6,"มังกรเขียวทะเล","มังกรเขียวทะเล หัวหน้าสี่อสูรเทพ เป็นสัญลักษณ์แห่งมงคลมาตั้งแต่โบราณ มังกรเขียวทิศตะวันออก มีเขาบนหัว พ่นเมฆ ลมหายใจเสียงสายฟ้า บินได้สูง ท่องไปทั่วสารทิศ","หัวหน้าสี่อสูรเทพ","เป็นสัญลักษณ์แห่งมงคลมาตั้งแต่โบราณ","[พิโรธมังกรเขียว]","ฟื้นฟูโทสะของสมาชิกฝ่ายเรา",1,},
        [7] = {7,"หงส์เพลิงแดง","หงส์เพลิงแดง ราชาแห่งร้อยวิหค รูปโฉมงดงามที่สุดในสี่อสูรเทพ ใช้ไฟเป็นหลัก มีพลังรุนแรง ขับร้องเพลงเต้นรำ ทำนายความสงบของแผ่นดิน","ของที่สามารถเผาไหม้ได้","สามารถนำวิญญาณขึ้นไปสวรรค์ได้","[ไฟบรรลัยกัณฑ์]","สร้างดาเมจใส่เป้าหมายฝ่ายศัตรูที่ถูกเผาไหม้ทั้งหมด",1,},
        [8] = {8,"เต่าดำทลายฟ้า ","เต่าดำทลายฟ้า หนึ่งในสี่อสูรเทพ สัตว์วิเศษที่รวมเต่า งู เป็นสัญลักษณ์แห่งชีวิตอมตะมาตั้งแต่โบราณ เต่าดำ มาจากทะเลดำทางเหนือ อ่อนได้แข็งได้ ไม่ให้ทั้งตะกั่วและดีบุกไม่ให้ประเภทหิน เกิดจากฟ้าดิน เป็นยาอย่างดี บำรุงได้ทุกสิ่ง","สัตว์วิเศษที่รวมงูเต่า","สัญลักษณ์แห่งชีวิตอมตะ","[คุ้มครองเต่าดำ]","เพิ่มโล่ให้กับสมาชิกฝ่ายเรา",1,},
        [9] = {9,"มัจฉาอเวจี","ปลาคุนมาจากจวงจื้อ·บันทึกสราญรมย์: เป่ยหมิงมีปลา เรียกว่าคุน คุณตัวใหญ่มาก ไม่รู้ว่าใหญ่กี่พันลี้ ในยุคหมิงบันทึกภายในจวงจื้อกล่าวว่า: เป่ยหมิงอยู่ปักไฮ เพราะอยู่ไกลมากจนไม่มีคนไปถึง เรียกว่าดินแดนเสวียนหมิง ในทะเลมีคุน เพราะมีเสวียนหมิงถึงฟักสัตว์เทพได้ ถ้าไม่ใช่ทะเลที่ใหญ่อย่างปักไฮ ไม่อาจเลี้ยงดูคุนได้","ปลาเป่ยหมิง เรียกว่าคุน","คุณตัวใหญ่มาก ไม่รู้ว่าใหญ่กี่พันลี้","[สราญรมย์ฝันเมฆา]","ลบสถานะมึนของสมาชิกฝ่ายเรา",1,},
        [10] = {10,"กิเลนไฟอัสนี","กิเลนไฟอัสนี เป็นสี่สัตว์วิเศษร่วมกับหงส์เต่ามังกร ท่องเที่ยวไปทั่ว เป็นสิ่งมงคล ไม่เหยียบใบหญ้า ไม่แตะต้องแมลง แยกแยะดีชั่วในแผ่นดิน","สัตว์ที่เป็นสัญลักษณ์มงคล","แยกแยะดีชั่วในแผ่นดิน","[ฟ้าลิขิตหนีตาย]","สร้างดาเมจMax.HP50%ใส่สุ่มเป้าหมายฝ่ายศัตรู",1,},
        [11] = {11,"อสูรแก่นกิเลน","ว่ากันว่าเป็นสัตว์ดุร้ายวัยเยาว์ที่ปรากฏตัวบนโลกมนุษย์ตอนที่ใกล้ถึงกาลอวสาน ตาเป็นกระดิ่งทอง ไปมาเหมือนลม ตัวทอง มีอำนาจ; นิสัยร่าเริงเหมือนเด็ก ชอบความคึกคัก","ตัวเป็นสีทอง มีอำนาจ","นิสัยร่าเริงเหมือนเด็ก","[ประทัดตกฟ้า]","เป้าหมายที่เลือดต่ำกว่าค่าหนึ่งจะถูกฆ่า",1,},
        [12] = {12,"ไป๋เจ๋อสวรรค์","ไป๋เจ๋อสัญลักษณ์แห่งความเป็นมงคล รู้ภาษามนุษย์ รู้สรรพสิ่ง รู้เรื่องราวฟ้าดิน เป็นสัตว์มงลงที่ช่วยปัดร้ายเป็นดี","รู้เรื่องราวฟ้าดิน","ปัดร้ายเป็นดี","[แสงไหลพิรุณ]","ก่อนเริ่มรอบเนรเทศศัตรูเป้าหมาย",0,},
        [13] = {106,"เทพ·มังกรเขียว","มังกรเขียวทะเล หัวหน้าสี่อสูรเทพ เป็นสัญลักษณ์แห่งมงคลมาตั้งแต่โบราณ มังกรเขียวทิศตะวันออก มีเขาบนหัว พ่นเมฆ ลมหายใจเสียงสายฟ้า บินได้สูง ท่องไปทั่วสารทิศ","หัวหน้าสี่อสูรเทพ","เป็นสัญลักษณ์แห่งมงคลมาตั้งแต่โบราณ","[พิโรธมังกรเขียว]","ฟื้นฟูโทสะของสมาชิกฝ่ายเรา",0,},
    }
}

return pet