--pet_map

local pet_map = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --图鉴名称-string 
      show = 3,    --是否显示-int 
      show_day = 4,    --达到开服天数显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"ไอทิพย์อบอวน",1,1,},
        [2] = {2,"บรรยากาศอบอุ่น",1,1,},
        [3] = {3,"น้ำไฟขัดแย้ง",1,21,},
        [4] = {4,"สละชีพระบำจันทร์",1,21,},
        [5] = {5,"คบไฟเต็มฟ้า",1,21,},
        [6] = {6,"เขี้ยวมังกรสวรรค์",1,21,},
        [7] = {7,"ไผ่สะเทือนวิหค",1,21,},
        [8] = {8,"เมฆลอยเหนือฟ้า",1,21,},
        [9] = {9,"ไฟลามสายฟ้า",1,10,},
        [10] = {10,"หมื่นลักษณ์อสูร",1,10,},
        [11] = {11,"จันทราสายันต์",1,50,},
        [12] = {12,"จันทร์ลมเอื่อย",1,50,},
        [13] = {13,"ดาวตกแสงจ้า",1,50,},
        [14] = {14,"ตะวันเดือดเมฆา",1,50,},
        [15] = {15,"ทลายเพลิง",0,999,},
        [16] = {16,"พ่ออวิ๋น",0,999,},
        [17] = {17,"กลับร้ายเป็นดี",0,999,},
        [18] = {18,"สายฟ้าไฟปฐพี",0,999,},
    }
}

return pet_map