--play_horse_hero

local play_horse_hero = {
    -- key
    __key_map = {
      id = 1,    --序号-int 
      text_1 = 2,    --文本1-泰语-string 
      text_2 = 3,    --文本2-泰语-string 
      text_3 = 4,    --文本3-泰语-string 
      text_4 = 5,    --文本4-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เรียนยุทธ์กำราบเสือดาวได้ รวมปัญญาครองแผ่นดินได้ ขายาวชนะวิ่งแข่งได้!","เมื่อวานข้ามองท้องฟ้า ทำนาย วันนี้อันดับ1เป็นของข้าแน่","ข้าตระกูลสุมา จะแพ้ให้กับการแข่งนี้ได้อย่างไร","ใครกล้าวิ่งหน้าข้า ข้าจะตีด้วยไม้เท้าหัวนกฮูก",},
        [2] = {2,"อย่าเห็นว่าข้าอ้วน ข้ากลิ้งเร็วมากนะ!","ไม่เคยเห็นคนอ้วนวิ่งเร็วหรอ เดี๋ยวจะให้เจ้าได้เห็น","ข้าถือค้อนเหล็กก็วิ่งแซงเจ้าได้ เชื่อไหม!","ข้ามือเดียวลากวัวได้ร้อยก้าว แค่วิ่งแข่งไม่คณามือหรอก",},
        [3] = {3,"ให้พวกเจ้าได้เห็นหนุ่มรูปงามที่สุด ย่างก้าวคล่องแคล่วที่สุด","ข้ามีโล่ไร้เทียมทาน ตอนวิ่งอย่าคิดดึงชายเสื้อข้าได้","ข้าถนัดใช้ภูมิศาสตร์ สนามแข่งนี้ข้าศึกษาทะลุปรุโปร่งแล้ว","เพื่อการแข่งครั้งนี้ ข้าทำทรงผมใหม่เชียวนะ",},
        [4] = {4,"ข้าเป็นผู้หญิงเข้าร่วมการแข่ง ทุกคนออมมือให้ข้าหน่อยนะ","กล้ามาวิ่งไวกว่าข้า ต้องโดดหวด","ใต้เอวของข้าคือขาทั้งหมด วิ่งช้าได้หรอ!","เป็นลูกผู้ชายก็ออมมือให้ข้าวิ่งนำไปก่อนซักสองหลาสิ",},
        [5] = {5,"อย่าเห็นว่าข้าหน้าตาสั้นเล็ก เรื่องวิ่งข้าไม่แย่","ในห้าขุนพลพยัคฆ์แห่งวุยข้าไวที่สุด","ข้าเดินลัดเลาะในตลาดตั้งแต่เด็ก พลังขาดีมาก","กระซิบบอกเจ้าให้ ทุกครั้งอิกิ๋มวิ่งไม่ชนะข้าเลย",},
        [6] = {6,"อะไรหนักกว่า ชั่งดูก็รู้ ใครเร็วใครช้า แข่งกันดูก็รู้","การวิ่งทำให้สุขภาพแข็งแรง ไม่ป่วยง่าย","ท่านพ่อรักข้ามา ข้าจะทำให้ท่านพ่อขายหน้าไม่ได้","เมื่อวานข้ายังฝึกวิ่งแข่งกับพี่โจผี ข้าวิ่งไวไม่แพ้เขา",},
        [7] = {7,"ให้สุมาอี้ไสหัวไปข้างๆ! วันนี้ข้าจะต้องเป็นอันดับ1!","ชนะการแข่งครั้งนี้ ทำให้สุมาอี้ต้องข้ามองใหม่!","ถึงป่ายฮูหยินจะอ่อนเยาว์ แต่ไม่มีรสชาติเหมือนข้า!","ไร้มาไร้ไป ไม่โกรธไม่แค้น",},
        [8] = {8,"ฉายาวิถีสลาตันเป็นไง ถ้าชนะได้ต่อไปก็จะใช้ฉายานี้","อย่าไปฟังงักจิ้น คนที่วิ่งเร็วที่สุดในห้าขุนพลพยัคฆ์แห่งวุยคือข้า","เดี๋ยวจะให้พวกเจ้าได้เห็นฝีเท้าสลาตันของข้า","งักจิ้นบอกว่าข้าวิ่งสู้เขาไม่ได้หรอ ข้าจะฆ่าเขา",},
        [9] = {9,"ข้าคือนักฆ่า ความเร็วคือที่สุด!","วิ่งได้อันดับที่1 ข้าจะเอาเงินรางวัล ไปซื้ออุปกรณ์ใหม่!","ไม่ได้ฆ่าคนมานาน ดาบของข้าจะเป็นสนิมแล้ว!","วิ่งแข่งจบ ข้าก็จะขอไปฆ่าคนต่อ!",},
        [10] = {10,"โจโฉจะมาดูข้าแข่งไหม?","ข้าสุขภาพอ่อนแอ ไม่ถนัดเรื่องการแข่งขัน","รู้เรื่องสนุกในบ้าน ถึงรู้เรื่องสนุกของชีวิต","การแข่งมีอะไรสนุก ทำไมไม่แข่งแล้วค่อยมาหาข้า",},
        [11] = {11,"เจ็ดเข้าเจ็ดออก ด้านความเร็วข้าไวที่สุด!","ทุกคนจำไว้ ข้าคือชายชาตรีที่ได้รับการยกย่องว่าขุนพลชนะรัว","ข้าอุ้มตุ๊กตา ก็วิ่งชนะพวกเจ้าได้","ในแผ่นดินกลียุค ขาไวเป็นอันดับ1!",},
        [12] = {12,"ในฐานะหัวหน้าขุนพลห้าพยัคฆ์ เทพนักรบ ไม่เอาที่หนึ่งมาขายขี้หน้าแย่","ตอนหนุ่มทำผิดที่หนีรอดมาถึงอิวจิ๋วจัวจวิ้นได้ ก็เพราะวิ่งไวนี่แหละ","เหล้าอุ่นสังหารฮัวหยงแน่แค่ไหน เดี๋ยวข้าจะอุ่นเหล้าเอาที่1มา","ข้าคือชายที่ขี่ม้าเซ็กเธาว์ จะวิ่งช้าได้อย่างไร!",},
        [13] = {13,"ข้าคำรามทีเดียว ก็จะทำใหพวกเจ้าสั่นจนล้มแล้ว","ไว้ข้าดื่มเหล้าเสร็จแล้ว ค่อยมาแข่งกับพวกเจ้าอีกที","ใครบอกว่าคนฆ่าสัตว์เอาที่1มาไม่ได้ วันนี้ข้าจะให้พวกเขาได้เปิดหูเปิดตา","ข้าเตียวหุยชาวเยียนวันนี้จะต้องได้อันดับ1 ใครก็อย่ามาขวาง!",},
        [14] = {14,"ตั้งแต่เด็กก็เป็นชายชาตรีม้าเกราะ ม้าสง่าทะยานบิน","ฮองตงมาแล้วหรอ รีบใช้สกิลที่เหมาะสมยิงข้าออกมาสิ!","บอกตามตรง ในขุนพลห้าพยัคฆ์ข้าวิ่งไวที่สุด","เจ้าดูข้าแซ่ม้า แค่นี้ก็รู้ว่าข้าวิ่งไวเหมือนม้า",},
        [15] = {15,"ในเผ่า ข้าวิ่งไวที่สุด","ใครเรียกพวกเราว่าคนเถื่อนอีก? แน่จริงก็มาประลองกับข้าสิ!","อย่าเอ่ยเรื่องจับ7เบ้งเฮ็กกับข้า ให้จูกัดเหลียงออกมา พวกเรามาวิ่งแข่งกัน","ด้านกลยุทธ์อาจจะสู้กุนซือไม่ได้ แต่ด้านวิ่งก็ไม่แน่!",},
        [16] = {16,"ดูหางของข้าเซ็กซี่ไหม!","ถึงเป็นสตรี แต่ข้าวิ่งไม่แพ้พวกเจ้านะ","ข้าขึ้นเขาจับกระต่ายตั้งแต่เด็ก ฝีมือฝีเท้าว่องไวมาก","ให้จูกัดเหลียงออกมา ข้าจะแก้แค้นจับ7ปล่อย7ให้ท่านพี่ในสนามแข่ง",},
        [17] = {17,"ฆ่าๆแกงๆไม่เห็นดี วิ่งแข่งสนุกกว่า","ข้าเขวี้ยงแพนด้าข้ามเส้นชัย ถือว่าข้าชนะไหม?","คุณธรรมปกครองแผ่นดิน การแข่งสำคัญที่เข้าร่วม","รีบเริ่มการแข่ง จบแล้วข้าจะไปกอดแพนด้า",},
        [18] = {18,"คนมาดูการแข่งเยอะจัง เขินแฮะ!","นายท่าน นายท่าน เตียวซีต้องวิ่งแชมป์มาให้ท่านได้แน่!","อืม คนมากมายมาแข่งขัน กลัวนิดหน่อย","คนตั้งเยอะ ระวังเป็นลม!",},
        [19] = {19,"บิดาพยัคฆ์ไม่มีบุตรีสุนัข ข้าคุณหนูสามตระกูลกวนไม่ใช่ขี้ๆ","ข้ากวนอิ๋นผิงฉลาดงดงาม มีฝีมือยุทธ์ ครั้งนี้จะเอาอันดับ1มาให้ท่านพ่อ","ซักวันหนึ่งข้าจะแซงพ่อให้ได้ เริ่มจากอันดับ1ในวันนี้แหละ!","วันนี้ข้าต้องวิ่งได้อันดับ1แน่ ให้ท่านพ่อได้ภูมิใจ",},
        [20] = {20,"ข้าเชี่ยวชาญการขี่ม้ามาตั้งแต่เด็ก ฝีมือวิ่งทำอะไรข้าไม่ได้หรอก!","นายท่าน ข้าต้องวิ่งเอาแชมป์กลับมาให้ท่านแน่!","ยังนับเวลาถอยหลังอยู่หรอ? เริ่มไวไวได้ไหม!","ข้าจะเอาที่1มาพิสูจน์ตนเอง!",},
        [21] = {21,"ข้าคือป้าอ๋องน้อยแห่งกังตั๋งซุนเซ็ก!","ลูกหลานกังตั๋ง ใยต้องกลัวแผ่นดิน!","ข้าซุนเซ็กวันนี้จะชิงอันดับ1มา!","ชาวกังตั๋ง ดูดีดีนะ!",},
        [22] = {22,"ดวงอาทิตย์แรงขนาดนี้ ตากแดดจนดำจะทำยังไง? ดีที่มีร่มบงกชปกป้อง!","ชาวป๋อฝู ที่บอกว่าจะมาเชียร์ข้าล่ะ","ชนะการแข่งก็แพ้เรื่องชีวิต พวกเจ้ากล้าชนะข้าหรอ?","เดี๋ยวช่วยข้าดูหน่อย ข้าวิ่งน่ามองไหม",},
        [23] = {23,"หึ อย่าดูถูกเด็กผู้หญิงนะ!","จิวยี่บอกว่า วิ่งแพ้หรือชนะไม่สำคัญ สนุกก็พอแล้ว!","ฮิฮิ พัดคู่ดาวของข้าต้องช่วยให้ข้าได้แชมป์แน่!","แพ้ชนะไม่สำคัญ มีความสุขสำคัญที่สุด!",},
        [24] = {24,"ที่นี่ เป็นดินแดนของข้ากำเหลง!","พื้นที่ของข้า ข้าต้องเอาแชมป์มาได้แน่!","ภายใต้ความโกรธของข้าใบแพร พวกเจ้าเป็นแค่สวะ!","ข้ากำเหลงต้องสลักชื่อตัวเองลงบนถ้วยแชมป์ให้ได้!",},
        [25] = {25,"ท่าทางงามสง่า ห้ามขมวดคิ้ว!","ทำสงครามสนามรบยังไม่กลัว แต่ลู่วิ่งเล็กๆจะกลัวอะไร","ถึงพี่ชายอยู่ด้วย ข้าก็ไม่ยอมแพ้! การแข่งขัน ต้องพยายามเต็มที่!","ถ้าข้าวิ่งไวไป เล่าปี่จะตามจับข้าไม่ทันหรอ",},
        [26] = {26,"กองเชียร์เบาเสียงหน่อยได้ไหม ข้าหูจะแตกแล้ว!","มอบเมฆให้ข้า ข้าสามารถวิ่ง108000ลี้ให้เจ้าดู!","ใครรังแกเพราะเห็นว่าข้าเด็ก ข้าจะวิ่งเอาที่1มาให้เขาดู!","ฮ่าๆ วันนี้ข้าต้องเอาที่1มาให้ได้!",},
        [27] = {27,"ใจข้าหนักแน่น ดั่งจันทราชั่วนิรันดร์","น้องสาวร้องเพลงดีดพิณ ชีวิตวัยเยาว์ใครไม่โหยหา","บุรุษสำราญ บ้านเมืองสงบสุข","น้องสาวเหมือนด้ายท่านพี่เหมือนเข็ม เกี่ยวพันไม่แยกจาก",},
        [28] = {28,"เหลวไหลขนาดนี้เชียว? ให้ข้าคนตาบอกมาวิ่งแข่ง!","นี่ ถ้าเผลอไปวิ่งในลู่ของคนอื่นถือว่าชนะไหม?","ใครวางกำดักข้า แจ้งชื่อมา?","พวกเจ้าช่วยข้าดูหน่อย นี่คือกีฬาคนพิการหรอ?",},
        [29] = {29,"ถือโคมไฟวิ่ง หล่อไหม?","ซุนกวนบอกว่าหน้าข้าคล้ายลา พวกเจ้าคิดว่าไง?","ข้าคนตระกูลขงเบ้ง คนเก่งมากมาย!","ขงเบ้งบอกว่าต้องมีปณิธานยิ่งใหญ่ ไม่อยากได้ที่1 จะมาเข้าร่วมการแข่งทำไม",},
        [30] = {30,"เตียวเสี้ยนของข้าล่ะ? เซ็กเธาว์ของข้าล่ะ?","ข้าเทพสงครามลิโป้ถึงไม่ขี่ม้า ก็เอาชนะพวกเจ้าได้","ถึงพวกเจ้าขี่ม้าก็ชนะข้าไม่ได้!","ทั้งแผ่นดินนี้เป็นของข้าลิโป้ แค่สนามแข่งเล็กๆจะเหลือหรอ!",},
        [31] = {31,"ฮือๆๆ…ข้าจะพยายามเต็มที่ ไม่ให้ท่านลิโป้ผิดหวัง","ใครรับข้าอยู่ที่จุดหมาย?","ข้าคิดถึงท่านลิโป้","ไม่ว่าแพ้หรือชนะ ลิโป้ก็รับข้าเหมือนเดิม!",},
        [32] = {32,"ฮ่าๆ เลือกข้าไท้ซือ เจ้ามีสายตาดีนะ!","ไว้ได้อันดับที่1แล้ว ข้าจะเลี้ยงเหล้าอาหารสาวงาม!","ใครกล้าวิ่งหน้าข้าไท้ซือ ฆ่ามัน!","พวกเราชาวเลียงจิ๋ว ไม่เคยกลัวแพ้อยู่แล้ว!",},
        [33] = {33,"เดี๋ยวใครกล้าเข้าใกล้ข้า ข้าจะใส่พิษให้เขาตาย!","พวกเจ้ามาแข่งขันใช่ไหม ข้าอิเกียดมาจับหุ่นเชิดของข้า!","หุ่นเชิดเล็กๆมีพิษเต็มท้อง เข้าใกล้พวกเราระวังถูกพิษตาย!","มีกลวิธีเวทมนต์ ชนะการแข่งอย่างสบาย!",},
        [34] = {34,"ใครกล้าแย่งลัญจกรแผ่นดินของข้า? ใครกล้าชนะข้า?","ข้าคือลูกเมียเอกตระกูลอ้วน วันนี้ต้องได้อันดับ1แน่!","ใครชิงที่1 แต่งตั้งครองเมือง!","บาทาเทพเศษฟ้าของข้า วิ่งได้ไวเป็นพิเศษ!",},
        [35] = {35,"พิณหัวหน้าหนักจัง วันนี้จะได้อันดับ1ไหม?","ข้าดีดพิณได้ วาดภาพได้ คัดอักษรได้ เจ้าจะให้ข้าลงสนามจริงหรอ?","ได้ยินเสียงที่คุ้นเคย ทำให้ข้านึกถึงตอนเด็ก","ชีวิตสั้นนัก มาเข้าร่วมการแข่งขันอย่างมีความสุขจะดีกว่า",},
        [36] = {36,"ขอแค่ลิโป้ไม่อยู่ ข้าต้องได้ที่1แน่!","ถ้าวันนี้ชนะการแข่ง งานใหญ่ก็มีโอกาส!","ข้าวิ่งชนะลิโป้ได้ เจ้าเชื่อไหม?","ใครได้แชมป์วันนี้ ข้าจะสนับสนุนเขา!",},
        [37] = {37,"ข้าขี่ม้าไม้ไผ่ ใครจะวิ่งได้ไวเท่าข้า!","มามามา มอบสาลี่ให้เจ้า เจ้าออมมือให้ข้าหน่อยได้ไหม","ทายาทคนดัง ต้องได้อันดับ1!","อาเต๊าล่ะ ไว้วิ่งแข่งเสร็จแล้วข้าจะไปเล่นแพนด้าน้องของเขา",},
        [38] = {38,"บิดาข้าคือเทพสงครามลิโป้! ดังนั้นข้าจะไม่ยอมแพ้!","ข้าแค่อยากออกทัพฆ่าศัตรู! เข้าร่วมการแข่งมันกระจอกเกินไปไหม!","ท่านพ่อรับปากข้า วิ่งชนะจะไม่ต้องแต่งงานกับลูกชายของอ้วนสุด!","ไว้ข้าได้แชมป์แล้ว ข้าจะเอาถ้วยไปให้ท่านพ่อใช้เป็นจอกเหล้า!",},
        [39] = {39,"รสชาติที่ไร้ลูกหลานสืบสกุล อยากลองไหม?","หึว วิ่งแข่งไม่ชนะ ข้าจะฆ่าเจ้า!","โฮจิ๋นคิดจะฆ่าข้า ข้าต้องวิ่งไวอีกหน่อย!","ตั๋งโต๊ะจะเข้าเมืองแล้ว ทุกคนรีบวิ่ง!",},
        [40] = {40,"เดี๋ยวใครกล้าวิ่งอยู่หน้าข้า จ้าจะตีให้ร้องขอชีวิตเลย!","แค๊กๆ ข้าขอพูดหน่อยนะทุกคน พวกเจ้าเอาชนะข้าไม่ได้หรอก!","รูปร่างอย่างข้า ดูก็รู้ว่าต้องเป็นแชมป์","ผู้กล้าไม่กลัว ข้าต้องเอาที่1มาให้ได้!",},
    }
}

return play_horse_hero