--play_horse_bubble

local play_horse_bubble = {
    -- key
    __key_map = {
      rank = 1,    --名次-int 
      text_1 = 2,    --文本1-string 
      text_2 = 3,    --文本2-string 
      text_3 = 4,    --文本3-string 
      text_4 = 5,    --文本4-string 
      text_5 = 6,    --文本5-string 
      text_6 = 7,    --文本6-string 
      text_7 = 8,    --文本7-string 
      text_8 = 9,    --文本8-string 
      text_9 = 10,    --文本9-string 
      text_10 = 11,    --文本10-string 
      text_11 = 12,    --文本11-string 
      text_12 = 13,    --文本12-string 
    
    },
    -- data
    _data = {
        [1] = {1,"เปิดรอบคนแรก คนแรกแน่นอน","พวกเจ้าพักเถอะ อันดับหนึ่งข้าขอล่ะ","พวกเขาวิ่งช้ามาก ไม่ใช่คู่ต่อสู้ของข้า","อาหารวันนี้ไม่เลว ต้องเอาอันดับหนึ่งมาให้ได้!","ใต้ขามีลม เคยได้ยินไหม?","ได้เวลาแสดงฝีมือที่แท้จริงแล้ว","ขาพวกเจ้ากรอกตะกั่วไว้หรอ ทำไมช้าจัง!","ลุยเลย พี่101รีบมาเชียร์ข้าเถอะ!","ด้านหน้าก็คือจุดหมายแล้ว อันดับที่1ต้องเป็นของข้าแน่นอน","ข้าเกิดปีกระต่าย พวกเจ้าเป็นปีเต่า ฮ่าๆๆๆ!","อย่าแย่ง อันดับหนึ่งจะเป็นของข้าแล้ว!","บุก ชัยชนะกวักมือเรียกข้าอยู่!",},
        [2] = {2,"เปิดรอบวิ่งทำไมไวไว ออมแรงบุกบ้าง!","ออมมือให้เจ้าก้าวหนึ่ง ไว้ข้าทุ่มพลังเต็มทีต้องตามเจ้าทันแน่","อย่าอวดดีนัก ข้าจะตามเจ้าทันแล้ว!","วิ่งเสร็จก็ไปดื่มกิน ฟังเพลง เอาไหม?","ข้ายังไม่ได้ใช้พลังเต็มที่","วันนี้เจ้าไม่ใช่ที่หนึ่ง ก็ข้าเป็นที่สอง…","ห่างจากอันดับ1แค่ช่วงตัวเดียว พยายามไล่ตามเร็ว!","ท่านดูรูปร่างอย่างข้า ต้องได้ลำดับที่ดีแน่!","นอกจากอันดับที่1 อันดับที่2กับอันดับที่5เหมือนจะไม่ต่างกัน","ข้าจะไม่เป็นที่สอง!","ฮึดสู้ครั้งสุดท้าย อ้าๆๆ!","ขาดอีกนิดเดียว ข้าไม่ยอม!",},
        [3] = {3,"ข้าจะออมมือให้พวกเจ้า อย่าดีใจเกินไปนัก","ข้ากำลังรวบรวมกำลัง เจ้าเข้าใจไหม","พวกเจ้าไม่สนใจข้าหรอ ข้าอาจจะเป็นม้ามืดก็ได้","…วิ่งก็วิ่งสิ พวกเจ้าพูดพล่ามอยู่ได้!","สนามแข่งยังมีอีกครึ่งหนึ่ง มาบอกชนะตอนนี้เร็วเกินไป","อย่าดูถูกเท้าทะยานคลื่นของข้า จะตามพวกเจ้าได้ทันแน่","ข้างหน้าสองคนนั่นคอยข้าก่อน!","บางคนน่ะ ตัวเองวิ่งไม่ไหว แล้วโทษคนอื่น","ข้างหน้าน่ะ ข้าจะตามเจ้าทันแล้ว!","สู้ๆ ได้ที่สามมาก็ไม่เลว!","ข้าไม่เป็นอันดับสาม ไม่ได้!","ครั้งนี้แพ้ไม่เป็นไร ครั้งหน้ายังมีโอกาส!",},
        [4] = {4,"ไม่ได้ไม่ได้ ทำไมข้าเป็นที่สองจากบ๊วยล่ะ!","อุปกรณ์บนตัวข้าหนัก ไว้ข้าถอนออกหน่อยแล้วก็จะตามทัน","ตอนสตาร์ทพลาดไปหน่อย เดี๋ยวข้าจะทุ่มพลังช่วยท้าย","อย่าดูถูกที่ข้าช้า ข้าพยายามแล้ว","อย่าดูถูกข้า ใครบ้างที่ไม่เคยพลาด","ข้างหน้าช้าหน่อย ตำลึงของพวกเจ้าตกแล้ว","มีคำพูดว่าภายหลังต้องดีกว่า เชื่อข้า","ทีมงานสารเลว จุดหมายไกลขนาดนี้ คิดจะให้ข้าเหนื่อยตายหรอ?","แย่แล้ว รู้สึกว่าตัวเองเบียดไม่ถึง3อันดับแรกแล้ว น่าแค้นใจ","อ้าอ้าอ้าอ้าอ้า ตีให้ตายก็ไม่ยอมเป็นอันดับบ๊วย","จะถึงจุดหมายแล้ว น่าจะไม่ต้องเป็นอันดับสุดท้าย","ชีวิตลำบากอย่าไปบอกใคร ขอแค่ได้เข้าร่วม ฮ่าๆๆ!",},
        [5] = {5,"เริ่มช้า ไม่ได้แสดงว่าจะช้าไปตลอด","อย่าเป็นว่าตอนนี้ข้าอยู่ที่5 ไม่แน่ว่าสุดท้ายข้าจะเป็นที่1!","ข้าเคยฝึกมา อย่าคิดว่าข้าวิ่งไม่เร็ว","อาหารวันนี้ไม่เลว กินเยอะไปเลยวิ่งไม่ไหว","เฮ้อๆๆๆ เหนื่อยจังวิ่งไม่ไหวแล้ว","ข้างหน้าคอยข้าหน่อย!","รูแต่แรกจะไม่ร้องเพลงตอนกลางคืน รู้สึกเหนื่อยจัง","ข้าเหนื่อยจัง กลับบ้านต้องไปกินน่องไก่บำรุง!","เมื่อวานใครใส่ยาถ่ายให้ข้า? ขาไม่มีแรง วิ่งไม่ไหว","พวกเจ้าวิ่งช้าหน่อย ข้าจะหลุดจอแล้ว","พวกเจ้ากินยาเซียนมาหรือไง วิ่งไวขนาดนี้!","มองอะไร? ข้าใช้ฝีมือถึงวิ่งมาเป็นอันดับที่5!",},
    }
}

return play_horse_bubble