--qin_monster

local qin_monster = {
    -- key
    __key_map = {
      id = 1,    --boss序号-int 
      small_name = 2,    --普通怪物名称-string 
      big_name = 3,    --普通怪物名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ทหารเกราะจิ๋นซี","มารฝันสุสาน",},
        [2] = {2,"ทหารเกราะจิ๋นซี","มารฝันสุสาน",},
        [3] = {3,"ทหารเกราะจิ๋นซี","มารฝันสุสาน",},
        [4] = {4,"พลเท้าจิ๋นซี","มารฝันสุสาน",},
        [5] = {5,"พลเท้าจิ๋นซี","มารฝันสุสาน",},
        [6] = {6,"พลเท้าจิ๋นซี","มารฝันสุสาน",},
        [7] = {7,"ทหารจิ๋นซี","มารฝันสุสาน",},
        [8] = {8,"ทหารจิ๋นซี","มารฝันสุสาน",},
        [9] = {9,"ทหารจิ๋นซี","มารฝันสุสาน",},
    }
}

return qin_monster