--qin_point

local qin_point = {
    -- key
    __key_map = {
      point_id = 1,    --id（类型坑点）-int 
      name = 2,    --皇陵内位置-string 
    
    },
    -- data
    _data = {
        [1] = {101,"",},
        [2] = {201,"",},
        [3] = {202,"",},
        [4] = {203,"",},
        [5] = {204,"",},
        [6] = {205,"",},
        [7] = {206,"",},
        [8] = {207,"",},
        [9] = {208,"",},
        [10] = {209,"",},
        [11] = {210,"",},
        [12] = {211,"",},
        [13] = {212,"",},
        [14] = {301,"สุสานจิ๋นซี·1",},
        [15] = {302,"สุสานจิ๋นซี·1",},
        [16] = {303,"สุสานจิ๋นซี·1",},
        [17] = {304,"สุสานจิ๋นซี·2",},
        [18] = {305,"สุสานจิ๋นซี·2",},
        [19] = {306,"สุสานจิ๋นซี·2",},
        [20] = {307,"สุสานจิ๋นซี·3",},
        [21] = {308,"สุสานจิ๋นซี·3",},
        [22] = {309,"สุสานจิ๋นซี·3",},
        [23] = {401,"สุสานจิ๋นซี·1",},
        [24] = {402,"สุสานจิ๋นซี·1",},
        [25] = {403,"สุสานจิ๋นซี·1",},
        [26] = {404,"สุสานจิ๋นซี·2",},
        [27] = {405,"สุสานจิ๋นซี·2",},
        [28] = {406,"สุสานจิ๋นซี·2",},
        [29] = {407,"สุสานจิ๋นซี·3",},
        [30] = {408,"สุสานจิ๋นซี·3",},
        [31] = {409,"สุสานจิ๋นซี·3",},
        [32] = {501,"สุสานจิ๋นซี·1",},
        [33] = {502,"สุสานจิ๋นซี·1",},
        [34] = {503,"สุสานจิ๋นซี·1",},
        [35] = {504,"สุสานจิ๋นซี·2",},
        [36] = {505,"สุสานจิ๋นซี·2",},
        [37] = {506,"สุสานจิ๋นซี·2",},
        [38] = {507,"สุสานจิ๋นซี·3",},
        [39] = {508,"สุสานจิ๋นซี·3",},
        [40] = {509,"สุสานจิ๋นซี·3",},
        [41] = {601,"สุสานจิ๋นซี·1",},
        [42] = {602,"สุสานจิ๋นซี·1",},
        [43] = {603,"สุสานจิ๋นซี·1",},
        [44] = {604,"สุสานจิ๋นซี·2",},
        [45] = {605,"สุสานจิ๋นซี·2",},
        [46] = {606,"สุสานจิ๋นซี·2",},
        [47] = {607,"สุสานจิ๋นซี·3",},
        [48] = {608,"สุสานจิ๋นซี·3",},
        [49] = {609,"สุสานจิ๋นซี·3",},
    }
}

return qin_point