--resource

local resource = {
    -- key
    __key_map = {
      id = 1,    --资源id-int 
      name = 2,    --资源名称-string 
      description = 3,    --道具描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ตำลึง","ต้องสร้างผลงาน จะรับสมัครขุนพลและไอเทมได้",},
        [2] = {2,"เงินทอง","เงินตรา อัปเกรดอุปกรณ์, ทะลวงขุนพลต่างก็ใช้ได้",},
        [3] = {3,"กำลัง","เมื่อท้ารบสายหลัก, มือเอก, ดันเจี้ยนยอดขุนพลจะใช้กำลัง.",},
        [4] = {4,"สติ","เมื่อพเนจรจะใช้ทรัพยากรที่สำคัญ",},
        [5] = {5,"EXP","ท้ารบดันเจี้ยนสายหลัก พเนจรและดำเนินการผจญภัยจะได้รับEXP",},
        [6] = {6,"VIP EXP","อัปเลเวลVIPจะปลดล็อคฟังก์ชั่นVIPได้เพิ่มเติม",},
        [7] = {7,"บารมี","แลกเศษขุนพลหรือยาทะลวงได้ที่สนามประลองร้าน",},
        [8] = {8,"คุณูปการ","แลกศาสตราหรือหินเลื่อนขั้นศาสตราวุธได้ที่ร้านศาสตราวุธ",},
        [9] = {9,"จิตขุนพล","แลก ยาทะลวง เงินทองและตู้คังได้ที่ร้านขุนพลเทพ",},
        [10] = {10,"เหล็กหล่อ","แลกอุปกรณ์และหินสกัดอุปกรณ์ได้ที่ร้านอุปกรณ์",},
        [11] = {11,"ป้ายหนานหมาน","สิทธิ์ที่ใช้ในการโจมตีหนานหมาน",},
        [12] = {12,"สิทธิ์ท้ารบ","จำนวนท้ารบฝ่าด่านสังหารขุนพล ฝ่าด่านสังหารขุนพลจะได้รับอุปกรณ์มากมาย",},
        [13] = {13,"อุทิศกองทัพ","แลกขุนพลหรือไอเทมมูลค่าสูงได้ที่ร้านกองทัพ",},
        [14] = {14,"จิตเทพ","ไอเทมที่ใช้แลกเมื่อปลุกที่ร้านปลุก",},
        [15] = {15,"จิตศาสตราวุธ","รีไซเคิลศาสตราจะได้รับ สามารถแลกศาสตราและหินเลื่อนขั้นศาสตราวุธได้ที่ร้านศาสตราวุธ",},
        [16] = {16,"ค่าเติมเงิน","เมื่อใช้จะได้รับค่าเติมเงินในกิจกรรมเติมเงินสะสม เติมเงินยอดเดียว",},
        [17] = {17,"จิตสมบัติ","สามารถแลกสมบัติและหินเลื่อนขั้นสมบัติได้ที่ร้านสมบัติ",},
        [18] = {18,"ชื่อเสียงกองทัพ","ชื่อเสียงกองทัพสะสมสามารถอัปเลเวลกองทัพได้",},
        [19] = {19,"จิตอสูร","สามารถแลกอสูรเทพหรือทรัพยากรที่เกี่ยวกับอสูรเทพได้ที่ร้านอสูรเทพ",},
        [20] = {20,"คริสตัล","เติมเงินจะได้รับทรัพยากรขั้นสูง ใช้ได้ในร้านคริสตัล",},
        [21] = {21,"คะแนนเติมเงิน","เติมเงินได้รับคะแนนเติมเงิน ได้รับรางวัลมากมายที่ร้านคริสตัล",},
        [22] = {22,"เสบียง","เสบียงที่ใช้เคลื่อนย้ายในศึกแร่",},
        [23] = {23,"ป้ายโจมตี","โจมตีแต่ละครั้งในศึกแร่จะใช้จำนวนครั้งโจมตี1ครั้ง",},
        [24] = {24,"เศษแปลงร่าง","สามารถแลกการ์ดแปลงร่างได้ที่ร้านค้าการ์ดแปลงร่างในช่วงกิจกรรมแปลงร่างสกิน",},
        [25] = {25,"สิทธิ์ไล่โจมตี","ในช่วงกิจกรรมตัดหนวดหนีตาย ไล่โจมตีโจโฉจะได้รับรางวัลต่างๆ",},
        [26] = {26,"สิทธิ์ชมดาว","สามารถชมดาวได้รับรางวัลต่างๆในช่วงกิจกรรมมังกรหลับชมดาว",},
        [27] = {27,"ค่าเติมเงินเฉพาะ","ใช้จะได้รับเติมเงินสะสม มูลค่าเติมเงินเฉพาะในเติมเงินยอดเดียวกิจกรรม",},
        [28] = {28,"จิตม้า","แลกม้าศึกได้ที่ร้านม้าศึก",},
        [29] = {29,"เหรียญดาบ","สามารถแลกชุดแดงและถุงสีแดงได้ในร้านราชา",},
        [30] = {30,"จิตหยก","แลกหินดิบได้ที่ร้านหินดิบ",},
        [31] = {31,"ผลงาน","แลกทรัพยากรหายากได้ที่ร้านกิจกรรมเค้ก",},
        [32] = {32,"จิตมังกร","แลกทรัพยากรหายากได้ที่ร้านค้ากิจกรรมพบมังกรในทุ่ง",},
    }
}

return resource