--return_privilege

local return_privilege = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      privilege_txt = 2,    --特权说明-string 
      button_txt = 3,    --按钮文字-string 
    
    },
    -- data
    _data = {
        [1] = {1,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [2] = {2,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [3] = {3,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [4] = {4,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [5] = {5,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [6] = {6,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [7] = {7,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [8] = {8,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [9] = {9,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [10] = {10,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
        [11] = {11,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [12] = {12,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [13] = {13,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [14] = {14,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [15] = {15,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [16] = {16,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [17] = {17,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [18] = {18,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [19] = {19,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [20] = {20,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
        [21] = {21,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [22] = {22,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [23] = {23,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [24] = {24,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [25] = {25,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [26] = {26,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [27] = {27,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [28] = {28,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [29] = {29,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [30] = {30,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
        [31] = {31,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [32] = {32,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [33] = {33,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [34] = {34,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [35] = {35,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [36] = {36,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [37] = {37,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [38] = {38,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [39] = {39,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [40] = {40,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
        [41] = {41,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [42] = {42,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [43] = {43,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [44] = {44,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [45] = {45,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [46] = {46,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [47] = {47,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [48] = {48,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [49] = {49,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [50] = {50,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
        [51] = {51,"รีเซ็ตดันเจี้ยนรายวัน","รีเซ็ต|ไปต่อสู้",},
        [52] = {52,"รีเซ็ตฝ่าด่านสังหารขุนพล","รีเซ็ต|ไปต่อสู้",},
        [53] = {53,"บุกดันเจี้ยนสายหลักได้รับรางวัล2เท่า","ไปต่อสู้",},
        [54] = {54,"บุกดันเจี้ยนมือเอกได้รับรางวัล2เท่า","ไปต่อสู้",},
        [55] = {55,"บุกดันเจี้ยนยอดขุนพลได้รับรางวัล2เท่า","ไปต่อสู้",},
        [56] = {56,"EXPสมบัติสองเท่าและเงินทองพเนจร","ไปพเนจร",},
        [57] = {57,"บูชากองทัพและชื่อเสียงกองทัพวันนี้สองเท่า","ไปกองทัพ",},
        [58] = {58,"รางวัลได้รับจากเช็คชื่อรายวันสองเท่า","ไปรับ",},
        [59] = {59,"รางวัลได้รับจากสมบูรณ์พูนสุขสองเท่า","ไปรับ",},
        [60] = {60,"รางวัลภารกิจรายวันสองเท่า","ไปรับ",},
    }
}

return return_privilege