--seven_days_discount

local seven_days_discount = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --物品名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"อุปกรณ์สีฟ้า1เซ็ต(4ชิ้น)",},
        [2] = {2,"หีบเลือกพิชัยยุทธ์สีส้ม",},
        [3] = {3,"หินสกัดขั้นสูงx40",},
        [4] = {4,"เลือกศาสตราสีฟ้าใดก็ได้+คุณูปการ+หินเลื่อนขั้นศาสตราวุธ",},
        [5] = {5,"ศาสตราวุธสารพัดนึกสีส้มx5",},
        [6] = {6,"หีบเลือกตราทหารสีส้ม",},
        [7] = {7,"ถุงแพรกวนอู",},
    }
}

return seven_days_discount