--seven_days_admin

local seven_days_admin = {
    -- key
    __key_map = {
      day = 1,    --天数-int 
      name = 2,    --页签名称-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"โบนัสรายวัน",},
        [2] = {1,"ตันเจี้ยน\nสตอรี่",},
        [3] = {1,"อัปอุปกรณ์",},
        [4] = {1,"ครึ่งราคา",},
        [5] = {2,"โบนัสรายวัน",},
        [6] = {2,"พเนจรและ\nประลอง",},
        [7] = {2,"อัปเลเวล\nสมบัติ",},
        [8] = {2,"ครึ่งราคา",},
        [9] = {3,"โบนัสรายวัน",},
        [10] = {3,"ผ่านด่าน\nฆ่าขุนพล",},
        [11] = {3,"สกัดอุปกรณ์",},
        [12] = {3,"ครึ่งราคา",},
        [13] = {4,"โบนัสรายวัน",},
        [14] = {4,"หนานหมาน\nบุกรุก ",},
        [15] = {4,"เลื่อนขั้น\nศาสตราวุธ",},
        [16] = {4,"ครึ่งราคา",},
        [17] = {5,"โบนัสรายวัน",},
        [18] = {5,"ร้านค้าขุนพล",},
        [19] = {5,"อัปเลเวล\nและทะลวง",},
        [20] = {5,"ครึ่งราคา",},
        [21] = {6,"โบนัสรายวัน",},
        [22] = {6,"BOSSกองทัพ",},
        [23] = {6,"สกัดสมบัติ",},
        [24] = {6,"ครึ่งราคา",},
        [25] = {7,"โบนัสรายวัน",},
        [26] = {7,"พลังรบรวม",},
        [27] = {7,"สมุดขุนพล",},
        [28] = {7,"ครึ่งราคา",},
    }
}

return seven_days_admin