--shop_crystal

local shop_crystal = {
    -- key
    __key_map = {
      good_id = 1,    --商品id-int 
      description = 2,    --说明-越南语-string 
      pay_amount = 3,    --条件值_math-int 
      size_2 = 4,    --奖励数量2_math-int 
      is_work = 5,    --开关_math-int 
    
    },
    -- data
    _data = {
        [1] = {101,"วันนี้เติมเงินยอดเดียว#num#ตำลึง",60,60,1,},
        [2] = {102,"วันนี้เติมเงินยอดเดียว#num#ตำลึง",300,300,1,},
        [3] = {103,"สัปดาห์นี้เติมเงินยอดเดียว#num#ตำลึง",900,900,1,},
        [4] = {104,"เข้าร่วมBOSSกองทัพ12น.",1,0,1,},
        [5] = {105,"เข้าร่วมBOSSกองทัพ19น.",1,0,1,},
        [6] = {106,"เข้าร่วมทดสอบกองทัพ",1,0,1,},
        [7] = {107,"เข้าร่วมตอบคำถามกองทัพ",1,0,1,},
        [8] = {108,"เข้าร่วมศึกสามก๊ก",1,0,1,},
        [9] = {109,"เข้าร่วมประลองค่าย",1,0,0,},
        [10] = {110,"สัปดาห์นี้เติมเงินยอดเดียว#num#ตำลึง",1800,1800,1,},
        [11] = {111,"เข้าร่วมกิจกรรมตอบคำถาม",1,0,1,},
        [12] = {201,"วันนี้เติมเงินยอดเดียว#num#ตำลึง",60,60,0,},
    }
}

return shop_crystal