--shop

local shop = {
    -- key
    __key_map = {
      shop_id = 1,    --商店ID-int 
      shop_name = 2,    --商店名称-string 
      tab_name1 = 3,    --页签名称-string 
      tab_name2 = 4,    --页签名称-string 
      tab_name3 = 5,    --页签名称-string 
      tab_name4 = 6,    --页签名称-string 
      tab_name5 = 7,    --页签名称-string 
      price4_type = 8,    --商店代币类型4-int 
      price4_value = 9,    --代币4-int 
    
    },
    -- data
    _data = {
        [1] = {1,"มอลล์","ไอเทม","สินค้า","","","",0,0,},
        [2] = {2,"ร้านอุปกรณ์","ไอเทม","ชุดม่วง","ชุดส้ม","รางวัล","",0,0,},
        [3] = {3,"ร้านศาสตรา","ไอเทม","","","","",0,0,},
        [4] = {4,"ร้านประลอง","ไอเทม","ขุนพล","รางวัล","","",0,0,},
        [5] = {5,"ร้านกองทัพ","ไอเทม","วุยก๊ก","จ๊กก๊ก","ง่อก๊ก","วีรบุรุษ",0,0,},
        [6] = {6,"ร้านค้าขุนพล","ขุนพล","","","","",0,0,},
        [7] = {7,"ร้านสมบัติ","ไอเทม","สมบัติม่วง","สมบัติส้ม","","",0,0,},
        [8] = {8,"ร้านปลุก","ไอเทม","","","","",0,0,},
        [9] = {9,"โปรรายวัน","","","","","",0,0,},
        [10] = {10,"พิเศษรายสัปดาห์","","","","","",0,0,},
        [11] = {11,"ร้านอสูรเทพ","","","","","",0,0,},
        [12] = {12,"ทรัพยากรครึ่งราคา","","","","","",0,0,},
        [13] = {13,"ร้านแปลงร่าง","วุยก๊ก","จ๊กก๊ก","ง่อก๊ก","วีรบุรุษ","",6,147,},
        [14] = {14,"ร้านชุดเซ็ท","","","","","",0,0,},
        [15] = {15,"ร้านอสูรเทพ","ไอเทม","","","","",0,0,},
        [16] = {16,"ร้านปลุก","ไอเทม","สีฟ้า","สีม่วง","สีส้ม","สีแดง",0,0,},
        [17] = {17,"ร้านชมดาว","","","","","",0,0,},
        [18] = {18,"ร้านม้าศึก","ม้าศึก","อุปกรณ์ม้า","","","",0,0,},
        [19] = {19,"ร้านราชา","","","","","",0,0,},
        [20] = {20,"ร้านหินดิบ","หินดิบ","","","","",0,0,},
        [21] = {21,"ร้านฝึกม้า","","","","","",0,0,},
        [22] = {22,"ฉลองครบรอบปีร้าน","วันที่1","วันที่2","วันที่3","ตำลึง","",0,0,},
        [23] = {24,"ร้านขุนพลทอง","ขุนพลทอง","กำจัดซื้อ","ทรัพยากร","","",0,0,},
    }
}

return shop