--silkbag

local silkbag = {
    -- key
    __key_map = {
      id = 1,    --锦囊id-int 
      name = 2,    --锦囊名称-string 
      profile = 3,    --锦囊短描述-string 
      description = 4,    --锦囊详情-string 
      bag_description = 5,    --背包锦囊描述-string 
      button_txt = 6,    --按钮文字-string 
      show_day = 7,    --图鉴显示天数-int 
      hero = 8,    --适用武将_math-string 
      is_fight = 9,    --无差别竞技里可用赛区_math-int 
    
    },
    -- data
    _data = {
        [1] = {1101,"ถุงกวนอิ๋นผิง","โจมตี+1000","โจมตี+1000(ตัวเอกอัป1เลเวล โจมตี+40เป็นพิเศษ)","โจมตี+1000(แต่ละเลเวล+40)","ไปติดตั้ง",0,"999",0,},
        [2] = {1102,"ถุงเตียวซี","HP7500","HP+7500(ตัวเอกอัป1เลเวล HP+300เป็นพิเศษ)","HP+7500(แต่ละเลเวล+300)","ไปติดตั้ง",0,"999",0,},
        [3] = {1103,"ถุงจิวท่าย","ป้องกัน+500","ป้องกัน+500(ตัวเอกอัป1เลเวล ป้องกัน+20เป็นพิเศษ)","ป้องกัน+500(แต่ละเลเวล+20)","ไปติดตั้ง",0,"999",0,},
        [4] = {1104,"ถุงหลี่หลิงจวี","อัตราคริ+8%","อัตราคริ+8%","อัตราคริ+8%","ไปติดตั้ง",0,"999",0,},
        [5] = {1105,"ถุงอุยกาย","ต้านคริ+8%","ต้านคริ+8%","ต้านคริ+8%","ไปติดตั้ง",0,"999",0,},
        [6] = {1106,"ถุงเตียวเหยียง","ดาเมจ+5%","ดาเมจ+5%","ดาเมจ+5%","ไปติดตั้ง",0,"999",0,},
        [7] = {1107,"ถุงซัวบุ้นกี๋","ลดดาเมจ+5%","ลดดาเมจ+5%","ลดดาเมจ+5%","ไปติดตั้ง",0,"999",0,},
        [8] = {1108,"ถุงอิกิ๋ม","ดาเมจคริ+5%","ดาเมจคริ+5%","ดาเมจคริ+5%","ไปติดตั้ง",0,"999",0,},
        [9] = {1202,"ถุงเล่าปี่","ร่ายสกิลรักษาเพิ่ม","เมื่อร่ายสกิลรักษาขุนพล สร้างเอฟเฟกต์รักษาให้ขุนพลฝ่ายเราที่มีเลือดน้อยที่สุดเพิ่มขึ้น55%เป็นพิเศษ","ร่ายสกิลรักษาเพิ่ม","ไปติดตั้ง",0,"102|202|302|402|216",1,},
        [10] = {1203,"ถุงลกซุน","Burning Probability increases","เป้าหมายโจมตียิ่งน้อย อัตราเผาไหม้เพิ่มยิ่งมาก อย่างมากเพิ่มอัตราเผาไหม้60%แก่เป้าหมาย1คน","อัตราเผาไหม้เพิ่ม","ไปติดตั้ง",0,"303|305|311|319|313",1,},
        [11] = {1204,"ถุงกองซุนจ้าน","Attacks one single target and additionally reduces its Anger by 1","เมื่อโจมตีเป้าหมายเดี่ยว ลดโทสะของเป้าหมายเป็นพิเศษ1แต้ม","โจมตีเป้าหมายเดี่ยวลดโทสะของเขา1แต้ม","ไปติดตั้ง",0,"212|312|404|408|409|412|413|414|415|416|417|419",1,},
        [12] = {1205,"ถุงกวนอู","Initial Anger increases by 1","โทสะเบื้องต้นเพิ่ม1แต้ม","เริ่มต้นเพิ่มโทสะ1แต้ม","ไปติดตั้ง",0,"999",1,},
        [13] = {1207,"ถุงม้าเฉียว","เพิ่มเอฟเฟกต์โล่ลดดาเมจ","เป้าหมายปกป้องยิ่งน้อย เอฟเฟกต์ลดดาเมจยิ่งสูง สูงสุดสามารถลดดาเมจ36%(มีผลกับขุนพลผู้ที่มีโล่ลดดาเมจในตอนนี้เท่านั้น)","เพิ่มเอฟเฟกต์โล่ลดดาเมจ","ไปติดตั้ง",0,"118|207|215|405",1,},
        [14] = {1208,"ถุงกาเซี่ยง","Poisoned Probability increases","เป้าหมายโจมตีสกิลยิ่งน้อย อัตราถูกพิษเพิ่มยิ่งมาก อย่างมากเพิ่มอัตราถูกพิษ60%","อัตราถูกพิษเพิ่ม","ไปติดตั้ง",0,"410|407",1,},
        [15] = {1209,"ถุงชีซี","Stun Probability increases","เป้าหมายโจมตียิ่งน้อย อัตรามึนงงเพิ่มยิ่งมาก อย่างมากเพิ่มอัตรามึนงง48%(มีผลกับขุนพลผู้ที่มีเอฟเฟกต์มึนงงในตอนนี้เท่านั้น)","อัตรามึนงงเพิ่ม","ไปติดตั้ง",0,"106|116|203|210|212|214|307|312|317|401|408|415",1,},
        [16] = {1211,"ถุงอิเกียด","ดาเมจถูกพิษเพิ่ม","เป้าหมายโจมตียิ่งน้อย สกิลสร้างดาเมจถูกพิษเพิ่มยิ่งมาก อย่างมากเพิ่มดาเมจถูกพิษ60%แก่เป้าหมาย1คน","ดาเมจถูกพิษเพิ่ม","ไปติดตั้ง",0,"410|407",1,},
        [17] = {1212,"ถุงเสี่ยวเกี้ยว","อัตราเหน็บชาเพิ่ม","เป้าหมายโจมตียิ่งน้อย อัตราเหน็บชาเพิ่มยิ่งมาก อย่างมากเพิ่มอัตราเหน็บชา72%แก่เป้าหมาย1คน(มีผลกับขุนพลผู้ที่มีเอฟเฟกต์เหน็บชาในตอนนี้เท่านั้น)","อัตราเหน็บชาเพิ่ม","ไปติดตั้ง",0,"219|304|411",1,},
        [18] = {1213,"ถุงกุยแก","อัตราเงียบขรึมเพิ่ม","เป้าหมายโจมตียิ่งน้อย อัตราเงียบขรึมเพิ่มยิ่งมาก อย่างมากเพิ่มอัตราเงียบขรึม72%แก่เป้าหมาย1คน(มีผลกับขุนพลผู้ที่มีเอฟเฟกต์เงียบขรึมในตอนนี้เท่านั้น)","อัตราเงียบขรึมเพิ่ม","ไปติดตั้ง",0,"104|115|409|419",1,},
        [19] = {1214,"ถุงแฮหัวตุ้น","สัดส่วนสะท้อนดาเมจเพิ่ม","สะท้อนดาเมจเพิ่ม30%(มีผลกับขุนพลผู้ที่มีเอฟเฟกต์สะท้อนดาเมจในตอนนี้เท่านั้น)","สัดส่วนสะท้อนดาเมจเพิ่ม","ไปติดตั้ง",0,"105",1,},
        [20] = {1215,"ถุงเตียวหุย","โจมตี+3000","โจมตี+3000(ตัวเอกอัป1เลเวล โจมตี+120เป็นพิเศษ)","โจมตี+3000(แต่ละเลเวล+120)","ไปติดตั้ง",0,"999",1,},
        [21] = {1216,"ถุงบังทอง","HP +22500","HP+22500(ตัวเอกอัป1เลเวล HP+900เป็นพิเศษ)","HP+22500(แต่ละเลเวล+900)","ไปติดตั้ง",0,"999",1,},
        [22] = {1217,"ถุงซุนเกี๋ยน","ป้องกัน+1500","ป้องกัน+1500(ตัวเอกอัป1เลเวล ป้องกัน+60เป็นพิเศษ)","ป้องกัน+1500(แต่ละเลเวล+60)","ไปติดตั้ง",0,"999",1,},
        [23] = {1218,"ถุงอ้วนสุด","อัตราคริ+20%","อัตราคริ+20%","อัตราคริ+20%","ไปติดตั้ง",0,"999",1,},
        [24] = {1219,"ถุงอุยซี","อัตราต้านคริ+20%","อัตราต้านคริ+20%","อัตราต้านคริ+20%","ไปติดตั้ง",0,"999",1,},
        [25] = {1220,"ถุงเตียนอุย","ดาเมจ+12%","ดาเมจ+12%","ดาเมจ+12%","ไปติดตั้ง",0,"999",1,},
        [26] = {1221,"ถุงตั๋งโต๊ะ","ลดดาเมจ+12%","ลดดาเมจ+12%","ลดดาเมจ+12%","ไปติดตั้ง",0,"999",1,},
        [27] = {1222,"ถุงซุนซ่างเซียง","ดาเมจคริ+12%","ดาเมจคริ+12%","ดาเมจคริ+12%","ไปติดตั้ง",0,"999",1,},
        [28] = {1223,"ถุงเคาทู","สังหารเป้าหมายจะฟื้นฟูโทสะของตนเอง1แต้ม","สังหารเป้าหมายจะฟื้นฟูโทสะของตนเอง1แต้ม","สังหารเป้าหมายจะฟื้นฟูโทสะของตนเอง1แต้ม","ไปติดตั้ง",0,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419",1,},
        [29] = {1224,"ถุงเอียนสี","สัดส่วนดาเมจสกิลแปลงเป็นรักษาเพิ่ม","สัดส่วนของดาเมจสกิลแปลงเป็นเลือดรักษาขุนพลผู้ที่มีเลือดน้อยที่สุดในปัจจุบันเพิ่ม18%(มีผลกับขุนพลผู้สนับสนุนที่มีสกิลโอนรักษาในตอนนี้เท่านั้น)","สัดส่วนดาเมจสกิลแปลงเป็นรักษาเพิ่ม","ไปติดตั้ง",7,"103|112|117|204|211|404|412",1,},
        [30] = {1225,"ถุงฮัวโต๋","ดาเมจถูกพิษฟื้นฟูเลือดของตนเอง","สร้างดาเมจถูกพิษ10%แปลงเป็นเลือดรักษาตนเอง","สร้างดาเมจถูกพิษฟื้นฟูเลือดของตนเอง","ไปติดตั้ง",7,"407|410",1,},
        [31] = {1226,"ถุงไต้เกี้ยว","เอฟเฟกต์รักษาเพิ่มและเสริมโล่ลดดาเมจ","เอฟเฟกต์รักษาของสกิลเพิ่ม25% และเพิ่มเติมโล่คุ้มกันดาเมจ1อันแก่เป้าหมายสกิล ถูกดาเมจทั้งหมดลดลง12% ต่อเนื่อง1รอบ","เอฟเฟกต์รักษาเพิ่มขึ้นและเพิ่มเติมโล่","ไปติดตั้ง",7,"102|202|302|402|216",1,},
        [32] = {1227,"ถุงเตียวเสี้ยน","ลดอัตราตนเองถูกควบคุม","อัตราถูกเอฟเฟกต์ควบคุม(เหน็บชา เงียบขรึม มึนงง)ลดลง35%","ลดอัตราตนเองถูกควบคุม","ไปติดตั้ง",7,"999",1,},
        [33] = {1301,"ถุงจูล่ง","โจมตีทั่วไปคริแน่นอน","โจมตีทั่วไปคริแน่นอน(รวมถึงการรักษาขุนพล)","โจมตีทั่วไปคริแน่นอน","ไปติดตั้ง",7,"999",1,},
        [34] = {1303,"ถุงจิวยี่","จำนวนรอบเผาไหม้ต่อเนื่องเพิ่มขึ้น","ฝ่ายรุกสร้างสถานะเผาไหม้ยาวนานพิเศษ1รอบ","สถานะเผาไหม้เพิ่ม1รอบเป็นพิเศษ","ไปติดตั้ง",7,"303|305|311|319|313",1,},
        [35] = {1304,"ถุงโจจู๋","ถูกพิษเพิ่มเติมเอฟเฟกต์ผนึกรักษา","ถูกพิษเพิ่มเติมเอฟเฟกต์ผนึกรักษา ขุนพลสถานะถูกพิษไม่สามารถถูกรักษาได้","ถูกพิษเพิ่มเติมเอฟเฟกต์ผนึกรักษา","ไปติดตั้ง",7,"410|407",1,},
        [36] = {1308,"ถุงโจโฉ","กำจัดเอฟเฟกต์อมตะขุนพลของศัตรู","เป้าหมายโจมตียิ่งน้อย อัตรากำจัดสถานะอมตะของขุนพลศัตรูยิ่งสูง อย่างมากเพิ่มอัตรากำจัดอมตะ100%แก่เป้าหมาย1คน","กำจัดเอฟเฟกต์อมตะขุนพลของศัตรู","ไปติดตั้ง",7,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419",1,},
        [37] = {1302,"ถุงเทพ·โจหยิน","โจมตีเป้าหมายแนวตั้งลดโทสะ1แต้ม","เมื่อโจมตีเป้าหมายแนวตั้ง ลดโกรธของเป้าหมายเป็นพิเศษ1แต้ม(มีผลกับขุนพลผู้ที่มีเอฟเฟกต์ลดโทสะแนวตั้งในตอนนี้เท่านั้น)","โจมตีเป้าหมายแนวตั้งลดโทสะของเขา1แต้ม","ไปติดตั้ง",7,"106|210|406",1,},
        [38] = {1309,"ถุงเทพ·ลกซุน","ขุนพลที่ถูกเผาไหม้ประทับไร้ศัตรู","ขุนพลถูกเผาไหม้จะไม่ได้รับเอฟเฟกต์อมตะและโล่ดูดเลือดอมตะ","ขุนพลถูกเผาไหม้จะไม่ได้รับเอฟเฟกต์อมตะ","ไปติดตั้ง",7,"303|305|311|319|313",1,},
        [39] = {1310,"ถุงเทพ·อุยซี","รอบแรกป้องกันควบคุม","รอบแรกคุ้มกันเอฟเฟกต์เหน็บชา เงียบขรึม มึนงง","รอบแรกคุ้มกันเอฟเฟกต์เหน็บชา เงียบขรึม มึนงง","ไปติดตั้ง",7,"999",1,},
        [40] = {1311,"ถุงเทพ·ฮัวโต๋","ดาเมจสกิลแปลงเป็นรักษา","ดาเมจสกิล18%แปลงเป็นเลือด รักษาตนเอง","ดาเมจสกิลแปลงเป็นเลือดรักษาตนเอง","ไปติดตั้ง",7,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419",1,},
        [41] = {1312,"ถุงสุมาอี้","ใช้โทสะทั้งหมดเพิ่มดาเมจสกิล","เมื่อโทสะของตัวขุนพลน้อยกว่า 7 แต้มจะร่ายสกิลไม่ได้ เมื่อร่ายกสกิลจะหักใช้โทสะทั้งหมดของปัจจุบัน บางส่วน ที่เกินโทสะ 4 แต้ม ทุกครั้งที่หักใช้โทสะ 1 แต้มและดา เมจสกิลจะเพิ่ม 15%","ใช้โทสะทั้งหมดเพิ่มดาเมจสกิล","ไปติดตั้ง",7,"999",1,},
        [42] = {1305,"ถุงเทพ·กาเซี่ยง","จำนวนรอบถูกพิษต่อเนื่องเพิ่มขึ้น","สกิลสร้างสถานะถูกพิษยาวนาน1รอบ","สถานะถูกพิษเพิ่ม1รอบเป็นพิเศษ","ไปติดตั้ง",7,"410|407",1,},
        [43] = {1313,"ถุงเทพ·ซุนฮก","ร่ายสกิลรักษาเพิ่ม","เมื่อร่ายสกิลรักษาขุนพล สร้างเอฟเฟกต์รักษาให้ขุนพลฝ่ายเราที่มีเลือดน้อยที่สุด3คน เพิ่มโจมตีขุนพลรักษา32%เป็นพิเศษ","ร่ายสกิลรักษาเพิ่ม","ไปติดตั้ง",7,"102|202|302|402|216",1,},
        [44] = {1314,"ถุงร่วมสาบานสวนท้อ","แบ่งปันการถูกดาเมจ","ถูกดาเมจลดลง12% และนำดาเมจที่ไม่ใช่ปลิดชีพที่ตนเองถูกกระทำแบ่งให้กับตนเองและขุนพล2คนที่มีเลือดสูงที่สุดในปัจจุบันของฝ่ายเรา(ขุนพลอยู่ในสถานะอมตะขณะถูกแบ่งปันดาเมจ ก็จะถูกดาเมจเช่นกัน)","แบ่งปันการถูกดาเมจ","ไปติดตั้ง",7,"999",1,},
        [45] = {1315,"ถุงเทพ·ไทสูจู้","อัตราเผาไหม้เพิ่มขึ้นจำนวนมาก","เป้าหมายโจมตียิ่งน้อย อัตราเผาไหม้เพิ่มยิ่งมาก อย่างมากเพิ่มอัตราเผาไหม้96%แก่เป้าหมาย1คน","อัตราเผาไหม้เพิ่มขึ้นจำนวนมาก","ไปติดตั้ง",7,"303|305|311|319|313",1,},
        [46] = {1316,"ถุงนักปราชญ์","เมื่อสิ้นสุดรอบจะฟื้นฟูโทสะพันเกี่ยวใจข้า1แต้ม","หลังจากขุนพลลงมือครั้งแรกในแต่ละรอบ ติดตั้งถุงพันเกี่ยวใจข้าขุนพลจะได้รับโทสะ1แต้มเป็นพิเศษ(กระบวนทัพแต่ละเซ็ตจำกัดขุนพลเพศชาย1คนติดตั้ง)","เมื่อสิ้นสุดรอบจะฟื้นฟูโทสะพันเกี่ยวใจข้า1แต้ม","ไปติดตั้ง",21,"998",0,},
        [47] = {1317,"ถุงพันเกี่ยวใจข้า","เมื่อสิ้นสุดรอบจะฟื้นฟูโทสะอาภรณ์สีคราม1แต้ม","หลังจากขุนพลลงมือครั้งแรกในแต่ละรอบ ติดตั้งถุงอาภรณ์สีครามขุนพลจะได้รับโทสะ1แต้มเป็นพิเศษ(กระบวนทัพแต่ละเซ็ตจำกัดขุนพลเพศหญิง1คนติดตั้ง)","เมื่อสิ้นสุดรอบจะฟื้นฟูโทสะอาภรณ์สีคราม1แต้ม","ไปติดตั้ง",21,"997",0,},
        [48] = {1318,"ถุงขี่เดี่ยวพันลี้","โจมตีขุนพลศัตรูที่มีเลือดน้อยที่สุดในปัจจุบัน","โจมตีทั้งหมดของโจมตีเดี่ยวจะโจมตีขุนพลศัตรูที่มีเลือดน้อยที่สุดในปัจจุบันตามลำดับ","โจมตีขุนพลศัตรูที่มีเลือดน้อยที่สุดในปัจจุบัน","ไปติดตั้ง",21,"205|213|308|310|316|413",1,},
        [49] = {1319,"ถุงหนึ่งม้าลุยเดี่ยว","สังหารเป้าหมายเพิ่มเติมสกิล1ครั้ง","หลังจากขุนพลโจมตีเดี่ยวสังหารเป้าหมาย เพิ่มเติมสกิล1ครั้ง สร้างดาเมจกายภาพ175%แก่ศัตรูเดี่ยว(สกิลที่เพิ่มเติมจะไม่ใช้โทสะ ไม่กระตุ้นสเตตัสพิเศษใดๆ)","สังหารเป้าหมายเพิ่มเติมสกิล1ครั้ง","ไปติดตั้ง",21,"205|213|308|310|316|413",1,},
        [50] = {1401,"ถุง7สังหาร","สร้างดาเมจถูกแบ่งสัดส่วนลดลง","ขุนพลแนวตั้ง แถวหน้า แถวหลังฝ่ายเราโจมตีสร้างดาเมจแก่ศัตรู ถ้าถูกแบ่งปัน สัดส่วนแบ่งปันจะลดลง50%","ขุนพลแนวตั้ง แถวหน้า แถวหลังฝ่ายเราโจมตีสร้างดาเมจแก่ศัตรู ถ้าถูกแบ่งปัน สัดส่วนแบ่งปันจะลดลง50%","ไปติดตั้ง",21,"107|108|109|113|114|201|206|208|209|217|218|301|306|318|406|407|414|416",2,},
        [51] = {1402,"ถุงละโมบ","ฆ่าเป้าหมายได้รับโทสะ","เมื่อสกิลสังหารศัตรูเป้าหมายทันที จะได้รับโทสะทั้งหมดที่เหลือของเป้าหมาย(ติดตั้งขุนพลโจมตี)","เมื่อสังหารศัตรูเป้าหมาย จะได้รับโทสะทั้งหมดที่เหลือของเป้าหมาย(ติดตั้งขุนพลโจมตี)","ไปติดตั้ง",21,"101|107|108|109|111|113|114|201|205|206|208|209|217|218|301|306|308|310|316|318|403|406|407|410|413|414|416",2,},
        [52] = {1403,"ถุงตำนาน·กวนอู","โทสะเบื้องต้นเพิ่ม2แต้ม","โทสะเบื้องต้นเพิ่ม2แต้ม","โทสะเบื้องต้นเพิ่ม2แต้ม","ไปติดตั้ง",21,"999",2,},
        [53] = {1404,"ถุงสู้ตาย","แต่ละรอบถูกดาเมจอย่างจำกัด","แต่ละรอบอย่างมากจะถูกดาเมจค่าHPสูงสุดของตนเอง50%(ดาเมจนี้เป็นดาเมจขุนพลทันที)","แต่ละรอบถูกดาเมจอย่างจำกัด","ไปติดตั้ง",999,"105|119|207|215|309|314|405|418",0,},
        [54] = {1405,"ถุงร่วมหัวจมท้าย","ดูดซับดาเมจขุนพลของเพื่อนค่ายเดียวกัน","เมื่อขุนพลค่ายเดียวกันถูกดาเมจทันทีของขุนพลศัตรู ดาเมจนี้50%จะถูกโอนให้ผู้ที่ติดตั้งขุนพลถุงนี้(ไม่สามารถกระตุ้นสเตตัสพิเศษใดๆ ไม่สามารถถูกคุ้มกันอมตะ)","ดูดซับดาเมจขุนพลของเพื่อนค่ายเดียวกัน","ไปติดตั้ง",999,"105|119|207|215|309|314|405|418",0,},
    }
}

return silkbag