--story_general_plan

local story_general_plan = {
    -- key
    __key_map = {
      id = 1,    --锦囊关id-int 
      name = 2,    --挑战名称-泰语-string 
      des = 3,    --帐篷事件描述-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ท้ารบขุนพล","ตั๋งโต๊ะ ชื่อรองจ้งอิ่ง ผู้นำแถบเลียงจิ๋วปลายยุคฮั่น ภายหลังเข้าเป็นขุนนางที่ลกเอี๋ยง ตำแหน่งไท้ซือ มีอำนาจในราชสำนัก เขาเป็นคนร่างกายกำยำ กำลังแขนดี ถนัดการขี่ม้า ชอบดื่มเหล้า กินเนื้อ และชอบสาวๆ ภายหลังเพราะวางอำนาจฆ่าคนบริสุทธิ์ ถูกลิโป้ตายในแผนสาวงามของเตียวเสี้ยน",},
        [2] = {2,"ท้ารบขุนพล","ซุนเซ็ก ชื่อรองป๋อฝู ถูกเรียกว่าป้าอ๋องน้อยแห่งกังตั๋ง หนึ่งในผู้ตั้งรากฐานง่อก๊ก ตอนหนุ่มมีรูปโฉมงดงาม นิสัยใจกว้าง ชื่อเสียงเกริกไกร ภายหลังร่วมสาบานกับจิวยี่ ยอมก้มหัวให้อ้วนสุดเพื่อสืบทอดงานใหญ่ต่อจากซุนเกี๋ยน อ้วนสุดตั้งตนเป็นจักรพรรดิแล้ว ซุนเซ็กกับอ้วนสุดแตกหักกัน รวบรวมกังตั๋งเป็นหนึ่ง",},
        [3] = {3,"ท้ารบขุนพล","เตียวหยุน ชื่อรองจูล่ง หนึ่งในขุนพลห้าพยัคฆ์แห่งจ๊กก๊ก รูปร่างสูงใหญ๋ บุคลิกองอาจ เคยเจ็ดเข้าเจ็ดออกฝ่ากองทัพโจโฉนับล้านที่เนินเตียวปันโป๋ ช่วยอาเต๊าลูกชายเล่าปี่ เล่าปี่เคยกล่าวว่า: ชีวิตจูล่งมีแต่ดีแห่งความกล้า",},
        [4] = {4,"ท้ารบขุนพล","เตียวหุย ชื่อรองเอ๊กเต๊ก หนึ่งในขุนพลห้าพยัคฆ์แห่งจ๊กก๊ก ร่วมสาบานเป็นพี่น้องกับเล่าปี่ กวนอูที่สวนท้อ เป็นคนกล้าหญ นิสัยมุทะลุ เกลียดความชั่วมาก เคยส่งเสียงคำรามบนสะพานเนินเตียวปันโป๋ที่ตังหยาง ขับไล่กองทัพโจโฉนับแสน",},
        [5] = {5,"ท้ารบขุนพล","จิวยี่ ชื่อรองกงจิน ขุนพลง่อก๊ก แม่ทัพภาค เพราะมีหน้าตาหล่อเหลาทำให้ได้รับฉายาว่าจิวหลาง เชี่ยวชาญดนตรี มีคำกล่าวว่า[เพลงเพี้ยนเสียง จิวยี่รู้] เป็นสหายรักกับซุนเซ็ก ช่วยซุนเซ็กรวบรวมแดนกังตั๋ง ภายหลังซุนเซ็กถูกแทงตาย ช่วยซุนกวนปกครองกังตั๋ง ปี208 จิวยี่นำทัพร่วมมือมือกับเล่าปี่ เอาชนะกองทัพโจโฉในศึกผาแดง จนเกิดรากฐานแผ่นดินสามส่วนอย่างชัดเจน ถูกชนรุ่นหลังยกย่องว่า[วีรบุรุษแห่งยุค สามีของสาวงามแห่งกังตั๋ง]",},
        [6] = {6,"ท้ารบขุนพล","จูกัดเหลียง ชื่อรองขงเบ้ง ฉายามังกรหลับ เสนาบดีจ๊กก๊ก ช่วงแรกเก็บตัวไม่สนใจโลก ภายหลังเล่าปี่เยี่ยมกระท่อมสามครั้ง สนับสนุนเล่าปี่ก่อตั้งจ๊กก๊ก เคยใช้คารมทำศึกกับบัณฑิตง่อก๊กเพื่อผูกพันธมิตร วางแผนเมืองร้างหลอกสุมาอี้ ทั้งชีวิตทำเพื่องานใหญ่จ๊กก๊ก เป็นตัวแทนของขุนนางที่ฉลาดและภักดี ผลงานสร้างชื่อคือฎีกาออกศึกโอวาทสอนบุตรเป็นต้น เคยประดิษฐ์วัวไม้เลื่อนม้า โคมขงเบ้ง หน้าไม้ขงเบ้งเป็นต้น",},
        [7] = {7,"ท้ารบขุนพล","โจโฉ ชื่อรองเมิ่งเต๋อ ชื่อเล่นอาหมาน ผู้นำปลายยุคฮั่น ขุนนางกังฉินแห่งยุค เป็นคนที่วางรากฐานวุยก๊ก ไม่เพียงเชี่ยวชาญพิชัยยุทธ์ ยังถนัดดนตรี แต่งกลอน รับตำแหน่งอ๋องวุย บุตรชายของเขาโจผีก่อตั้งรัฐวุยแล้ว อวยยศย้อนหลังเป็นจักรพรรดิอู่ นามเว่ยอู่ตี้",},
        [8] = {8,"ท้ารบขุนพล","โจจู๋ ชื่อรองเหยียนฟ่าง นักพรตที่มีชื่อเสียงช่วงปลายยุคฮั่นตะวันออก เชี่ยวชาญอู่จิง ดูดาว ฉีเหมินตุ้นเจี่ย ว่ากันว่าสามารถใช้งานผีเทพได้ มีชื่อเสียงด้านเวทมนต์คาถา มือเดียวสร้างก๊ก โจจู๋เคยแกล้งโจโฉกับซุนเซ็ก ภายหลังไปหลอมยาในภูเขา บรรลุธรรมขี่กระเรียนจากไป",},
        [9] = {9,"ท้ารบขุนพล","ลิโป้ ชื่อรองเฟยเสียง ขุนพลอันดับหนึ่งในสามก๊ก มือถือง้าวกรีดนภา ขี่ม้าเซ็กเธาว์ สวมมงกุฎทอง บารมีล้นเหลือ อำนาจแผ่ซ่าน กวนอู เตียวหุย เล่าปี่สามคนร่วมมือกันล้อมเขา ก็ยังไม่อาจเอาชนะได้ เป็นเทพสงครามอย่างไม่เสียชื่อ!",},
        [10] = {10,"ท้ารบขุนพล","เตียวเสี้ยน หนึ่งในสี่สาวงามในประวัติศาสตร์จีน ธิดาบุญธรรมของอ้องอุ้น ภรรยาลิโป้ มีรูปโฉมสุดยอด ความงามจันทร์หลบ งามล่มเมือง เพื่อตอบแทนบุญคุณพ่อบุญธรรมอ้องอุ้นที่ชุบเลี้ยง ยอมสละตนเป็นแผนห่วงโซ่จนฆ่าตั๋งโต๊ะสำเร็จ",},
        [11] = {11,"ท้ารบขุนพล","เตียวเลี้ยว ชื่อรองเหวินหยวน ลิโป้ ภายลังไปเข้ากับโจโฉ หนึ่งในห้าขุนพลพยัคฆ์แห่งวุย เคยบุกเป๊กตุ้น ยึดอูหวน เกี้ยงอัง21ปี ทัพใหญ่ง่อก๊กบุกล้อมหับป๋า เตียวเลี้ยวนำทหารนับพันทำลายกองทัพง่อนับแสน เกือบจับเป็นซุนกวน จนได้รับสมญานามเด็กได้ยินชื่อหยุดร้องไห้",},
        [12] = {12,"ท้ารบขุนพล","ซุนเกี๋ยน ชื่อรองเหวินไถ คนก่อตั้งรากฐานง่อก๊ก ถูกตั้งฉายาว่าพยัคฆ์ร้ายกังตั๋ง เขามีหน้าตาหล่อ องอาจ ถนัดใช้ดาบใหญ่ ชอบสวมผ้าโพกหัวสีแดง เคยเข้าร่วมปราบปรามกองทัพผ้าเหลืองและปราบปรามตั๋งโต๊ะ",},
        [13] = {13,"ท้ารบขุนพล","ไต้เกี้ยว ภรรยาของซุนเซ็ก สาวงามเลื่องชื่อของสามก๊ก เป็นสองเกี้ยวแห่งกังตั๋งร่วมกับน้องเสี่ยวเกี้ยว เชี่ยวชาญดนตรี กวี คิ้วงามเหมือนวาด รอยยิ้มหวาน ผู้คนหลงใหล",},
        [14] = {14,"ท้ารบขุนพล","ขุนพลเตียนอุย โจโฉ รูปร่างกำยำ กำลังเยอะ ขับไล่เสือร้ายได้ ถนัดใช้ง้าวคู่ ตอนที่เตียวสิ้วกบฏ ยอมตายเพื่อปกป้องโจโฉ",},
        [15] = {15,"ท้ารบขุนพล","เสี่ยวเกี้ยว ภรรยาของจิวยี่ เป็นสาวงามเลื่อชื่อของสามก๊ก ได้รับฉายาสองเกี้ยวแห่งกังตั๋งร่วมกับพี่ไต้เกี้ยว ท่าทางมีสง่า ใครเห็นก็หวั่นไหว ไร้เดียงสาโรแมนติก เสียงหวานกังวาน ร่าเริงขี้อ้อน แค่ได้ยินเสียงก็เคลิ้ม",},
        [16] = {16,"ท้ารบขุนพล","งักจิ้น ชื่อรองเหวินเชียน หนึ่งในห้าขุนพลพยัคฆ์แห่งวุย ใช้ความกล้าหาญติดตามโจโฉ อยู่ในกองทัพหลายปี รบทั้งเหนือและใต้ สร้างผลงานรบนับไม่ถ้วน เกี้ยงอังปีที่23ตาย อวยยศเป็นเวยโหว",},
        [17] = {17,"ท้ารบขุนพล","หลี่หลิงจวี ว่ากันว่าเป็นลูกสาวของลิโป้กับเตียวเสี้ยน หน้าตาสวยไม่ด้อยกว่าเตียวเสี้ยน ฝีมือดีไม่แพ้บิดา บารมีล้นเหลือแต่เหงา กล้าหาญแต่ทำตัวเป็นแค่พลทหาร ถึงมีปณิธานที่เด็ดเดี่ยวไม่กลัวความลำบาก แต่เพราะประสบการณ์ในอดีตทำให้กลัวการถูกทอดทิ้งให้โดดเดี่ยวมาก",},
        [18] = {18,"ท้ารบขุนพล","กำเหลง ชื่อรองซิงป้า ขุนพลง่อก๊ก ชอบเป็นจอมยุทธ์ตั้งแต่เด็ก ยิงนกตกปลา พกกระดิ่งติดตัว ชุดแพรไหม ผู้คนเรียกว่าโจรใบแพร ตอนหนุ่มหยุดปล้น ขยันเรียน เคยรับใช้เล่าเปียวกับหองจอ ภายหลังนำสมุนไปเข้าร่วมกับซุนกวน เริ่มทำงานใหญ่ เคยนำคนรับร้อยปล้นค่ายโจโฉ ผลงานรบมากมาย ซุนกวนเคยพูดว่า: เมิ่งเต๋อมีเตียวเลี้ยว ข้ามีกำซิงป้า ก็ต้านศัตรูได้แล้ว",},
        [19] = {19,"ท้ารบขุนพล","โจหยิน ชื่อรองจื่อเสี้ยว ขุนพลวุยก๊กในยุคสามก๊ก หนึ่งในแปดขุนพลม้าพยัคฆ์แห่งวุยก๊ก ปกครองทหารเข้มงวด ถนัดด้านการป้องกัน ติดตามโจโฉทำศึกหลายปี คุณูปการล้นเหลือ รับตำแหน่งถึงมหาเสนาบดี",},
        [20] = {20,"ท้ารบขุนพล","จิวท่าย ชื่อรองโย่วผิง ขุนพลคนสำคัญของง่อก๊ก ปกป้องซุนกวนจากอันตรายหลายครั้ง มีบาดแผลบนตัวหลายสิบแผล เหมือนภาพวาดสลักบนผิว เพื่อเชิดชูผลงานของจิวท่าย ซุนกวนประทานร่มประดับลายให้กับเขา",},
        [21] = {21,"ท้ารบขุนพล","เอียนสี สาวงามเลื่องชื่อในยุคสามก๊ก มีอีกชื่อว่าอิงสีหรือเจินฝู[fú] เหวินเจาเจินฮองเฮา งามล่มเมือง สุดยอดแห่งยุค เป็นภรรยาเอกของโจผี แต่ลือกันว่ารักกับโจสิด ภาพลั่วเสินฟู่โจสิดวาดขึ้นเพื่อนาง",},
        [22] = {22,"ท้ารบขุนพล","อุยซี  ภรรยาของจูกัดเหลียง ธิดาของฮองเสงหงันคนดังเกงจิ๋ว ว่ากันว่ามีความงาม แต่เพราะขี้อาย เลยใช้งอบและผ้าแพรปิดบังใบหน้า นางมีความรู้ดี ปัญญาไร้เทียมทาน ร่วมกับขงเบ้งประดิษฐ์วัวไม้เลื่อนม้า เป็นที่เลื่องลือ",},
        [23] = {23,"ท้ารบขุนพล","กวนเป๋ง ขุนพลจ๊กก๊ก บุตรของกวนอู ติดตามกวนอูพิชิตออกปราบตก กล้าหาญชาญชัย ไม่แพ้บิดา เคยติดตามเล่าปี่ออกรบซีชวน สร้างผลงานรบ ภายหลังต่อสู้กับบังเต๊กขุนพลวุยก๊ก30รอบ ไม่รู้แพ้รู้ชนะ",},
        [24] = {24,"ท้ารบขุนพล","ฮันต๋ง ชื่อรองอี้กง ขุนพลง่อก๊ก ถนัดการยิงธนู ขี่ม้าและมีกำลังแขนดี รับใช้ซุนเกี๋ยน ซุนเซ็ก ซุนกวน คุณูปการล้นเหลือ มีผลสำคัญคือค่อยสร้างความมั่นคงให้กับงานใหญ่ของกังตั๋งและก่อตั้งง่อก๊ก",},
        [25] = {25,"ท้ารบขุนพล","ลิบอง ชื่อรองจื่อหมิง ขุนพลง่อก๊ก เคยรับตำแหน่งแม่ทัพภาค ออกรบทำศึกตั้งแต่อายุ15ปี ทำศึกเก่ง แต่อ่านหนังสือน้อย ภายหลังได้รับการเตือนจากซุนกวน ถึงเริ่มขยันเรียน โลซกมาปรึกษางานกับลิบองที่ชิมเอี๋ยง ตกใจกับความก้าวหน้าของเขาเป็นอย่างมาก ภายหลังจึงเกิดคำกล่าวว่าอำลาสามวันถึงกับต้องมองเด็กเมื่อวานซืนใหม่ เป็นการยกย่องความก้าวหน้าอย่างมากของคนอื่น ผลงานที่โดดเด่นที่สุดของลิบองคือลอบจู่โจมเกงจิ๋ว เอาชนะขุนพลกวนอูแห่งจ๊กก๊ก เกิดเรื่องราวสร้างชื่อชุดขาวข้ามแม่น้ำ",},
        [26] = {26,"ท้ารบขุนพล","ลกซุน ชื่อรองป๋อเหยียน ขุนพลใหญ่ง่อก๊ก รับตำแหน่งง่อก๊กแม่ทัพภาค แม่ทัพใหญ่บน เสนาบดี ที่อี๋หลิงเอาชนะกองทัพจ๊กก๊กที่นำโดยเล่าปี่ ศึกเดียวสร้างชื่อ ลกซุนได้รับการไว้ใจจากซุนกวนมาก วางแผนรอบคอบ จงรักภักดี ทั้งชีวิตจากขุนพลจนเป็นเสนาบดี ถูกยกย่องว่าเป็นขุนนางแห่งแผ่นดิน ผู้เล่นชอบเรียกจิวยี่เป็นแม่ทัพภาคใหญ่ ลกซุนเป็นแม่ทัพภาคเล็ก",},
        [27] = {27,"ท้ารบขุนพล","สุมาอี้ ชื่อรองจ้งต๋า ทำตัวเรียบง่าย ฉลาดช่างวางแผน มีชื่อเรื่องความรู้ เป็นอินทรีย์ดักซุ่ม นักปกครอง นักวางแผนการทหารของวุยก๊ก ขุนนางวุยก๊ก ผู้ตั้งรากฐานราชวงศ์จิ้นตะวันตก",},
        [28] = {28,"ท้ารบขุนพล","กวนอู ชื่อรองหุนเตี๋ยง หัวหน้าขุนพลห้าพยัคฆ์ มีคุณธรรมสูงส่ง ภักดีไม่มีเปลี่ยน กล้าหาญเชี่ยวชาญรบ มีเรื่องสร้างชื่อคือเหล้าอุ่นสังหารฮัวหยง ขูดกระดูกรักษาแผลเป็นต้น",},
        [29] = {29,"ท้ารบขุนพล","แฮหัวตุ้น ชื่อรองหยวนร่าง ขุนพลวุยก๊ก ขุนพลที่มีนิสัยใจร้อน ทำศึกเพื่อตระกูลโจทั้งชีวิต เป็นคนเรียบง่าย บำเหน็จที่ได้รับมอบให้ทหารในสังกัดทั้งหมด ทั้งชีวิตไม่สะสมทรัพย์สิน ตายไปไร้สมบัติให้ตระกูล",},
        [30] = {30,"ท้ารบขุนพล","ซุนเกี๋ยน ชื่อรองเหวินไถ ทายาทของนักการทหารตระกูลซุนที่ยิ่งใหญ่ แม่ทัพปลายยุคฮั่นตะวันออก ผู้ก่อตั้งรากฐานง่อก๊กในสามก๊ก กล้าหาญเด็ดเดี่ยว หน้าตาดี นิสัยใจกว้าง ชอบเรื่องแปลก เป็นพยัคฆ์แห่งกังตั๋ง",},
        [31] = {31,"ท้ารบขุนพล","โจผี ชื่อรองจื้อฮวาน บุตรชายคนรองของโจโฉ เป็นนักปกครอง นักปราชญ์ที่มีชื่อเสียง เป็นปฐมจักรพรรดิวุยก๊ก เก่งตั้งบุ๋นและบู้ตั้งแต่เด็ก ความรู้รอบด้าน",},
        [32] = {32,"ท้ารบขุนพล","ชีซี ชื่อรองเหวียนจื่อ เดิมเป็นกุนซือในสังกัดเล่าปี่ เป็นคนเร่งให้มังกรหลับลงจากเขา ภายหลังไปเข้าร่วมกับโจโฉ และเป็นขุนนางวุยก๊ก แต่ทั้งชีวิตไม่ได้สร้างงานใหญ่ ตัวอยู่ในทัพโจโฉแต่ใจอยู่กับฮั่น",},
        [33] = {33,"ท้ารบขุนพล","ซุนกวน ชื่อรองจ้งโหมว ชุตรชายของซุนเกี๋ยน ผู้ก่อตั้งง่อก๊ก เอาชนะโจโฉในศึกผาแดง ตั้งรากฐานกระถางสามขา รูปร่างสูงใหญ่ โหงวเฮ้งเป็นคนบุญหนักศักดิ์ใหญ่ มีคำกล่าวว่ามีบุตรให้ได้อย่างซุนกวน",},
        [34] = {34,"ท้ารบขุนพล","กาเซี่ยง ชื่อรองเหวินเหอ ชาวเลียงจิ๋ว กุนซือชื่อดังยุคสามก๊ก เดิมเป็นลูกน้องของตั๋งโต๊ะ หลังจากที่ตั๋งโต๊ะตายแล้ว เพราะวางแผนทำให้ลิฉุยกุยกีตลบหลังโจมตีเตียงฮัน ถูกเรียกว่ากุนซือพิษ หลังจากนั้น กาเซี่ยงก็เปลี่ยนมาเป็นกุนซือของเตียวสิ้ว ภายหลังไปสวามิภักดิ์โจโฉ กลายเป็นขุนนางสำคัญของวุยก๊ก",},
        [35] = {35,"ท้ารบขุนพล","กุยแก ชื่อรองฟ่งเสี้ยว กุนซือที่เก่งที่สุดในช่วงแรกของวุยก๊ก หนึ่งในห้าปราชญ์ของวุยก๊ก ตำแหน่งกุนซือจี้จิ่ว ปัญญาดีมาก วางแผนล้ำลึก โจโฉเรียกเขาว่า[ยอดกุนซือ] แต่เพราะตายไว โจโฉเสียใจหนักมาก",},
        [36] = {36,"ท้ารบขุนพล","บังทอง ชื่อรองซื่อหยวน ฉายาหงส์ดรุณ กุนซือคนสำคัญของเล่าปี่ มีปัญญาดีตีคู่มากับจูกัดเหลียง ศึกผาแดง เขาหลบความขัดแย้งกังตั๋ง แนะนำจิวยี่ให้โลซก และแอบเข้าค่ายโจโฉวางแผนห่วงโซ่ ช่วยให้จิวยี่ใช้ไฟโจมตีทัพใหญ่โจโฉพ่ายแพ้",},
        [37] = {37,"ท้ารบขุนพล","ซุนซ่างเซียง น้องสาวของซุนกวน ในศึกผาแดงแต่งงานเป็นภรรยาเล่าปี่ นางมีความงาม มีปัญญาและว่องไว เป็นคนดื้อ วีรสตรีไม่เป็นรองบุรุษ",},
        [38] = {38,"ท้ารบขุนพล","เตียวก๊ก ผู้นำกองทัพผ้าเหลืองช่วงปลายยุคฮั่นตะวันออก ผู้ก่อตั้งลัทธิไท้ผิง มีสาวกนับแสน ปี184 เตียวก๊กใช้ข้อความปลุกระดมว่าฟ้าครามสิ้นเเล้ว ฟ้าเหลืองขึ้นเเทน ปีชวดนี้เเล ใต้ฟ้ารุ่งเรือง เรียกตนเองเป็นเจ้าพระยาสวรรค์ นำผู้คนก่อกบฏ ประวัติศาสตร์จารึกว่าเป็นกบฎโจรผ้าเหลือง",},
        [39] = {39,"ท้ารบขุนพล","เตียวคับ[hé] ชื่อรองจวิ้นอี้[jùn yì] หนึ่งในห้าขุนพลพยัคฆ์แห่งวุย เคยรับใช้อ้วนเสี้ยว ในศึกกัวต๋อไปสวามิภักดิ์โจโฉ เตียวคับทำศึกทั้งชีวิต ใช้ทหารแยบยล ถนัดการตั้งค่ายกล ถนัดใช้ภูมิศาสตร์ ติดตามโจโฉแล้วสร้างผลงานรบมากมาย",},
        [40] = {40,"ท้ารบขุนพล","เบ้งเฮ็ก อ๋องหนานหมาน ผู้นำชนเผ่าเขตหนานจงในยุคสามก๊ก ถูกจูกัดเหลียงนำกองทัพจับ7ปล่อย7จนยอมสวามิภักดิ์ หลังจากนั้นไม่ทรยศอีก เขาไม่เพียงกล้าหาญ ยังมีปณิธานแน่วแน่ และภักดีมาก เป็นที่เคารพของคนท้องถิ่น",},
    }
}

return story_general_plan