--territory_performance

local territory_performance = {
    -- key
    __key_map = {
      id = 1,    --序号-int 
      name = 2,    --城池名称-泰语-string 
      hero_name = 3,    --守关武将名字-泰语-string 
      directions = 4,    --城池描述-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ซีจิ๋ว","ไทสูจู้","    ซีจิ๋วในฐานะเมืองใหญ่ของหัวตง ที่นี่มีบรรยากาศงดงาม คนเป็นมิตร วัฒนธรรมการหมักเหล้าของที่นี่ชื่อเสียงเลื่องลือ สุภาพชนรักการดื่มเหล้าเล่นดนตรี โดยที่นี่เป็นแหล่งผลิตเหล้าตู้คัง",},
        [2] = {2,"อิจิ๋ว","เตียวเจียว","    อิจิ๋วเป็นต้นกำเนิดวัฒนธรรมหัวเซี่ย เป็นศูนย์กลางเศรษฐกิจกับการปกครองของจีนมายาวนาน มีคนเก่งมากมาย ที่นี่มีการผลิตไอเทมEXP และจิตขุนพลเป็นต้น",},
        [3] = {3,"เกงจิ๋ว","เล่าเปียว","    เกงจิ๋วชื่อเมืองนี้ได้มาจากการอยู่ทางใต้ของภูเขาเกง ที่นี่คนเก่งมากมาย เกิดขุนพลเยอะแยะ ดังนั้นจึงเป็นแหล่งผลิตยาทะลวง และเป็นดินแดนที่ทหารแย่งชิง",},
        [4] = {4,"เฉงจิ๋ว","โจหยิน","  ตะวันออกธาตุไม้ สีไม้คือเขียว ชื่อเมืองเฉงจิ๋ว ที่นี่มีแร่ทรัพยากรมากมาย การหลอมเหล็กก้าวหน้า ผลิตหินสกัดอุปกรณ์ เหล็กหล่อเป็นต้น",},
        [5] = {5,"อิวจิ๋ว","เล่าปี่","  ห่อชีวิตชุนชิวอวิ๋น: ดาวกระจายเป็นอิวจิ๋ว แบ่งเป็นแคว้นเยียน ทิศเหนือคือดวงอาทิตย์ เป็นสัญลักษณ์นรกภูมิ อิวจิ๋วคือ9แคว้นโบราณและหนึ่งใน13แคว้นหลัก; ที่นี่มีสมบัติEXP หินสกัดสมบัติเป็นต้น",},
        [6] = {6,"กุนจิ๋ว","โจโฉ","    อักษรอิวของกุนจิ๋ว มีที่มามาจากแม่น้ำอิว น้ำอิวหรือเรียกว่าน้ำจี่ อักษรอิวมีความหมายแฝงว่าภูมิฐาน ขงจื้อ เมิ่งจื้อเคยมาบรรยายที่นี่ นอกจากนี้ยังมีหินเลื่อนขั้นศาสตราวุธ",},
    }
}

return territory_performance