--time_limit_activity

local time_limit_activity = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --限时活动名称-string 
      start_des = 3,    --开启描述-string 
      description = 4,    --活动描述-string 
      is_work = 5,    --是否显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"BOSSกองทัพ","ทุกวัน","BOSSกองทัพเปิดทุกวัน12น.19น.; จำนวนคนในกองทัพเข้าร่วมยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; เข้าร่วมกิจกรรมจะได้รับโบนัสประมูลกองทัพ",1,},
        [2] = {2,"ตอบคำถาม\nกองทัพ","ทุกวัน","ตอบคำถามกองทัพเปิดทุกวัน18น.; จำนวนคนในกองทัพเข้าร่วมยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; ผู้เล่นที่เข้าร่วมกิจกรรมจะได้รับโบนัสประมูลกองทัพ",1,},
        [3] = {3,"ทดสอบกองทัพ","ทุกวัน","ทดสอบกองทัพเปิดทุกวันเวลา18.10น.ถึง18.40น.; คะแนนทดสอบกองทัพยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; เข้าร่วมกิจกรรมจะได้รับโบนัสประมูลกองทัพ",1,},
        [4] = {4,"ศึกสามก๊ก","ทุกวันพุธ เสาร์ อาทิตย์","ช่วงที่โลกวุ่นวาย เกิดไอพุ่งสู่ท้องฟ้า ขุนพลสามก๊ก รบ!   เปิดทุกวันพุธ ศุกร์ อาทิตย์ เวลา 21 น.คอยท่านมารบ!",1,},
        [5] = {5,"ประลองค่าย","ทุกวันจันทร์ พฤหัส","ประลองค่ายเปิดลงสมัครในวันจันทร์กับพฤหัสบดี เวลา 4 น. และเริ่มเปิดศึกเวลา 21 น. จำนวนลงสมัครยิ่งเยอะ รางวัลประมูลยิ่งเยอะ ผู้เล่นทุกคนที่ลงสมัครจะได้รับโบนัสประ  มูลของประลองค่าย",1,},
        [6] = {6,"เส้นทางฮัวหยง","ทุกวัน","เส้นทางฮัวหยงเปิดทุกวันเวลา10น.14น.16น.22น.ครั้งละ2รอบ 1วันเปิดทั้งหมดรอบ8รอบ สามารถไปสนับสนุนขุนพลเข้าร่วมรบ ขุนพลสนับสนุนอันดับที่1จะได้รับรางวัล!",1,},
        [7] = {7,"ศึกกองทัพ","ทุกวันอังคาร เสาร์","มรสุมจงหยวนมาแล้ว รวมกลุ่มวีรบุรุษสามก๊ก ระดมพลสนามรบ ฮึกเหิม ทะลุฟ้า ทุกวันอังคาร เสาร์เวลา21น.เปิดศึกกองทัพ มา รบกันให้สะใจ!!",1,},
        [8] = {8,"ศึกราชา","ทุกวัน","การประลองแบบยุติธรรม มองข้ามพลังรบ ประลองแค่เทคนิค!\nทุกวัน11-14น.กับ19-22น. มารบด้วยกัน!",1,},
        [9] = {9,"สุสานจิ๋นซี","ทุกวัน","ทุกวัน10-22น. รวมทีมบุกสุสานจักรพรรดิ มีโอกาสได้รับชุนชิวกลียุค!",1,},
        [10] = {10,"ประลองค่าย","ทุกวันจันทร์","ประลองค่ายเปิดลงชื่อทุกวันจันทร์4น. เปิดศึก21น.; คนลงชื่อยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; ผู้เล่นทุกคนที่ลงชื่อจะได้รับประลองค่าย วันพฤหัสบดีแบ่งโบนัสประมูลประลองส่วนตัวข้ามเซิร์ฟ",1,},
        [11] = {11,"ศึกกองทัพข้ามเซิร์ฟ","ทุกวันเสาร์","วันอังคารเปิดศึกกองทัพเวลา21น. วันเสาร์เปิดศึกกองทัพข้ามเซิร์ฟเวลา21น.\nกองทัพที่ยึดครองด่านเฮาโลก๋วน ด่านหานกู่ หอกระบี่ เซียวเหยาจินสามารถเข้าร่วมศึกกองทัพข้ามเซิร์ฟได้\nกองทัพอื่นสามารถเข้าร่วมศึกกองทัพในเซิร์ฟ",0,},
        [12] = {12,"ประลองส่วนตัว\nข้ามเซิร์ฟ","ทุกวันพฤหัส","เซิร์ฟเวอร์กลุ่มเดียวกัน8เซิร์ฟเปิดเซิร์ฟมา30วัน ทุกวันพฤหัสบดีเปิดประลองส่วนตัวข้ามเซิร์ฟ; จำนวนคนลงชื่อประลองค่ายยิ่งเยอะ รางวัลประมูลยิ่งเยอะ ผู้เล่นที่ลงชื่อจะได้รับโบนัสประลองส่วนตัวข้ามเซิร์ฟประมูล",1,},
        [13] = {13,"ตอบคำถาม\nกองทัพ","ทุกวันอังคาร พฤหัส เสาร์","ตอบคำถามกองทัพเปิดทุกวันอังคาร พฤหัสบดี เสาร์เวลา18น.; จำนวนคนในกองทัพเข้าร่วมยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; ผู้เล่นที่เข้าร่วมกิจกรรมจะได้รับโบนัสประมูลกองทัพ",1,},
        [14] = {14,"ตอบคำถามทั้งเซิร์ฟ","ทุกวันจันทร์ พุธ ศุกร์ อาทิตย์","ตอบคำถามทั้งเซิร์ฟเปิดทุกวันจันทร์ พุธ ศุกร์ อาทิตย์18น. จำนวนคนในกองทัพเข้าร่วมยิ่งเยอะ รางวัลประมูลยิ่งเยอะ; ผู้เล่นที่เข้าร่วมกิจกรรมจะได้รับโบนัสประมูลกองทัพ",0,},
    }
}

return time_limit_activity