--treasure

local treasure = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --宝物名称-泰语-string 
      description = 3,    --宝物描述-泰语-string 
      is_work = 4,    --生效-int 
    
    },
    -- data
    _data = {
        [1] = {101,"อูจื้อ","กลียุคขุนพลง่อก่อกำเนิด ง่อคือศิษย์ขงจื้อ เชี่ยวชาญพิชัยยุทธ์ลัทธิขงจื้อ เรียกรวมว่าซุนง่อ",1,},
        [2] = {102,"สามแผน","เดิมขื่อว่าหวงสือกงซานเลี่ย เป็นความคิดต่อยอดมาจากตำราของเจียงไท้กง บันทึกการกลยุทธ์ิ์ทางการทหารและการปกครอง",1,},
        [3] = {201," กุ๋ยกู่จื่อ","หุบเขาผีถูกเรียกว่าเป็นคนประหลาดพันปี เชี่ยวชาญฟ้าดิน มนุษย์ไม่มีอะไรที่ไม่รู้ พิชัยยุทธ์หุบเขาผีมีทั้งหมด14บท",1,},
        [4] = {202,"วิชาตุ้นเจี่ย","ฉีเหมินตุ้นเจี่ยเป็นกลยุทธ์ิ์เคล็ดลับของลัทธิเต๋า ศึกษาเรื่องของฟ้าดิน ว่ากันว่าโจจู๋เคยใช้วิชานี้",1,},
        [5] = {203,"วิชาสุมา","ว่ากันว่าเจียงไท้กงในยุคชุนชิวเป็นคนแต่ง เป็นพิชัยยุทธ์โบราณที่สุดที่มีอยู่ในปัจจุบันของจีน",1,},
        [6] = {301,"ตำราซุนวู","พิชัยยุทธ์ที่มีชื่อเสียง ซุนวูเป็นผู้แต่งขึ้นในยุคชุนชิว ความรู้ลึกซึ้ง ถูกเรียกว่าคัมภีร์การรบ",1,},
        [7] = {302,"ตำราอู่โหว","หรือเรียกว่าเจียงย่วน จูกัดเหลียงใช้ทหารดั่งเทพ คัมภีร์นี้เป็นการบันทึกเรื่องการทหารของขงเบ้ง แนวทางการดูขุนพล",1,},
        [8] = {303,"ตำราโจโฉ","โจโฉรบบนหลังม้ามาครึ่งชีวิต นี่คือตำราใหม่โจโฉที่เขียนความสำเร็จ การก่อตั้งรากฐานและการสร้างสรรค์ของคนในอดีต",1,},
        [9] = {304,"ตำราไท้ผิง","ว่ากันว่าเตียวก๊กขึ้นเขาเก็บสมุนไพร พบเซียนหนานหัว ได้รับการถ่ายทอดตำราไท้ผิงภายหลังก่อตั้งลัทธิไท้ผิง",1,},
        [10] = {401,"โลก·ตำราซุนวู","พิชัยยุทธ์ที่มีชื่อเสียง ซุนวูเป็นผู้แต่งขึ้นในยุคชุนชิว ความรู้ลึกซึ้ง ถูกเรียกว่าคัมภีร์การรบ",1,},
        [11] = {402,"โลก·ตำราอู่โหว","หรือเรียกว่าเจียงย่วน จูกัดเหลียงใช้ทหารดั่งเทพ คัมภีร์นี้เป็นการบันทึกเรื่องการทหารของขงเบ้ง แนวทางการดูขุนพล",1,},
        [12] = {403,"โลก·ตำราโจโฉ","โจโฉรบบนหลังม้ามาครึ่งชีวิต นี่คือตำราใหม่โจโฉที่เขียนความสำเร็จ การก่อตั้งรากฐานและการสร้างสรรค์ของคนในอดีต",1,},
        [13] = {404,"โลก·ตำราไท้ผิง","ว่ากันว่าเตียวก๊กขึ้นเขาเก็บสมุนไพร พบเซียนหนานหัว ได้รับการถ่ายทอดตำราไท้ผิงภายหลังก่อตั้งลัทธิไท้ผิง",1,},
        [14] = {111,"ยันต์วัววิ่ง","เคาทูมีกำลังขนาดลากหางวัวได้ โจโฉจึงสร้างตราทหารนี้ให้กับเขา",1,},
        [15] = {112,"ยันต์ม้าป่า","ตราทหารของแม่ทัพม้าขาวกองซุนจ้าน เมื่อย้ายเมืองหลวงแล้วตราทหารก็ไม่รู้หายไปไหน",1,},
        [16] = {211,"ยันต์หมาป่า","เพราะสุมาอี้มีโหงวเฮ้งดุจหมาป่า จึงได้สร้างยันต์พิเศษนี้ ตรานี้อยู่ติดตัวสุมาอี้มาตลอด รบสร้างความชอบมากมาย",1,},
        [17] = {212,"ยันต์เสือดาว","ทหารเอกไวปานเทพ ขุนพลแฮหัวเอี๋ยนครอบครองยันต์เสือดาว ถูกเรียกว่าเป็นเสือล่าสลาตัน",1,},
        [18] = {213,"ยันต์อสรพิษ","หวดเจ้งเชี่ยวชาญวางแผน ครอบครองตราอสรพิษ ช่วยให้เล่าปี่บุกยึดฮั่นต๋ง เป็นที่ไว้วางใจและชื่นชอบของเล่าปี่",1,},
        [19] = {311,"ยันต์มังกร","หวยหนานจือบันทึก3บท: ผู้ที่เป็นเทพสวรรค์ มังกรเขียวสูงศักดิ์ ตรามังกรเขียวคือตราทหารของขุนพลกวนอู",1,},
        [20] = {312,"ยันต์เสือ","พยัคฆ์ขาวตัวแทนดาวตะวันตก เป็นสัญลักษณ์แห่งคุณธรรม ความกล้า บารมี ว่ากันว่าม้าเฉียวแห่งเสเหลียงเคยครอบครองตราทหารนี้",1,},
        [21] = {313,"ยันต์หงส์","หงส์ไฟคือหนึ่งในสี่อสูรสวรรค์ เป็นตัวแทนของเทพอัคคีและดาวแดนใต้ จิวยี่เคยครอบครองตราทหารนี้ ภายหลังไม่รู้หายไปไหน",1,},
        [22] = {314,"ยันต์เต่า","เต่าดำคือการรวมร่างของงูเต่า ชีวิตอมตะ ถูกเรียกว่าจักรรรดิพลังยุทธ์ ว่ากันว่าเป็นตราทหารที่ขุนพลแดงโจจู๋ใช้ควบคุมศาสตราวุธ",1,},
        [23] = {411,"โลก·ยันต์มังกร","หวยหนานจือบันทึก3บท: ผู้ที่เป็นเทพสวรรค์ มังกรเขียวสูงศักดิ์ ตรามังกรเขียวคือตราทหารของขุนพลกวนอู",1,},
        [24] = {412,"โลก·ยันต์เสือ","พยัคฆ์ขาวตัวแทนดาวตะวันตก เป็นสัญลักษณ์แห่งคุณธรรม ความกล้า บารมี ว่ากันว่าม้าเฉียวแห่งเสเหลียงเคยครอบครองตราทหารนี้",1,},
        [25] = {413,"โลก·ยันต์หงส์","หงส์ไฟคือหนึ่งในสี่อสูรสวรรค์ เป็นตัวแทนของเทพอัคคีและดาวแดนใต้ จิวยี่เคยครอบครองตราทหารนี้ ภายหลังไม่รู้หายไปไหน",1,},
        [26] = {414,"โลก·ยันต์เต่า","เต่าดำคือการรวมร่างของงูเต่า ชีวิตอมตะ ถูกเรียกว่าจักรรรดิพลังยุทธ์ ว่ากันว่าเป็นตราทหารที่ขุนพลแดงโจจู๋ใช้ควบคุมศาสตราวุธ",1,},
    }
}

return treasure