--tree_decorate_add

local tree_decorate_add = {
    -- key
    __key_map = {
      type = 1,    --装饰类型-int 
      name = 2,    --装饰名称-泰语-string 
      title_x = 3,    --ui标题坐标x-int 
      title_y = 4,    --ui标题坐标y-int 
    
    },
    -- data
    _data = {
        [1] = {1,"แท่นน้ำค้าง",20,-60,},
        [2] = {1,"แท่นน้ำค้าง",20,-60,},
        [3] = {1,"แท่นน้ำค้าง",20,-60,},
        [4] = {1,"แท่นน้ำค้าง",20,-60,},
        [5] = {1,"แท่นน้ำค้าง",20,-60,},
        [6] = {1,"แท่นน้ำค้าง",20,-60,},
        [7] = {1,"แท่นน้ำค้าง",20,-60,},
        [8] = {1,"แท่นน้ำค้าง",20,-60,},
        [9] = {1,"แท่นน้ำค้าง",20,-60,},
        [10] = {1,"แท่นน้ำค้าง",20,-60,},
        [11] = {2,"หลินจือแดง",0,-70,},
        [12] = {2,"หลินจือแดง",0,-70,},
        [13] = {2,"หลินจือแดง",0,-70,},
        [14] = {2,"หลินจือแดง",0,-70,},
        [15] = {2,"หลินจือแดง",0,-70,},
        [16] = {2,"หลินจือแดง",0,-70,},
        [17] = {2,"หลินจือแดง",0,-70,},
        [18] = {2,"หลินจือแดง",0,-70,},
        [19] = {2,"หลินจือแดง",0,-70,},
        [20] = {2,"หลินจือแดง",0,-70,},
        [21] = {3,"ป่าไผ่มรกต",0,-40,},
        [22] = {3,"ป่าไผ่มรกต",0,-40,},
        [23] = {3,"ป่าไผ่มรกต",0,-40,},
        [24] = {3,"ป่าไผ่มรกต",0,-40,},
        [25] = {3,"ป่าไผ่มรกต",0,-40,},
        [26] = {3,"ป่าไผ่มรกต",0,-40,},
        [27] = {3,"ป่าไผ่มรกต",0,-40,},
        [28] = {3,"ป่าไผ่มรกต",0,-40,},
        [29] = {3,"ป่าไผ่มรกต",0,-40,},
        [30] = {3,"ป่าไผ่มรกต",0,-40,},
        [31] = {4,"โคมนพเก้า",0,-60,},
        [32] = {4,"โคมนพเก้า",0,-60,},
        [33] = {4,"โคมนพเก้า",0,-60,},
        [34] = {4,"โคมนพเก้า",0,-60,},
        [35] = {4,"โคมนพเก้า",0,-60,},
        [36] = {4,"โคมนพเก้า",0,-60,},
        [37] = {4,"โคมนพเก้า",0,-60,},
        [38] = {4,"โคมนพเก้า",0,-60,},
        [39] = {4,"โคมนพเก้า",0,-60,},
        [40] = {4,"โคมนพเก้า",0,-60,},
        [41] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [42] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [43] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [44] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [45] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [46] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [47] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [48] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [49] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [50] = {5,"บ่อน้ำเก้าสวรรค์",0,-50,},
        [51] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [52] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [53] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [54] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [55] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [56] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [57] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [58] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [59] = {6,"ก้อนหยกหลิงหลง",0,-50,},
        [60] = {6,"ก้อนหยกหลิงหลง",0,-50,},
    }
}

return tree_decorate_add