--tree_info

local tree_info = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --主树名称-泰语-string 
      up_text = 3,    --升级界面提示文本-泰语-string 
      up_text_1 = 4,    --升级界面提示文本-泰语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ต้นไม้เทพ","แท่นน้ำค้าง","ได้เครื่องประดับใหม่:แท่นน้ำค้าง",},
        [2] = {2,"ต้นไม้เทพ","หลินจือแดง","ได้เครื่องประดับใหม่:หลินจือแดง",},
        [3] = {3,"ต้นไม้เทพ","ป่าไผ่มรกต","ได้เครื่องประดับใหม่:ป่าไผ่มรกต",},
        [4] = {4,"ต้นไม้เทพ","บ่อน้ำเก้าสวรรค์","ได้เครื่องประดับใหม่:บ่อน้ำเก้าสวรรค์",},
        [5] = {5,"ต้นไม้เทพ","ก้อนหยกหลิงหลง","ได้เครื่องประดับใหม่:ก้อนหยกหลิงหลง",},
        [6] = {6,"ต้นไม้เทพ","โคมนพเก้า","ได้เครื่องประดับใหม่:โคมนพเก้า",},
        [7] = {7,"ต้นไม้เทพ","","",},
        [8] = {8,"ต้นไม้เทพ","","",},
        [9] = {9,"ต้นไม้เทพ","","",},
        [10] = {10,"ต้นไม้เทพ","","",},
        [11] = {11,"ต้นไม้เทพ","","",},
    }
}

return tree_info