--type_manage

local type_manage = {
    -- key
    __key_map = {
      id = 1,    --资源类型编号-int 
      name = 2,    --名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"ขุนพล",},
        [2] = {2,"อุปกรณ์",},
        [3] = {3,"สมบัติ",},
        [4] = {4,"ศาสตรา",},
        [5] = {5,"ทรัพยากร",},
        [6] = {6,"ไอเทม",},
        [7] = {7,"เศษ",},
        [8] = {8,"อัญมณี",},
        [9] = {9,"การ์ดแปลงร่าง",},
        [10] = {10,"อสูรเทพ",},
        [11] = {11,"ถุงแพร",},
        [12] = {12,"ม้าศึก",},
        [13] = {13,"ยอดขุนพลแห่งยุค",},
        [14] = {14,"ยอดขุนพลแห่งยุคอาวุธ",},
        [15] = {15,"อุปกรณ์ม้าศึก",},
        [16] = {16,"หินหยก",},
        [17] = {17,"กรอบรูปโปรไฟล์",},
        [18] = {18,"ฉายา",},
    }
}

return type_manage