--update_redpacket

local update_redpacket = {
    -- key
    __key_map = {
      id = 1,    --红包id-int 
      name = 2,    --红包名称-string 
    
    },
    -- data
    _data = {
        [1] = {99,"อั่งเปาใหญ่ครื้นเครง",},
        [2] = {1,"ขุนพลสีแดงราคาเดียว",},
        [3] = {2,"เศษขุนพลแดงราคาเดียว",},
        [4] = {3,"ศาสตราสีแดงราคาเดียว",},
        [5] = {4,"ศาสตราวุธสารพัดนึกสีแดงราคาเดียว",},
        [6] = {5,"ชุนชิวราคาเดียว",},
        [7] = {6,"กลียุคราคาเดียว",},
        [8] = {7,"ถุงแพรแดงราคาเดียว",},
        [9] = {8,"ถุงแพรส้มราคาเดียว",},
        [10] = {9,"ป้ายเลือกคนราคาเดียว",},
        [11] = {10,"ป้ายเลือกคนดีราคาเดียว",},
    }
}

return update_redpacket