--festival_res

local festival_res = {
    -- key
    __key_map = {
      id = 1,    --排序id_key-int 
      res_name = 2,    --资源名称-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"欢庆佳节-夏季通用",},
        [2] = {2,"说明-夏季通用",},
        [3] = {3,"欢庆佳节-通用",},
        [4] = {4,"说明-通用",},
        [5] = {5,"欢庆佳节-七夕新版",},
        [6] = {6,"说明-七夕新版",},
        [7] = {7,"宣传-七夕新版",},
        [8] = {8,"欢庆佳节-合服",},
        [9] = {9,"说明-合服",},
        [10] = {10,"宣传-国庆",},
        [11] = {11,"欢庆佳节-秋季通用",},
        [12] = {12,"说明-秋季通用",},
        [13] = {13,"欢庆佳节-双11狂欢",},
        [14] = {14,"说明-双11狂欢",},
        [15] = {15,"欢庆佳节-年终盛典",},
        [16] = {16,"说明-年终盛典",},
        [17] = {17,"欢庆佳节-快乐圣诞",},
        [18] = {18,"说明-快乐圣诞",},
        [19] = {19,"欢庆佳节-喜迎新春-废弃",},
        [20] = {20,"说明-喜迎新春",},
        [21] = {53,"欢庆佳节-和煦阳春",},
        [22] = {54,"说明-和煦阳春",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [53] = 21,
        [54] = 22,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return festival_res