--explore

local explore = {
    -- key
    __key_map = {
      id = 1,    --章节-int 
      name = 2,    --章节名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Đào Viên",},
        [2] = {2,"Từ Châu",},
        [3] = {3,"Hổ Lao Quan",},
        [4] = {4,"Ngũ Trượng Nguyên",},
        [5] = {5,"Ngọc Môn Quan",},
        [6] = {6,"Phàn Dương Hồ",},
        [7] = {7,"Ngọa Long Cương",},
        [8] = {8,"Xích Bích",},
        [9] = {9,"Ô Sào",},
        [10] = {10,"Hứa Xương",},
        [11] = {11,"Thường Sơn",},
        [12] = {12,"Tân Dã",},
        [13] = {13,"Tây Lương",},
        [14] = {14,"Hạ Phì",},
        [15] = {15,"Uyển Thành",},
        [16] = {16,"Bàn Hà",},
        [17] = {17,"Trần Lưu",},
        [18] = {18,"Lạc Dương",},
        [19] = {19,"Kỳ Sương",},
        [20] = {20,"Trường Bản Pha",},
        [21] = {21,"U Châu",},
        [22] = {22,"Nhai Đình",},
        [23] = {23,"Bạch Đế",},
        [24] = {24,"Quan Độ",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return explore