--mine_output

local mine_output = {
    -- key
    __key_map = {
      id = 1,    --id-int 
      output_show = 2,    --显示产量-string 
      description = 3,    --状态描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"","Thường",},
        [2] = {2,"","Thường",},
        [3] = {3,"","Thường",},
        [4] = {4,"","Thường",},
        [5] = {5,"","Thường",},
        [6] = {6,"600/ngày","Thường",},
        [7] = {7,"480/ngày","Đầy",},
        [8] = {8,"360/ngày","Đầy",},
        [9] = {9,"360/ngày","Đầy",},
        [10] = {10,"360/ngày","Đầy",},
        [11] = {11,"400/ngày","Thường",},
        [12] = {12,"320/ngày","Đầy",},
        [13] = {13,"240/ngày","Đầy",},
        [14] = {14,"240/ngày","Đầy",},
        [15] = {15,"240/ngày","Đầy",},
        [16] = {16,"200/ngày","Thường",},
        [17] = {17,"160/ngày","Đầy",},
        [18] = {18,"120/ngày","Đầy",},
        [19] = {19,"120/ngày","Đầy",},
        [20] = {20,"120/ngày","Đầy",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return mine_output