--mine_pit

local mine_pit = {
    -- key
    __key_map = {
      pit_id = 1,    --矿坑id-int 
      pit_name = 2,    --矿坑名称-string 
    
    },
    -- data
    _data = {
        [1] = {100,"Lạc Dương",},
        [2] = {101,"Hứa Xương",},
        [3] = {102,"Trần Lưu",},
        [4] = {103,"Bộc Dương",},
        [5] = {104,"Hạ Phì",},
        [6] = {105,"Tấn Dương",},
        [7] = {106,"Nam Bì",},
        [8] = {107,"Thảo Nguyên",},
        [9] = {108,"Tiểu Bái",},
        [10] = {109,"Bì Hải",},
        [11] = {110,"Nghiệp Thành",},
        [12] = {201,"Trường An",},
        [13] = {202,"Tương Dương",},
        [14] = {203,"Uyển Thành",},
        [15] = {204,"Hán Trung",},
        [16] = {205,"Vĩnh Ân",},
        [17] = {206,"Giang Châu",},
        [18] = {207,"Thượng Dung",},
        [19] = {208,"Thiên Thủy",},
        [20] = {209,"An Định",},
        [21] = {210,"Thành Đô",},
        [22] = {301,"Thọ Xuyến",},
        [23] = {302,"Giang Hạ",},
        [24] = {303,"Sài Tang",},
        [25] = {304,"Lư Giang",},
        [26] = {305,"Giang Lăng",},
        [27] = {306,"Vũ Lân",},
        [28] = {307,"Phượng Tường",},
        [29] = {308,"Cối Kê",},
        [30] = {309,"Ngô Quận",},
        [31] = {310,"Kiến Nghiệp",},
    },

    -- index
    __index_pit_id = {
        [100] = 1,
        [101] = 2,
        [102] = 3,
        [103] = 4,
        [104] = 5,
        [105] = 6,
        [106] = 7,
        [107] = 8,
        [108] = 9,
        [109] = 10,
        [110] = 11,
        [201] = 12,
        [202] = 13,
        [203] = 14,
        [204] = 15,
        [205] = 16,
        [206] = 17,
        [207] = 18,
        [208] = 19,
        [209] = 20,
        [210] = 21,
        [301] = 22,
        [302] = 23,
        [303] = 24,
        [304] = 25,
        [305] = 26,
        [306] = 27,
        [307] = 28,
        [308] = 29,
        [309] = 30,
        [310] = 31,
    }
}

return mine_pit