--notification

local notification = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      lv_min = 2,    --玩家等级MIN-int 
      lv_max = 3,    --玩家等级MAX-int 
    
    },
    -- data
    _data = {
        [1] = {1,0,23,},
        [2] = {2,0,23,},
        [3] = {3,0,255,},
        [4] = {4,24,255,},
        [5] = {5,24,255,},
        [6] = {6,255,255,},
        [7] = {7,30,999,},
        [8] = {8,30,999,},
        [9] = {9,30,999,},
    },

    -- index
    __index_id = {
        [1] = 1,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return notification