--auction

local auction = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --子叶签-string 
    
    },
    -- data
    _data = {
        [1] = {101,"軍団ボス",},
        [2] = {102,"軍団クイズ",},
        [3] = {103,"軍団の試練",},
        [4] = {104,"三国戦記",},
        [5] = {105,"軍団戦",},
        [6] = {201,"全サーバー",},
        [7] = {301,"陣営競技",},
        [8] = {401,"城内の商人",},
        [9] = {501,"神秘の商人",},
        [10] = {601,"全サーバー個人",},
        [11] = {106,"クロスサーバー軍団戦",},
        [12] = {107,"クロスサーバーBOSS",},
    },

    -- index
    __index_id = {
        [101] = 1,
        [102] = 2,
        [103] = 3,
        [104] = 4,
        [105] = 5,
        [106] = 11,
        [107] = 12,
        [201] = 6,
        [301] = 7,
        [401] = 8,
        [501] = 9,
        [601] = 10,
    }
}

return auction