--friend_invite

local friend_invite = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --任务名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"プレイヤーを1名招待",},
        [2] = {2,"プレイヤーを2名招待",},
        [3] = {3,"プレイヤーを3名招待",},
        [4] = {4,"招待したプレイヤー1名がレベル35に到達する",},
        [5] = {5,"招待したプレイヤー2名がレベル35に到達する",},
        [6] = {6,"招待したプレイヤー3名がレベル35に到達する",},
        [7] = {7,"招待したプレイヤー1名が500万戦力に到達する",},
        [8] = {8,"招待したプレイヤー2名が500万戦力に到達する",},
        [9] = {9,"招待したプレイヤー3名が500万戦力に到達する",},
        [10] = {10,"招待されました",},
        [11] = {11,"レベル30に到達する",},
        [12] = {12,"レベル40に到達する",},
        [13] = {13,"レベル50に到達する",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return friend_invite