--guild_stage_talk

local guild_stage_talk = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      talk1 = 2,    --说话1-string 
      talk2 = 3,    --说话2-string 
      talk3 = 4,    --说话3-string 
      talk4 = 5,    --说话4-string 
      talk5 = 6,    --说话5-string 
    
    },
    -- data
    _data = {
        [1] = {1,"なに、誤解するな。お前にだけ言ってない","お前らは全員、雑魚だ","私の拳なら1発でお陀仏だ！","弱者はなぜ戦う?！","お前を消すくらい、指1本で十分だ！",},
        [2] = {2,"川を下り、敵の不意を衝く！","お前は大した奴だ！","俺と互角か！気に入ったぞ！","お前らの軍団も今日で終わりだ！","逃げるな！今日は貴様と300合でも打ち合ってやるわ！",},
        [3] = {3,"こんな厚顔無恥な者は見たことがない！","将軍様、お許しを！うちには老人と子供がいるんです！","是非互角の相手をお探しください！","俺を倒していいところ何一つないぞ！","上のやつ当たってください。",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [2] = 2,
        [3] = 3,
    }
}

return guild_stage_talk