--horse

local horse = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --装备名称-string 
      description = 3,    --装备描述-string 
      type = 4,    --泛用性-string 
    
    },
    -- data
    _data = {
        [1] = {1,"青騅","灰色がかった駿馬。矢に向かって疾走するほど、戦場をまったく恐れない","すべて",},
        [2] = {2,"緑耳","青味がかった黄色の馬で、穆王八駿の一。1日に千里走っても疲れ知らず","すべて",},
        [3] = {3,"渠黄","渠黄は、その名の通り全身が淡い黄色の馬。伝説の穆王八駿の一頭。飛ぶように速く走れる","すべて",},
        [4] = {4,"棗騮","全身褐色で、皮膚は鋼鉄のよう。力が強く、百斤の重さを乗せても、なお飛ぶように速く走れる","すべて",},
        [5] = {5,"雪里白","全身が白いが、蹄のみ黒。雪原を平地のごとく歩む。馬の中の君子","すべて",},
        [6] = {6,"颯露紫","紫の飛燕の如く颯爽と走る。骨ばっていて、大河をも恐れず、八陣を踏みつける","すべて",},
        [7] = {7,"紅玉輦","紅玉輦。身体は紅の玉のよう、縁起の良い皇帝の馬","すべて",},
        [8] = {8,"碧驄駒","毛色は青白く、体は頑健。龍が天翔けるように走り、速いうえに姿が美しい","すべて",},
        [9] = {9,"飛霜千里","雪のように真っ白な体躯は不思議なほどしなやかで、万里走ろうとも疲れ知らず。通り過ぎた場所には霜が舞い、誰も近づけないほどの冷気を漂わせる","支援系",},
        [10] = {10,"烏雲踏雪","全身は黒い緞子のようで、てらてらと光を放ち、4本の蹄だけが雪のように白い。背中は長くて腰は短く平ら。四肢の関節や腱は丈夫で、重装甲で覆っても物ともしない","火力系",},
        [11] = {11,"赤炎龍","赤炎龍は全身が焼け炭のような赤毛で雑毛は無い。吼える姿は今にも天に上り海に入るかのよう。たてがみは江波のようだが、また少女の髪のように柔らかい。その足は飛ぶように速く、山河を平地のごとく駆け抜ける","回復系",},
        [12] = {12,"夜照玉獅","全身が雪のように白いが、首と尾だけは金色の毛で覆われている。蹄は大きく、獅子のような姿で気性が激しい。1日に千里を行き、天険を物ともせず、戦場でも無人の世界を行き来するかのようである","支援、デバフ類",},
        [13] = {15,"奔雷青驄","万里を行く駿馬 障害を飛び越えれば、世にも稀な奔雷轟く。電光を帯びた頭、ほのかに光る足元。走れば迅雷の如き音を発して過ぎていく。人の考えをよく理解し、持久力に優れ、英雄の戦場での活躍を助ける","タンク系",},
        [14] = {13,"神・爪黄飛電","全身真っ白で、四蹄が黄色い。性質は高貴で非凡。傲慢で並ぶ者なし、ほかとは違うと自惚れている。梟雄帝王の馬","すべて",},
        [15] = {14,"神・的盧追月","日月に届きそうなほどの猛々しいまでの速さを有する。水中を歩き、一跳びで三丈を飛ぶこともでき、谷川や淵など物ともしない","すべて",},
        [16] = {16,"鉄血紅鬃","鎧に艱難辛苦がのしかかり、戦馬は赤い鬃をなびかせ走る。疾駆する赤い鬃は火炎のようで、鉄血馬の蹄が踏んだ地はもとより、この世の不合理さえもすべて焼き尽くす","火計タイプ",},
        [17] = {17,"闇夜の紫騂","胡笳鳴り朱鷺飛び立つ、鼓打ち鳴らせば紫騂豪たり。闇夜の精霊は、闇の中から生命の光を吸い取り、何も言わず英雄たちを見守り、困難を乗り越え、ともに前へ進む","すべて",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 14,
        [14] = 15,
        [15] = 13,
        [16] = 16,
        [17] = 17,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return horse