--horse_group

local horse_group = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --图鉴名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"緑影揺青",},
        [2] = {2,"採黄棄棗",},
        [3] = {3,"今宵白露",},
        [4] = {4,"紅林碧染",},
        [5] = {5,"白雪飛庭",},
        [6] = {6,"紫雲崖生",},
        [7] = {7,"赤炎紅玉",},
        [8] = {8,"碧影月照",},
        [9] = {11,"電光石火",},
        [10] = {12,"月明星稀",},
        [11] = {14,"是非明白",},
        [12] = {9,"吹雪拂霜",},
        [13] = {10,"紅欄夜火",},
        [14] = {13,"烈火迅雷",},
        [15] = {15,"天地の差",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 13,
        [11] = 9,
        [12] = 10,
        [13] = 14,
        [14] = 11,
        [15] = 15,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 12,
    }
}

return horse_group