--late_regist

local late_regist = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      button_txt = 2,    --按钮文字-string 
      name = 3,    --条件名-string 
    
    },
    -- data
    _data = {
        [1] = {1,"受領","Lv%dに到達する",},
        [2] = {2,"受領","Lv%dに到達する",},
        [3] = {3,"受領","Lv%dに到達する",},
        [4] = {4,"受領","Lv%dに到達する",},
        [5] = {5,"受領","Lv%dに到達する",},
        [6] = {6,"受領","Lv%dに到達する",},
        [7] = {7,"受領","Lv%dに到達する",},
        [8] = {8,"受領","Lv%dに到達する",},
        [9] = {9,"受領","Lv%dに到達する",},
        [10] = {10,"受領","Lv%dに到達する",},
        [11] = {11,"受領","Lv%dに到達する",},
        [12] = {12,"受領","Lv%dに到達する",},
        [13] = {13,"受領","Lv%dに到達する",},
        [14] = {14,"受領","Lv%dに到達する",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return late_regist