--qin_monster

local qin_monster = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --boss序号-int 
      big_name = 2,    --精英怪物名称-string 
      small_name = 3,    --普通怪物名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"皇陵の悪魔","秦の重装兵",},
        [2] = {2,"皇陵の悪魔","秦の重装兵",},
        [3] = {3,"皇陵の悪魔","秦の重装兵",},
        [4] = {4,"皇陵の悪魔","秦の歩兵",},
        [5] = {5,"皇陵の悪魔","秦の歩兵",},
        [6] = {6,"皇陵の悪魔","秦の歩兵",},
        [7] = {7,"皇陵の悪魔","秦の戦車",},
        [8] = {8,"皇陵の悪魔","秦の戦車",},
        [9] = {9,"皇陵の悪魔","秦の戦車",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return qin_monster