--recover

local recover = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --数值ID-int 
      name = 2,    --数值名称-string 
    
    },
    -- data
    _data = {
        [1] = {3,"行動力",},
        [2] = {4,"気力",},
        [3] = {11,"討伐回数",},
        [4] = {12,"挑戦回数",},
        [5] = {22,"兵糧",},
        [6] = {23,"攻撃回数",},
        [7] = {34,"移動回数",},
    },

    -- index
    __index_id = {
        [11] = 3,
        [12] = 4,
        [22] = 5,
        [23] = 6,
        [3] = 1,
        [34] = 7,
        [4] = 2,
    }
}

return recover