{
  "_{1791_67_1001}_": "มังกรหลับใน'มังกรหลับหงส์อ่อน'หมายถึงจูกัดเหลียง",
  "_{1791_67_1002}_": "มังกรหลับใน'มังกรหลับหงส์อ่อน'หมายถึงบังทอง",
  "_{1791_67_1003}_": "หงส์อ่อนใน'มังกรหลับหงส์อ่อน'หมายถึงบังทอง",
  "_{1791_67_1004}_": "หงส์อ่อนใน'มังกรหลับหงส์อ่อน'หมายถึงจูกัดเหลียง",
  "_{1791_67_1005}_": "ฉายา'ขุนพลม้าขาว'ในสามก๊กหมายถึงกองซุนจ้าน",
  "_{1791_67_1006}_": "ฉายา'ขุนพลม้าขาว'ในสามก๊กหมายถึงจูล่ง",
  "_{1791_67_1007}_": "อ้องอุ้นวางอุบายห่วงโซ่กำจัดตั๋งโต๊ะ",
  "_{1791_67_1008}_": "โจโฉวางอุบายห่วงโซ่กำจัดตั๋งโต๊ะ",
  "_{1791_67_1009}_": "ม้าเจ๊กสูญเสียด่านเกเต๋ง ถูกขงเบ้งตัดหัว",
  "_{1791_67_1010}_": "ม้าเลี้ยงสูญเสียด่านเกเต๋ง ถูกขงเบ้งตัดหัว",
  "_{1791_67_1011}_": "โจโฉควบคุมโอรสสวรรค์บัญชาเจ้าผู้ครองแคว้น",
  "_{1791_67_1012}_": "ตั๋งโต๊ะควบคุมโอรสสวรรค์บัญชาเจ้าผู้ครองแคว้น",
  "_{1791_67_1013}_": "ขงเบ้งล้มป่วยตายอยู่ที่ทุ่งอู่จั้งหยวนในขณะปราบปรามครั้งสุดท้าย",
  "_{1791_67_1014}_": "ขงเบ้งล้มป่วยตายอยู่ที่เนินพกบ๋องในขณะปราบปรามครั้งสุดท้าย",
  "_{1791_67_1015}_": "ใน《สามก๊ก》ขุนพลที่ทำให้โจโฉตัดหนวดหนีตายคือม้าเฉียว",
  "_{1791_67_1016}_": "ใน《สามก๊ก》ขุนพลที่ทำให้โจโฉตัดหนวดหนีตายคือเตียวหุย",
  "_{1791_67_1017}_": "ใน《สามก๊ก》 สมรภูมิรบเนินเตียวปันโป๋ จูล่งแย่งชิงกระบี่หลงเฉวียนของโจโฉ",
  "_{1791_67_1018}_": "ใน《สามก๊ก》 สมรภูมิรบเนินเตียวปันโป๋ จูล่งแย่งชิงกระบี่หยี่เทียนของโจโฉ",
  "_{1791_67_1019}_": "เล่าปี่ตั้งตนว่าเป็นทายาทของจงซานจิ้งหวาง",
  "_{1791_67_101}_": "พกพาถุงแพรสีม่วงสามารถเพิ่มพลังรบ72000",
  "_{1791_67_1020}_": "เล่าปี่ตั้งตนว่าเป็นทายาทของซานตงฉีหวาง",
  "_{1791_67_1021}_": "เสี่ยวป้าหวางเป็นฉายาของซุนเซ็ก",
  "_{1791_67_1022}_": "เสี่ยวป้าหวางเป็นฉายาของซุนกวน",
  "_{1791_67_1023}_": "ชื่อรองของเตียวหุยคืออี้เต๋อ",
  "_{1791_67_1024}_": "ชื่อรองของเตียวหุยคือยี่เต๋อ",
  "_{1791_67_1025}_": "สถานที่ที่เล่าปี่ฝากบุตรคือเมืองเป๊กเต้",
  "_{1791_67_1026}_": "สถานที่ที่เล่าปี่ฝากบุตรคือเฉิงตู",
  "_{1791_67_1027}_": "ในสามก๊กผู้ที่ถูกเรียกว่าซินแสกระจกเงาคือสุมาเต๊กโช",
  "_{1791_67_1028}_": "ในสามก๊กผู้ที่ถูกเรียกว่าซินแสกระจกเงาคือฮองเสงหงัน",
  "_{1791_67_1029}_": "เส้าตี้เล่าเปียนถูกตั๋งโต๊ะล้มเลิก",
  "_{1791_67_102}_": "พกพาถุงแพรสีส้มสามารถเพิ่มพลังรบ240000",
  "_{1791_67_1030}_": "เส้าตี้เล่าเปียนถูกโจโฉล้มเลิก",
  "_{1791_67_1031}_": "เหมือนเคี้ยวซี่โครงไก่เป็นคำพูดจากปากของเอียวสิ้ว",
  "_{1791_67_1032}_": "เหมือนเคี้ยวซี่โครงไก่เป็นคำพูดจากปากของเตียวสิ้ว",
  "_{1791_67_1033}_": "ในสามก๊ก ผู้ที่ปล่อยโจโฉในเส้นทางฮัวหยงคือกวนอู",
  "_{1791_67_1034}_": "ในสามก๊ก ผู้ที่ปล่อยโจโฉในเส้นทางฮัวหยงคือเล่าปี่",
  "_{1791_67_1035}_": "ชุดขาวข้ามแม่น้ำหมายถึงตำนานของลิบอง",
  "_{1791_67_1036}_": "ชุดขาวข้ามแม่น้ำหมายถึงตำนานของจูล่ง",
  "_{1791_67_1037}_": "จูกัดเหลียงจุดตะเกียง7ดาวต่อชะตา อุยเอี๋ยนบุกกระโจมล้มตะเกียง7ดาว ทำให้ตะเกียง7ดาวดับ",
  "_{1791_67_1038}_": "จูกัดเหลียงจุดตะเกียง7ดาวต่อชะตา เกียงอุยบุกกระโจมล้มตะเกียง7ดาว ทำให้ตะเกียง7ดาวดับ",
  "_{1791_67_1039}_": "หลังจากเล่าปี่เสียชีวิตถูกแต่งตั้งเป็นฮั่นเจาเลี่ยตี้",
  "_{1791_67_103}_": "พกพาถุงแพรสีแดงสามารถเพิ่มพลังรบ720000",
  "_{1791_67_1040}_": "หลังจากเล่าปี่เสียชีวิตถูกแต่งตั้งเป็นฮั่นกวังอู่ตี้",
  "_{1791_67_1041}_": "บังทองสิ้นชีวิตที่เนินหงส์ร่วง",
  "_{1791_67_1042}_": "บังทองสิ้นชีวิตที่หอประตูขาว",
  "_{1791_67_1043}_": "สถานที่ที่สามวีรบุรุษรบลิโป้อยู่ที่ด่านเฮาโลก๋วน",
  "_{1791_67_1044}_": "สถานที่ที่สามวีรบุรุษรบลิโป้อยู่ที่จวี้ลู่",
  "_{1791_67_1045}_": "จักรพรรดิองค์สุดท้ายของง่อก๊กในยุคสามก๊กคือซุนโฮ",
  "_{1791_67_1046}_": "จักรพรรดิองค์สุดท้ายของง่อก๊กในยุคสามก๊กคือซุนเหลียง",
  "_{1791_67_1047}_": "ที่ปรึกษาที่มีฉายาว่านักรบพิษคือกาเซี่ยง",
  "_{1791_67_1048}_": "ที่ปรึกษาที่มีฉายาว่านักรบพิษคือสุมาอี้",
  "_{1791_67_1049}_": "จูกัดเหลียงถ่ายทอดวิชาให้กับเกียงอุย",
  "_{1791_67_104}_": "พกพาถุงแพรสีทองสามารถเพิ่มพลังรบ2160000",
  "_{1791_67_1050}_": "จูกัดเหลียงถ่ายทอดวิชาให้กับจูล่ง",
  "_{1791_67_1051}_": "หลังจากเล่าเสี้ยนจำนนต่อวุยก๊กถูกแต่งตั้งเป็นอันเล่อกง",
  "_{1791_67_1052}_": "หลังจากเล่าเสี้ยนจำนนต่อวุยก๊กถูกแต่งตั้งเป็นเสี่ยงเล่อกง",
  "_{1791_67_1053}_": "สุภาษิตสุขจนลืมบ้านเกิดหมายถึงเล่าเสี้ยน",
  "_{1791_67_1054}_": "สุภาษิตสุขจนลืมบ้านเกิดหมายถึงเล่าฮอง",
  "_{1791_67_1055}_": "ในยุคสามก๊ก ผู้บัญชาการของหน่วยทะลวงค่ายคือโกซุ่น",
  "_{1791_67_1056}_": "ในยุคสามก๊ก ผู้บัญชาการของหน่วยทะลวงค่ายคือกวนอู",
  "_{1791_67_1057}_": "หัวหน้าพันธมิตรของกองทัพสิบเเปดหัวเมืองพันธมิตรปราบตั๋งโต๊ะคืออ้วนเสี้ยว",
  "_{1791_67_1058}_": "หัวหน้าพันธมิตรของกองทัพสิบเเปดหัวเมืองพันธมิตรปราบตั๋งโต๊ะคือโจโฉ",
  "_{1791_67_1059}_": "อุ่นสุราวิจารณ์วีรบุรุษในยุคสามก๊กคือเล่าปี่และโจโฉ",
  "_{1791_67_105}_": "พกพาถุงแพรสีม่วงสามารถเพิ่มพลังรบ160000",
  "_{1791_67_1060}_": "อุ่นสุราวิจารณ์วีรบุรุษในยุคสามก๊กคือเล่าปี่และจูกัดเหลียง",
  "_{1791_67_1061}_": "'ตัวอยู่ที่ค่ายโจโฉ ใจภักดีราชวงค์ฮั่น'หมายถึงชีซีในสามก๊ก",
  "_{1791_67_1062}_": "'ตัวอยู่ที่ค่ายโจโฉ ใจภักดีราชวงค์ฮั่น'หมายถึงจูกัดเอี๋ยนในสามก๊ก",
  "_{1791_67_1063}_": "เมืองหลวงของจ๊กก๊กในสามก๊กอยู่ที่เฉิงตู",
  "_{1791_67_1064}_": "เมืองหลวงของจ๊กก๊กในสามก๊กอยู่ที่ฉงชิ่ง",
  "_{1791_67_1065}_": "อ้วนเสี้ยวและอ้วนสุดเป็นพี่น้องกัน",
  "_{1791_67_1066}_": "อ้วนเสี้ยวและอ้วนสุดเป็นพ่อลูกกัน",
  "_{1791_67_1067}_": "จูกัดเหลียงชำนาญการใช้โจมตีไฟ ไฟแรกของเขาเผาไหม้เนินพกบ๋อง",
  "_{1791_67_1068}_": "จูกัดเหลียงชำนาญการใช้โจมตีไฟ ไฟแรกของเขาเผาไหม้ผาแดง",
  "_{1791_67_1069}_": "ใน《สามก๊ก》 ลูกบุญธรรมของกวนอูคือกวนเป๋ง",
  "_{1791_67_106}_": "พกพาถุงแพรสีส้มสามารถเพิ่มพลังรบ320000",
  "_{1791_67_1070}_": "ใน《สามก๊ก》 ลูกบุญธรรมของกวนอูคือกวนซิง",
  "_{1791_67_1071}_": "ใน《สามก๊ก》เบ้งเฮ็กเคยถูกจูกัดเหลียงจับเจ็ดครั้งแล้วปล่อยเจ็ดครั้ง",
  "_{1791_67_1072}_": "ใน《สามก๊ก》จกหยงเคยถูกจูกัดเหลียงจับเจ็ดครั้งแล้วปล่อยเจ็ดครั้ง",
  "_{1791_67_1073}_": "ใน《สามก๊ก》'ฝ่าห้าด่านสังหารหกขุนพล'หมายถึงกวนอู",
  "_{1791_67_1074}_": "ใน《สามก๊ก》'ฝ่าห้าด่านสังหารหกขุนพล'หมายถึงเตียวหุย",
  "_{1791_67_1075}_": "ใน《สามก๊ก》'ทุ่มเทสติปัญญาเเละความสามารถ ตราบจนชีวิตหาไม่'มาจากจูกัดเหลียง",
  "_{1791_67_1076}_": "ใน《สามก๊ก》'ทุ่มเทสติปัญญาเเละความสามารถ ตราบจนชีวิตหาไม่'มาจากสุมาอี้",
  "_{1791_67_1077}_": "'ข้ายอมทำผิดต่อคนในใต้หล้า แต่ไม่ยอมให้คนในใต้หล้าผิดต่อข้า'มาจากโจโฉ",
  "_{1791_67_1078}_": "'ข้ายอมทำผิดต่อคนในใต้หล้า แต่ไม่ยอมให้คนในใต้หล้าผิดต่อข้า'มาจากตั๋งโต๊ะ",
  "_{1791_67_1079}_": "ใน《สามก๊ก》 ลิโป้เดิมทีติดตามเต๊งหงวน",
  "_{1791_67_107}_": "พกพาถุงแพรสีแดงสามารถเพิ่มพลังรบ640000",
  "_{1791_67_1080}_": "ใน《สามก๊ก》 ลิโป้เดิมทีติดตามตั๋งโต๊ะ",
  "_{1791_67_1081}_": "ขุนพลใหญ่โฮจิ๋น อาชีพดั้งเดิมคือคนขายเนื้อ",
  "_{1791_67_1082}_": "ขุนพลใหญ่โฮจิ๋น อาชีพดั้งเดิมคือช่างตีเหล็ก",
  "_{1791_67_1083}_": "เต๊งหงวนเป็นคนแรกที่ออกมาต่อต้านตั๋งโต๊ะสละราชย์",
  "_{1791_67_1084}_": "อ้องอุ้นเป็นคนแรกที่ออกมาต่อต้านตั๋งโต๊ะสละราชย์",
  "_{1791_67_1085}_": "หลังจากโจโฉประกาศพระราชโองการ อ้วนเสี้ยวมาเป็นพันธมิตรกับโจโฉเร็วที่สุด",
  "_{1791_67_1086}_": "หลังจากโจโฉประกาศพระราชโองการ กองซุนจ้านมาเป็นพันธมิตรกับโจโฉเร็วที่สุด",
  "_{1791_67_1087}_": "ซุนเกี๋ยนออกจากลกเอี๋ยงหลังจากได้รับตราราชลัญจกรหยก อ้วนเสี้ยวให้เล่าเปียวขัดขวางซุนเกี๋ยน",
  "_{1791_67_1088}_": "เกี๋ยนออกจากลกเอี๋ยงหลังจากได้รับตราราชลัญจกรหยก อ้วนเสี้ยวให้อ้วนสุดขัดขวางซุนเกี๋ยน",
  "_{1791_67_1089}_": "ซุนฮกเคยเสนออุบาย'สองเสือแย่งอาหาร'และ'ไล่เสือกลืนหมาป่า'ให้โจโฉ",
  "_{1791_67_108}_": "พกพาถุงแพรสีทองสามารถเพิ่มพลังรบ1280000",
  "_{1791_67_1090}_": "กุยแกเคยเสนออุบาย'สองเสือแย่งอาหาร'และ'ไล่เสือกลืนหมาป่า'ให้โจโฉ",
  "_{1791_67_1091}_": "จูกัดเหลียงเตรียม'เรือฟางยืมเกาทัณฑ์' ยืมเรือ20ลำกับโลซก",
  "_{1791_67_1092}_": "จูกัดเหลียงเตรียม'เรือฟางยืมเกาทัณฑ์' ยืมเรือ100ลำกับโลซก",
  "_{1791_67_1093}_": "ในศึกกัวต๋อ เขาฮิวเข้าร่วมกับโจโฉเป็นปัจจัยสำคัญที่โจโฉได้รับชัยชนะ",
  "_{1791_67_1094}_": "ในศึกกัวต๋อ เตียวคับเข้าร่วมกับโจโฉเป็นปัจจัยสำคัญที่โจโฉได้รับชัยชนะ",
  "_{1791_67_1095}_": "สถานที่คำสาบานในสวนท้อในสามก๊กคือเหอเป่ยจัวจวิ้น",
  "_{1791_67_1096}_": "สถานที่คำสาบานในสวนท้อในสามก๊กคือเหอหนานหวยหยาง",
  "_{1791_67_1097}_": "'อาหมาน'เป็นชื่อเล่นของโจโฉ",
  "_{1791_67_1098}_": "'อาหมาน'เป็นชื่อเล่นของโจฉอง",
  "_{1791_67_1099}_": "ขณะที่เล่าปี่เยือนกระท่อมสามครั้ง ขณะที่ถามหาจูกัดเหลียงครั้งที่สอง ได้พบกับจูกัดกิ๋น",
  "_{1791_67_109}_": "เอฟเฟกต์ของถุงแพรหลี่หลิงจวีคืออัตราคริติคอล+8%",
  "_{1791_67_10}_": "ผู้เล่นอันดับ1ในอันดับสนามประลองปัจจุบันคือ#param#",
  "_{1791_67_1100}_": "เตียวหุยฆ่าหมูก่อนสาบานในสวนท้อ",
  "_{1791_67_1101}_": "เตียวหุยเลี้ยงวัวก่อนสาบานในสวนท้อ",
  "_{1791_67_1102}_": "เล่าปี่ขายรองเท้าฟางก่อนสาบานในสวนท้อ",
  "_{1791_67_1103}_": "เล่าปี่เลี้ยงแกะก่อนสาบานในสวนท้อ",
  "_{1791_67_1104}_": "ยุทธการที่สร้างรากฐานสามก๊กคือศึกผาแดง",
  "_{1791_67_1105}_": "ยุทธการที่สร้างรากฐานสามก๊กคือศึกกัวต๋อ",
  "_{1791_67_1106}_": "เมื่อกวนอูพ่ายเกงจิ๋ว กวนสกหลบหนีไปอยู่บ้านเพื่อนเนื่องจากเจ็บป่วย",
  "_{1791_67_1107}_": "เมื่อกวนอูพ่ายเกงจิ๋ว กวนซิงหลบหนีไปอยู่บ้านเพื่อนเนื่องจากเจ็บป่วย",
  "_{1791_67_1108}_": "สุมาอี้ควบคุมอำนาจของวุยก๊กจากการเปลี่ยนแปลงของเจิ้งสื่อ",
  "_{1791_67_1109}_": "สุมาอี้ควบคุมอำนาจของวุยก๊กจากการเปลี่ยนแปลงของหวังหลิง",
  "_{1791_67_110}_": "เอฟเฟกต์ของถุงแพรอุยกายคืออัตราต้านคริติคอล+8%",
  "_{1791_67_1110}_": "ขุนพลห้าพยัคฆ์จ๊กก๊กที่เสียชีวิตเป็นคนแรกคือกวนอู",
  "_{1791_67_1111}_": "ขุนพลห้าพยัคฆ์จ๊กก๊กที่เสียชีวิตเป็นคนแรกคือฮองตง",
  "_{1791_67_1112}_": "ขุนพลห้าพยัคฆ์จ๊กก๊กที่เสียชีวิตเป็นคนสุดท้ายคือจูล่ง",
  "_{1791_67_1113}_": "ขุนพลห้าพยัคฆ์จ๊กก๊กที่เสียชีวิตเป็นคนสุดท้ายคือม้าเฉียว",
  "_{1791_67_1114}_": "ในสามก๊ก ซุนเกี๋ยนค้นพบตราราชลัญจกรหยกในบ่อน้ำ",
  "_{1791_67_1115}_": "ในสามก๊ก ซุนเกี๋ยนค้นพบตราราชลัญจกรหยกในห้องลับ",
  "_{1791_67_1116}_": "สุมาอี้เป็นพี่รองในหมู่พี่น้อง",
  "_{1791_67_1117}_": "สุมาอี้เป็นพี่ใหญ่ในหมู่พี่น้อง",
  "_{1791_67_1118}_": "เล่าปี่เข้าร่วมกับอ้วนเสี้ยวหลังจากพ่ายซีจิ๋ว",
  "_{1791_67_1119}_": "เล่าปี่เข้าร่วมกับโตเกี๋ยมหลังจากพ่ายซีจิ๋ว",
  "_{1791_67_111}_": "เอฟเฟกต์ของถุงแพรเตียวเหยียงคือดาเมจ+5%",
  "_{1791_67_1120}_": "นอกจากจูกัดเหลียงแล้ว จูล่งก็เคยใช้กลยุทธ์ปิดเมือง",
  "_{1791_67_1121}_": "นอกจากจูกัดเหลียงแล้ว เกียงอุยก็เคยใช้กลยุทธ์ปิดเมือง",
  "_{1791_67_1122}_": "หลังจากโจโฉจับเชลยลิโป้ หลังจากได้ฟังคำแนะนำของเล่าปี่แล้วก็ได้ประหารชีวิตลิโป้",
  "_{1791_67_1123}_": "หลังจากโจโฉจับเชลยลิโป้ หลังจากได้ฟังคำแนะนำของกุยแกแล้วก็ได้ประหารชีวิตลิโป้",
  "_{1791_67_1124}_": "ลูกชายคนโตของโจโฉเสียชีวิตเพราะอ้วนเซีย",
  "_{1791_67_1125}_": "ลูกชายคนโตของโจโฉเสียชีวิตเพราะเกงจิ๋ว",
  "_{1791_67_1126}_": "ลูกชายคนโตของโจโฉคือโจงั่ง",
  "_{1791_67_1127}_": "ลูกชายคนโตของโจโฉคือโจผี",
  "_{1791_67_1128}_": "เล่งโฉถูกกำเหลงยิงฆ่า",
  "_{1791_67_1129}_": "เล่งโฉถูกฮองตงยิงฆ่า",
  "_{1791_67_112}_": "เอฟเฟกต์ของถุงแพรซัวบุ้นกี๋คือลดดาเมจ+5%",
  "_{1791_67_1130}_": "'อาหารไร้รส ทิ้งไปก็น่าเสียดาย'มาจากเอียวสิ้ว",
  "_{1791_67_1131}_": "'อาหารไร้รส ทิ้งไปก็น่าเสียดาย'มาจากเทียหยก",
  "_{1791_67_1132}_": "เตียวก๊กเรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลสวรรค์",
  "_{1791_67_1133}_": "เตียวก๊กเรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลแผ่นดิน",
  "_{1791_67_1134}_": "เตียวโป้เรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลแผ่นดิน",
  "_{1791_67_1135}_": "เตียวโป้เรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลมนุษย์",
  "_{1791_67_1136}_": "เตียวเหลียงเรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลมนุษย์",
  "_{1791_67_1137}_": "เตียวเหลียงเรียกตนเองในกบฏโพกผ้าเหลืองว่าขุนพลสวรรค์",
  "_{1791_67_1138}_": "ในสงครามอ้วนเซีย โจโฉลุ่มหลงนางแซ่เจาจึงทำให้เตียวสิ้วก่อกบฎ",
  "_{1791_67_1139}_": "ในสงครามอ้วนเซีย โจโฉลุ่มหลงหวังยี่จึงทำให้เตียวสิ้วก่อกบฎ",
  "_{1791_67_113}_": "เอฟเฟกต์ของถุงแพรอิกิ๋มคือดาเมจคริติคอล+5%",
  "_{1791_67_1140}_": "กวนอูถูกจักรพรรดิฮั่นแต่งตั้งเป็นฮั่นโซ่วถิงโหว",
  "_{1791_67_1141}_": "กวนอูถูกจักรพรรดิฮั่นแต่งตั้งเป็นฮั่นชางถิงโหว",
  "_{1791_67_1142}_": "ในสามก๊ก ลิโป้เคยถูกด่าว่าเป็นไอ้ลูกสามพ่อ",
  "_{1791_67_1143}_": "ผู้ประพันธ์《สามก๊ก》คือตันซิ่ว",
  "_{1791_67_1144}_": "ผู้ประพันธ์《สามก๊ก》คือล่อกวนตง",
  "_{1791_67_1145}_": "ศึกผาแดง บังทองเป็นผู้วางอุบายห่วงโซ่",
  "_{1791_67_1146}_": "ศึกผาแดง จูกัดเหลียงเป็นผู้วางอุบายห่วงโซ่",
  "_{1791_67_1147}_": "ในหนังสือ《สามก๊ก》มีทั้งหมด120ตอน",
  "_{1791_67_1148}_": "ในหนังสือ《สามก๊ก》มีทั้งหมด80ตอน",
  "_{1791_67_1149}_": "ใน《สามก๊ก》ผู้ที่รับพระราชโองการจากเสื้อผ้าคือตังสิน",
  "_{1791_67_114}_": "เอฟเฟกต์ของถุงแพรหลี่หลิงจวีคืออัตราคริติคอล+10%",
  "_{1791_67_1150}_": "ใน《สามก๊ก》ผู้ที่รับพระราชโองการจากเสื้อผ้าคือตังสิด",
  "_{1791_67_1151}_": "ใน《สามก๊ก》เตียวโป้ถูกเล่าปี่ยิงที่แขนซ้าย",
  "_{1791_67_1152}_": "ใน《สามก๊ก》เตียวโป้ถูกเล่าปี่ยิงที่แขนขวา",
  "_{1791_67_1153}_": "ใน《สามก๊ก》เตียวโป้ถูกเล่าปี่ยิงที่ขาซ้าย",
  "_{1791_67_1154}_": "ใน《สามก๊ก》เตียวโป้ถูกเล่าปี่ยิงที่ไหล่ซ้าย",
  "_{1791_67_1155}_": "บิดาของอ้วนเสี้ยวหยวนเฟ็งดำรงตำแหน่งซือถู",
  "_{1791_67_1156}_": "บิดาของอ้วนเสี้ยวหยวนเฟ็งดำรงตำแหน่งซือคง",
  "_{1791_67_1157}_": "ในสงครามกัวต๋อ อิเขงเฝ้าอัวเจ๋า",
  "_{1791_67_1158}_": "ในสงครามกัวต๋อ  เตียวคับเฝ้าอัวเจ๋า",
  "_{1791_67_1159}_": "ขุนพลวุยก๊กจงจิ้นถูกจูล่งแทงตายขณะเจ็ดต่อเจ็ดที่เนินเตียวปันโป๋",
  "_{1791_67_115}_": "เอฟเฟกต์ของถุงแพรอุยกายคืออัตราต้านคริติคอล+10%",
  "_{1791_67_1160}_": "ขุนพลวุยก๊กฉุนอวี๋ถูกจูล่งแทงตายขณะเจ็ดต่อเจ็ดที่เนินเตียวปันโป๋",
  "_{1791_67_1161}_": "เมื่อเล่าปี่อายุ15ปี แม่ของเขาขอให้เขาออกเดินทาง",
  "_{1791_67_1162}_": "เมื่อเล่าปี่อายุ13ปี แม่ของเขาขอให้เขาออกเดินทาง",
  "_{1791_67_1163}_": "เมื่อเล่าปี่อายุ17ปี แม่ของเขาขอให้เขาออกเดินทาง",
  "_{1791_67_1164}_": "ยุคฮั่นหลิงตี้ ผู้ที่มีฉายาว่า'อาฟู่'คือเตียวเหยียง",
  "_{1791_67_1165}_": "ยุคฮั่นหลิงตี้ ผู้ที่มีฉายาว่า'อาฟู่'คือโฮจิ๋น",
  "_{1791_67_1166}_": "กัวต๋อในสงครามกัวต๋ออยู่ในมณฑลหูเป่ยในปัจจุบัน",
  "_{1791_67_1167}_": "กัวต๋อในสงครามกัวต๋ออยู่ในมณฑลหูหนานในปัจจุบัน",
  "_{1791_67_1168}_": "กัวต๋อในสงครามกัวต๋ออยู่ในมณฑลเหอเป่ยในปัจจุบัน",
  "_{1791_67_1169}_": "กัวต๋อในสงครามกัวต๋ออยู่ในมณฑลเหอหนานในปัจจุบัน",
  "_{1791_67_116}_": "เอฟเฟกต์ของถุงแพรเตียวเหยียงคือดาเมจ+8%",
  "_{1791_67_1170}_": "ฉายาของโจจู๋คือนักพรตเขาดำ",
  "_{1791_67_1171}_": "ฉายาของโจจู๋คือเซียนลึกลับ",
  "_{1791_67_1172}_": "สมัญญาของจูกัดเหลียงคือจงอู่โหว",
  "_{1791_67_1173}_": "สมัญญาของจูกัดเหลียงคือซุ่นผิงโหว",
  "_{1791_67_1174}_": "หลังจากจูกัดเหลียงถึงแก่กรรม จ๊กก๊กก็ไม่มีใครรับตำแหน่งเฉิงเซี่ยง",
  "_{1791_67_1175}_": "หลังจากจูกัดเหลียงถึงแก่กรรม จ๊กก๊กก็มีเจียวอ้วนรับตำแหน่งเฉิงเซี่ยง",
  "_{1791_67_1176}_": "จูกัดเหลียงกับจูกัดเก๊กเป็นอาหลานกัน",
  "_{1791_67_1177}_": "จูกัดเหลียงกับจูกัดเก๊กเป็นพี่น้องกัน",
  "_{1791_67_1178}_": "จูกัดเหลียงกับจูกัดเก๊กเป็นพ่อลูกกัน",
  "_{1791_67_1179}_": "พ่อตาของจูกัดเหลียงชื่อว่าฮองเสงหงัน",
  "_{1791_67_117}_": "เอฟเฟกต์ของถุงแพรซัวบุ้นกี๋คือลดดาเมจ+8%",
  "_{1791_67_1180}_": "พ่อตาของจูกัดเหลียงชื่อว่าหวงเสียนเหวิน",
  "_{1791_67_1181}_": "พ่อตาของจูกัดเหลียงชื่อว่าหวงป๋ออี้",
  "_{1791_67_1182}_": "สมัญญาหลังจากจูล่งเสียชีวิตคือซุ่นผิงโหว",
  "_{1791_67_1183}_": "สมัญญาหลังจากจูล่งเสียชีวิตคือซีเซียงโหว",
  "_{1791_67_1184}_": "สมัญญาหลังจากจูล่งเสียชีวิตคือเล่อเฉิงโหว",
  "_{1791_67_1185}_": "เตียวหุยตะโกนหยุดทหารนับล้านบนสะพานเตียงปันเกี้ยว กองทัพโจโฉจึงล่าถอยไปทางทิศตะวันตก",
  "_{1791_67_1186}_": "เตียวหุยตะโกนหยุดทหารนับล้านบนสะพานเตียงปันเกี้ยว กองทัพโจโฉจึงล่าถอยไปทางทิศออก",
  "_{1791_67_1187}_": "เตียวหุยตะโกนหยุดทหารนับล้านบนสะพานเตียงปันเกี้ยว กองทัพโจโฉจึงล่าถอยไปทางทิศใต้",
  "_{1791_67_1188}_": "เตียวหุยตะโกนหยุดทหารนับล้านบนสะพานเตียงปันเกี้ยว กองทัพโจโฉจึงล่าถอยไปทางทิศเหนือ",
  "_{1791_67_1189}_": "ในสามก๊ก ผู้ที่คว้าด่านหวาโข่วอ้ายคือเตียวหุย",
  "_{1791_67_118}_": "เอฟเฟกต์ของถุงแพรอิกิ๋มคือดาเมจคริติคอล+8%",
  "_{1791_67_1190}_": "ในสามก๊ก ผู้ที่คว้าด่านหวาโข่วอ้ายคือฮองตง",
  "_{1791_67_1191}_": "ในสงครามกัวต๋อ ที่ปรึกษาที่เสนออุบายซุ่มโจมตีสิบทิศให้โจโฉคือเทียหยก",
  "_{1791_67_1192}_": "ในสงครามกัวต๋อ ที่ปรึกษาที่เสนออุบายซุ่มโจมตีสิบทิศให้โจโฉคือซุนฮก",
  "_{1791_67_1193}_": "ในสงครามกัวต๋อ ที่ปรึกษาที่เสนออุบายซุ่มโจมตีสิบทิศให้โจโฉคือกุยแก",
  "_{1791_67_1194}_": "ใน《สามก๊ก》การตั้งชื่อของเนินจู้หม่ามีส่วนเกี่ยวข้องกับเล่าปี่ซุนกวน",
  "_{1791_67_1195}_": "ใน《สามก๊ก》การตั้งชื่อของเนินจู้หม่ามีส่วนเกี่ยวข้องกับเล่าปี่โจโฉ",
  "_{1791_67_1196}_": "ใน《สามก๊ก》การตั้งชื่อของเนินจู้หม่ามีส่วนเกี่ยวข้องกับซุนกวนโจโฉ",
  "_{1791_67_1197}_": "ใน《สามก๊ก》 หลังจากจิวยี่เสียชีวิต จูกัดเหลียงและจูล่งได้ไปร่วมงานศพ",
  "_{1791_67_1198}_": "ใน《สามก๊ก》 หลังจากจิวยี่เสียชีวิต จูกัดเหลียงและกวนอูได้ไปร่วมงานศพ",
  "_{1791_67_1199}_": "ใน《สามก๊ก》 หลังจากจิวยี่เสียชีวิต จูกัดเหลียงและเตียวหุยได้ไปร่วมงานศพ",
  "_{1791_67_119}_": "เอฟเฟกต์ของถุงแพรอ้วนสุดคืออัตราคริติคอล+20%",
  "_{1791_67_11}_": "ผู้เล่นอันดับ2ในอันดับสนามประลองปัจจุบันคือ#param#",
  "_{1791_67_1200}_": "หยวนกงลู่หมายถึงอ้วนสุด",
  "_{1791_67_1201}_": "หยวนกงลู่หมายถึงอ้วนเสี้ยว",
  "_{1791_67_1202}_": "จูกัดเอี๋ยนเป็นขุนนางอยู่ในวุยก๊ก",
  "_{1791_67_1203}_": "จูกัดเก๊กเป็นขุนนางอยู่ในวุยก๊ก",
  "_{1791_67_1204}_": "ซุนเต๋งเป็นบุตรชายของซุนกวน",
  "_{1791_67_1205}_": "ซุนเจ้งเป็นบุตรชายของซุนกวน",
  "_{1791_67_1206}_": "ซุนโฮเป็นบุตรชายของซุนกวน",
  "_{1791_67_1207}_": "ขุนพลวุยก๊กแฮหัวเอี๋ยนเสียชีวิตในศึกฮั่นต๋ง",
  "_{1791_67_1208}_": "ขุนพลวุยก๊กเตียวคับเสียชีวิตในศึกฮั่นต๋ง",
  "_{1791_67_1209}_": "ขุนพลวุยก๊กแฮหัวตุ้นเสียชีวิตในศึกฮั่นต๋ง",
  "_{1791_67_120}_": "เอฟเฟกต์ของถุงแพรอุยซีคืออัตราต้านคริติคอล+20%",
  "_{1791_67_1210}_": "โลซกไม่ได้ก่อการกบฏต่อจูกัดเหลียงในสงครามลิ้น",
  "_{1791_67_1211}_": "เตียวเจียวไม่ได้ก่อการกบฏต่อจูกัดเหลียงในสงครามลิ้น",
  "_{1791_67_1212}_": "ก่อนสงครามอี๋หลิง เล่าปี่เคยดูดวงให้กับหลี่อี้",
  "_{1791_67_1213}_": "ก่อนสงครามอี๋หลิง เล่าปี่เคยดูดวงให้กับจูกัดเหลียง",
  "_{1791_67_1214}_": "ฝ่ายที่ทำสงครามกันในสงครามอี๋หลิงคือเล่าปี่และซุนกวน",
  "_{1791_67_1215}_": "ฝ่ายที่ทำสงครามกันในสงครามอี๋หลิงคือโจโฉและซุนกวน",
  "_{1791_67_1216}_": "ฝ่ายที่ทำสงครามกันในสงครามอี๋หลิงคือโจโฉและเล่าปี่",
  "_{1791_67_1217}_": "เงียมแปะฮอส่งน้องชายของเขาไปเจรจากับซุนเซ็ก",
  "_{1791_67_1218}_": "เงียมแปะฮอส่งหลานชายของเขาไปเจรจากับซุนเซ็ก",
  "_{1791_67_1219}_": "เงียมแปะฮอส่งบุตรชายของเขาไปเจรจากับซุนเซ็ก",
  "_{1791_67_121}_": "เอฟเฟกต์ของถุงแพรเตียนอุยคือดาเมจ+12%",
  "_{1791_67_1220}_": "ซุนฮิวเสียชีวิตในระหว่างติดตามโจโฉไปปราบปรามซุนกวน",
  "_{1791_67_1221}_": "ซุนฮิวเสียชีวิตในระหว่างติดตามโจโฉไปปราบปรามเตียวสิ้ว",
  "_{1791_67_1222}_": "ซุนฮิวเสียชีวิตในระหว่างติดตามโจโฉไปปราบปรามลิโป้",
  "_{1791_67_1223}_": "ใน《สามก๊ก》หลังจากกวนสกได้รับบาดเจ็บได้หนีไปรักษาตัวที่หมู่บ้านเป้าเจีย",
  "_{1791_67_1224}_": "ใน《สามก๊ก》หลังจากกวนสกได้รับบาดเจ็บได้หนีไปรักษาตัวที่ฮันต๋ง",
  "_{1791_67_1225}_": "ขณะที่เสี่ยวป้าหวางต่อสู้กับไทสูจู้ ข้างกายมีผู้ติดตามทั้งหมด12คน",
  "_{1791_67_1226}_": "ขณะที่เสี่ยวป้าหวางต่อสู้กับไทสูจู้ ข้างกายมีผู้ติดตามทั้งหมด11คน",
  "_{1791_67_1227}_": "ขณะที่เสี่ยวป้าหวางต่อสู้กับไทสูจู้ ข้างกายมีผู้ติดตามทั้งหมด13คน",
  "_{1791_67_1228}_": "ม้าเต๊กเลาแรกเริ่มเป็นพาหนะของเตียวบู",
  "_{1791_67_1229}_": "ม้าเต๊กเลาแรกเริ่มเป็นพาหนะของตันสูน",
  "_{1791_67_122}_": "เอฟเฟกต์ของถุงแพรตั๋งโต๊ะคือลดดาเมจ+12%",
  "_{1791_67_1230}_": "ตาข้างซ้ายของแฮหัวตุ้นถูกธนูยิงในขณะต่อสู้",
  "_{1791_67_1231}_": "ตาข้างขวาของแฮหัวตุ้นถูกธนูยิงในขณะต่อสู้",
  "_{1791_67_1232}_": "เทียเภาเคยรับใช้ซุนเกี๋ยน ซุนเซ็ก ซุนกวน 3รุ่น",
  "_{1791_67_1233}_": "ฮันต๋งเคยรับใช้ซุนเกี๋ยน ซุนเซ็ก ซุนกวน 3รุ่น",
  "_{1791_67_1234}_": "อุยกายเคยรับใช้ซุนเกี๋ยน ซุนเซ็ก ซุนกวน 3รุ่น",
  "_{1791_67_1235}_": "องค์หญิงที่เอียนสีให้กำเนิดคือองค์หญิงตงเซียง",
  "_{1791_67_1236}_": "องค์หญิงที่เอียนสีให้กำเนิดคือองค์หญิงซีเซียง",
  "_{1791_67_1237}_": "เตียวหุยและกันหยงเป็นชาวจวอจวิ้นเหมือนกัน",
  "_{1791_67_1238}_": "เตียวหุยและกวนอูเป็นชาวจวอจวิ้นเหมือนกัน",
  "_{1791_67_1239}_": "เล่าปี่และเตียวหุยเป็นชาวจวอจวิ้นเหมือนกัน",
  "_{1791_67_123}_": "เอฟเฟกต์ของถุงแพรซุนซ่างเซียงคือดาเมจคริติคอล+12%",
  "_{1791_67_1240}_": "ขงสิ้วถูกกวนอูฆ่าในขณะ'ฝ่าห้าด่านสังหารหกขุนพล'",
  "_{1791_67_1241}_": "อองเซ็กถูกกวนอูฆ่าในขณะ'ฝ่าห้าด่านสังหารหกขุนพล'",
  "_{1791_67_1242}_": "จินกี๋ถูกกวนอูฆ่าในขณะ'ฝ่าห้าด่านสังหารหกขุนพล'",
  "_{1791_67_1243}_": "ซุนเชาเป็นอัครเสนาบดีคนแรกของง่อก๊ก",
  "_{1791_67_1244}_": "เตียวเจียวเป็นอัครเสนาบดีคนแรกของง่อก๊ก",
  "_{1791_67_1245}_": "จิวยี่เป็นอัครเสนาบดีคนแรกของง่อก๊ก",
  "_{1791_67_1246}_": "ที่ปรึกษาที่ได้ฉายาว่า'สองเตียว'ร่วมกับเตียวเจียวคือเตียวเหียน",
  "_{1791_67_1247}_": "ที่ปรึกษาที่ได้ฉายาว่า'สองเตียว'ร่วมกับเตียวเจียวคือเตียวหง",
  "_{1791_67_1248}_": "ที่ปรึกษาที่ได้ฉายาว่า'สองเตียว'ร่วมกับเตียวเจียวคือจางหง",
  "_{1791_67_1249}_": "บุนเพ่งเป็นลูกน้องของซุนเกี๋ยนก่อนยอมจำนนต่อโจโฉ",
  "_{1791_67_124}_": "เอฟเฟกต์ของถุงแพรเล่าปี่คือปล่อยสกิลรักษาเพิ่มขึ้น",
  "_{1791_67_1250}_": "บุนเพ่งเป็นลูกน้องของอ้วนเสี้ยวก่อนยอมจำนนต่อโจโฉ",
  "_{1791_67_1251}_": "บุนเพ่งเป็นลูกน้องของลิโป้ก่อนยอมจำนนต่อโจโฉ",
  "_{1791_67_1252}_": "ขุนพลวุยจินกี๋เป็นหลานชายของซัวหยง",
  "_{1791_67_1253}_": "ขุนพลวุยจินกี๋เป็นหลานชายของแฮหัวตุ้น",
  "_{1791_67_1254}_": "ขุนพลวุยจินกี๋เป็นหลานชายของแฮหัวเอี๋ยน",
  "_{1791_67_1255}_": "สงครามอ้วนเซีย เตียวสิ้วก่อกบฎอย่างฉับพลัน ภายใต้คำแนะนำของกาเซี่ยง",
  "_{1791_67_1256}_": "สงครามอ้วนเซีย เตียวสิ้วก่อกบฎอย่างฉับพลัน ภายใต้คำแนะนำของเฮาเฉีย",
  "_{1791_67_1257}_": "สงครามอ้วนเซีย เตียวสิ้วก่อกบฎอย่างฉับพลัน ภายใต้คำแนะนำของเขาฮิว",
  "_{1791_67_1258}_": "มารดาผู้ให้กำเนิดของซุนซิวคือหวังฮูหยิน",
  "_{1791_67_1259}_": "มารดาผู้ให้กำเนิดของซุนซิวคือพันฮูหยิน",
  "_{1791_67_125}_": "เอฟเฟกต์ของถุงแพรลกซุนคืออัตราเผาไหม้เพิ่มขึ้น",
  "_{1791_67_1260}_": "มารดาผู้ให้กำเนิดของซุนซิวคือเซี่ยฮูหยิน",
  "_{1791_67_1261}_": "มารดาผู้ให้กำเนิดของซุนซิวคือสวีฮูหยิน",
  "_{1791_67_1262}_": "ซุนกวนมีบุตรชายทั้งหมด7คน",
  "_{1791_67_1263}_": "ซุนกวนมีบุตรชายทั้งหมด8คน",
  "_{1791_67_1264}_": "ซุนกวนมีบุตรชายทั้งหมด9คน",
  "_{1791_67_1265}_": "ซุนกวนยกลูกสาวของตนเองซุนหลู่ปันให้แต่งงานกับจวนจ๋อง",
  "_{1791_67_1266}_": "ซุนกวนยกลูกสาวของตนเองซุนหลู่ปันให้แต่งงานกับลกซุน",
  "_{1791_67_1267}_": "ซุนเกี๋ยนมักจะสวมผ้าโพกหัวสีแดงอยู่เสมอ",
  "_{1791_67_1268}_": "ซุนเกี๋ยนมักจะสวมผ้าโพกหัวสีเหลืองอยู่เสมอ",
  "_{1791_67_1269}_": "ซุนเกี๋ยนมักจะสวมผ้าโพกหัวสีฟ้าอยู่เสมอ",
  "_{1791_67_126}_": "เอฟเฟกต์ของถุงแพรกองซุนจ้านคือโจมตีเป้าหมายเดี่ยวลดโทสะ1แต้ม",
  "_{1791_67_1270}_": "ในระหว่างล่าสัตว์ ซุนเซ็กถูกที่ปรึกษาของเค้าก๋องสังหาร",
  "_{1791_67_1271}_": "ในระหว่างล่าสัตว์ ซุนเซ็กถูกที่ปรึกษาของหลิวเหยาสังหาร",
  "_{1791_67_1272}_": "ในระหว่างล่าสัตว์ ซุนเซ็กถูกที่ปรึกษาของเงียมแปะฮอสังหาร",
  "_{1791_67_1273}_": "ซุนเซ็กถูกกุยแกทำนายว่าจะตายเพราะนักฆ่า",
  "_{1791_67_1274}_": "ซุนเซ็กถูกสุมาอี้ทำนายว่าจะตายเพราะนักฆ่า",
  "_{1791_67_1275}_": "ซุนเซ็กถูกจูกัดเหลียงทำนายว่าจะตายเพราะนักฆ่า",
  "_{1791_67_1276}_": "ความคิดสุมาเจียว คนเดินถนนยังรู้เลยเป็นคำพูดของโจมอ",
  "_{1791_67_1277}_": "ความคิดสุมาเจียว คนเดินถนนยังรู้เลยเป็นคำพูดของโจฮวน",
  "_{1791_67_1278}_": "หลังจากสุมาอี้เสียชีวิตได้ฝังอยู่ที่ภูเขาโส่วหยาง",
  "_{1791_67_1279}_": "หลังจากสุมาอี้เสียชีวิตได้ฝังอยู่ที่ภูเขาหวังวู",
  "_{1791_67_127}_": "เอฟเฟกต์ของถุงแพรกวนอูคือเริ่มต้นเพิ่มโทสะ1แต้ม",
  "_{1791_67_1280}_": "หลังจากสุมาอี้เสียชีวิตได้ฝังอยู่ที่ภูเขาอวิ๋นเมิ่ง",
  "_{1791_67_1281}_": "หลังจากสุมาอี้เสียชีวิตได้ฝังอยู่ที่ภูเขาอวิ๋นไถ",
  "_{1791_67_1282}_": "สุมาเอี๋ยนเป็นบุตรชายของสุมาเจียว",
  "_{1791_67_1283}_": "สุมาเอี๋ยนเป็นบุตรชายของสุมาสู",
  "_{1791_67_1284}_": "ผู้ที่อาวุโสที่สุดในสุมาปาต๋าคือสุมาหลัง",
  "_{1791_67_1285}_": "ผู้ที่อาวุโสที่สุดในสุมาปาต๋าคือสุมาอี้",
  "_{1791_67_1286}_": "ผู้ที่อาวุโสที่สุดในสุมาปาต๋าคือสุมาหู",
  "_{1791_67_1287}_": "ผู้ที่อาวุโสที่สุดในสุมาปาต๋าคือสุมาจิ่น",
  "_{1791_67_1288}_": "เตียวสงแนะนำเล่าเจี้ยงให้เชิญเล่าปี่ไปเอ็กจิ๋วต่อต้านเตียวฬ่อ",
  "_{1791_67_1289}_": "เตียวหยิมแนะนำเล่าเจี้ยงให้เชิญเล่าปี่ไปเอ็กจิ๋วต่อต้านเตียวฬ่อ",
  "_{1791_67_128}_": "เอฟเฟกต์ของถุงแพรม้าเฉียวคือเพิ่มเอฟเฟกต์ลดดาเมจโล่",
  "_{1791_67_1290}_": "หวดเจ้งแนะนำเล่าเจี้ยงให้เชิญเล่าปี่ไปเอ็กจิ๋วต่อต้านเตียวฬ่อ",
  "_{1791_67_1291}_": "ผู้ที่'ขึ้นบ้านชักบันได'ขอชีวิตกับจูกัดเหลียงคือเล่ากี๋",
  "_{1791_67_1292}_": "ผู้ที่'ขึ้นบ้านชักบันได'ขอชีวิตกับจูกัดเหลียงคือเล่าจ๋อง",
  "_{1791_67_1293}_": "ผู้ที่'ขึ้นบ้านชักบันได'ขอชีวิตกับจูกัดเหลียงคือหลิวซิว",
  "_{1791_67_1294}_": "เตียวหุยเป็นผู้เสนอคำสาบานในสวนท้อ",
  "_{1791_67_1295}_": "เล่าปี่เป็นผู้เสนอคำสาบานในสวนท้อ",
  "_{1791_67_1296}_": "กวนอูเป็นผู้เสนอคำสาบานในสวนท้อ",
  "_{1791_67_1297}_": "ลิอิ๋นพูดกล่อมม้าเฉียวแทนเล่าปี่",
  "_{1791_67_1298}_": "หวดเจ้งพูดกล่อมม้าเฉียวแทนเล่าปี่",
  "_{1791_67_1299}_": "เจียวอ้วนพูดกล่อมม้าเฉียวแทนเล่าปี่",
  "_{1791_67_129}_": "เอฟเฟกต์ของถุงแพรกาเซี่ยงคืออัตราถูกพิษเพิ่มขึ้น",
  "_{1791_67_12}_": "ผู้เล่นอันดับ3ในอันดับสนามประลองปัจจุบันคือ#param#",
  "_{1791_67_1300}_": "ลิซกพูดกล่อมลิโป้แทนตั๋งโต๊ะ",
  "_{1791_67_1301}_": "กาเซี่ยงพูดกล่อมลิโป้แทนตั๋งโต๊ะ",
  "_{1791_67_1302}_": "ขณะที่เตียวคับไล่โจมตีจูกัดเหลียงถึงหุบเขามู่เหมิน ได้ถูกธนูยิงตาย",
  "_{1791_67_1303}_": "ขณะที่เตียวคับไล่โจมตีจูกัดเหลียงถึงหุบเขาจื๋ออู่ ได้ถูกธนูยิงตาย",
  "_{1791_67_1304}_": "เตียวคับถูกธนูยิงตายที่เข่าขวา",
  "_{1791_67_1305}_": "เตียวคับถูกธนูยิงตายที่เข่าซ้าย",
  "_{1791_67_1306}_": "ในสามก๊ก เตียวหอมยกน้องสะใภ้ฝานซื่อที่เป็นหม้ายมาหลายปีให้แต่งงานกับจูล่ง",
  "_{1791_67_1307}_": "ในสามก๊ก เป้าหลงยกน้องสะใภ้ฝานซื่อที่เป็นหม้ายมาหลายปีให้แต่งงานกับจูล่ง",
  "_{1791_67_1308}_": "ในสามก๊ก ฮันโฮยกน้องสะใภ้ฝานซื่อที่เป็นหม้ายมาหลายปีให้แต่งงานกับจูล่ง",
  "_{1791_67_1309}_": "ในสามก๊ก เล่าปี่เคยเข้าร่วมกับซุนเกี๋ยน",
  "_{1791_67_130}_": "เอฟเฟกต์ของถุงแพรชีซีคืออัตรามึนงงเพิ่มขึ้น",
  "_{1791_67_1310}_": "ในสามก๊ก เล่าปี่เคยเข้าร่วมกับอ้วนเสี้ยว",
  "_{1791_67_1311}_": "ในสามก๊ก เล่าปี่เคยเข้าร่วมกับโจโฉ",
  "_{1791_67_1312}_": "ในสามก๊ก เล่าปี่เคยเข้าร่วมกับกองซุนจ้าน",
  "_{1791_67_1313}_": "ในสามก๊ก บังทองกระตุ้นเล่าปี่ ให้เขาตัดสินใจแย่งชิงเอ็กจิ๋ว",
  "_{1791_67_1314}_": "ในสามก๊ก จูกัดเหลียงกระตุ้นเล่าปี่ ให้เขาตัดสินใจแย่งชิงเอ็กจิ๋ว",
  "_{1791_67_1315}_": "ในสามก๊ก หวดเจ้งกระตุ้นเล่าปี่ ให้เขาตัดสินใจแย่งชิงเอ็กจิ๋ว",
  "_{1791_67_1316}_": "ในสามก๊ก ชีซีกระตุ้นเล่าปี่ ให้เขาตัดสินใจแย่งชิงเอ็กจิ๋ว",
  "_{1791_67_1317}_": "ในสามก๊ก ค่ายกลพยุหะแปดทวารกุญแจทองของโจหยินถูกชีซีทำลาย",
  "_{1791_67_1318}_": "ในสามก๊ก ค่ายกลพยุหะแปดทวารกุญแจทองของโจหยินถูกจูกัดเหลียงทำลาย",
  "_{1791_67_1319}_": "หลังจากซุนซิวจักรพรรดิง่อก๊กในยุคสามก๊กถึงแก่กรรม ซุนเหลียงเป็นผู้รับช่วงต่อ",
  "_{1791_67_131}_": "เอฟเฟกต์ของถุงแพรอิเกียดคือดาเมจถูกพิษเพิ่มขึ้น",
  "_{1791_67_1320}_": "หลังจากซุนซิวจักรพรรดิง่อก๊กในยุคสามก๊กถึงแก่กรรม ซุนโฮเป็นผู้รับช่วงต่อ",
  "_{1791_67_1321}_": "หลังจากซุนซิวจักรพรรดิง่อก๊กในยุคสามก๊กถึงแก่กรรม ซุนโหเป็นผู้รับช่วงต่อ",
  "_{1791_67_1322}_": "ยุคสามก๊ก ซุนซิวเป็นบุตรคนที่6ของซุนกวน",
  "_{1791_67_1323}_": "ยุคสามก๊ก ซุนซิวเป็นบุตรคนที่5ของซุนกวน",
  "_{1791_67_1324}_": "ยุคสามก๊ก ซุนซิวเป็นบุตรคนที่7ของซุนกวน",
  "_{1791_67_1325}_": "กลยุทธ์ปิดเมืองของจูกัดเหลียงในสามก๊กเกิดขึ้นที่ซีเฉิง",
  "_{1791_67_1326}_": "กลยุทธ์ปิดเมืองของจูกัดเหลียงในสามก๊กเกิดขึ้นที่เกเต๋ง",
  "_{1791_67_1327}_": "กลยุทธ์ปิดเมืองของจูกัดเหลียงในสามก๊กเกิดขึ้นที่อานหลิง",
  "_{1791_67_1328}_": "หลังจากเบ้งเฮ็กถูกจูกัดเหลียงจับกุมครั้งที่4ได้หลบหนีเข้าไปในถ้ำทูหลง",
  "_{1791_67_1329}_": "หลังจากเบ้งเฮ็กถูกจูกัดเหลียงจับกุมครั้งที่3ได้หลบหนีเข้าไปในถ้ำทูหลง",
  "_{1791_67_132}_": "เอฟเฟกต์ของถุงแพรเสี่ยวเกี้ยวคืออัตราเหน็บชาเพิ่มขึ้น",
  "_{1791_67_1330}_": "หลังจากเบ้งเฮ็กถูกจูกัดเหลียงจับกุมครั้งที่5ได้หลบหนีเข้าไปในถ้ำทูหลง",
  "_{1791_67_1331}_": "ลิโป้เสี่ยงทายเกาทัณฑ์ช่วยเล่าปี่สลายวงล้อม",
  "_{1791_67_1332}_": "ลิโป้เสี่ยงทายเกาทัณฑ์ช่วยอ้วนเสี้ยวสลายวงล้อม",
  "_{1791_67_1333}_": "การตายของน้องชายกองซุนจ้านเกี่ยวข้องกับอ้วนเสี้ยว",
  "_{1791_67_1334}_": "การตายของน้องชายกองซุนจ้านเกี่ยวข้องกับตั๋งโต๊ะ",
  "_{1791_67_1335}_": "การตายของน้องชายกองซุนจ้านเกี่ยวข้องกับโตเกี๋ยม",
  "_{1791_67_1336}_": "โจซองถูกปลดอำนาจในอุบัติการณ์สุสานโกเบงเหลง",
  "_{1791_67_1337}_": "โจฮีถูกปลดอำนาจในอุบัติการณ์สุสานโกเบงเหลง",
  "_{1791_67_1338}_": "โจซุ่นถูกปลดอำนาจในอุบัติการณ์สุสานโกเบงเหลง",
  "_{1791_67_1339}_": "โจผีถูกปลดอำนาจในอุบัติการณ์สุสานโกเบงเหลง",
  "_{1791_67_133}_": "เอฟเฟกต์ของถุงแพรกุยแกคืออัตราเงียบขรึมเพิ่มขึ้น",
  "_{1791_67_1340}_": "ในระหว่างที่โจโฉหลบหนีหลังจากพ่ายแพ้ผาแดง ได้พบการสกัดกั้นของจูล่ง",
  "_{1791_67_1341}_": "ในระหว่างที่โจโฉหลบหนีหลังจากพ่ายแพ้ผาแดง ได้พบการสกัดกั้นของกวนอู",
  "_{1791_67_1342}_": "ในระหว่างที่โจโฉหลบหนีหลังจากพ่ายแพ้ผาแดง ได้พบการสกัดกั้นของเตียวหุย",
  "_{1791_67_1343}_": "ชีซีเคยปลอมชื่อเป็น'ตันฮก'เพื่อทำหน้าที่กุนซือให้กับเล่าปี่",
  "_{1791_67_1344}_": "บังทองเคยปลอมชื่อเป็น'ตันฮก'เพื่อทำหน้าที่กุนซือให้กับเล่าปี่",
  "_{1791_67_1345}_": "สุมาเต๊กโชเคยปลอมชื่อเป็น'ตันฮก'เพื่อทำหน้าที่กุนซือให้กับเล่าปี่",
  "_{1791_67_1346}_": "ในศึกผาแดง โจโฉหลงกลอุบายของจิวยี่จนเข้าใจผิดและฆ่าชัวมอ",
  "_{1791_67_1347}_": "ในศึกผาแดง โจโฉหลงกลอุบายของจิวยี่จนเข้าใจผิดและฆ่าเตียวอุ๋น",
  "_{1791_67_1348}_": "ในศึกผาแดง โจโฉหลงกลอุบายของจิวยี่จนเข้าใจผิดและฆ่าชัวโฮ",
  "_{1791_67_1349}_": "ในศึกผาแดง โจโฉหลงกลอุบายของจิวยี่จนเข้าใจผิดและฆ่าชัวต๋ง",
  "_{1791_67_134}_": "เอฟเฟกต์ของถุงแพรแฮหัวตุ้นคืออัตราสะท้อนดาเมจเพิ่ม30%",
  "_{1791_67_1350}_": "ในประวัติศาสตร์ ฮัวหยงถูกกองทัพซุนเกี๋ยนสังหาร",
  "_{1791_67_1351}_": "ในประวัติศาสตร์ ฮัวหยงถูกกวนอูสังหาร",
  "_{1791_67_1352}_": "ใน《สามก๊ก》 ฮัวหยงถูกกวนอูสังหาร",
  "_{1791_67_1353}_": "ใน《สามก๊ก》 ฮัวหยงถูกซุนเกี๋ยนสังหาร",
  "_{1791_67_1354}_": "'ข้าไม่เคยเห็นใครที่ไร้ยางอายเช่นนี้ อยู่ไปก็เสียแรงเปล่า'อองลองเป็นคนพูด",
  "_{1791_67_1355}_": "'ข้าไม่เคยเห็นใครที่ไร้ยางอายเช่นนี้ อยู่ไปก็เสียแรงเปล่า'ฮองตงเป็นคนพูด",
  "_{1791_67_1356}_": "ขณะจูกัดเหลียงด่าอองลอง ผู้บัญชาการวุยก๊กที่อยู่ข้างกายอองลองคือโจจิ๋น",
  "_{1791_67_1357}_": "ขณะจูกัดเหลียงด่าอองลอง ผู้บัญชาการวุยก๊กที่อยู่ข้างกายอองลองคือโจซอง",
  "_{1791_67_1358}_": "ขณะจูกัดเหลียงด่าอองลอง ผู้บัญชาการวุยก๊กที่อยู่ข้างกายอองลองคือโจหยิน",
  "_{1791_67_1359}_": "ขณะจูกัดเหลียงด่าอองลอง ผู้บัญชาการวุยก๊กที่อยู่ข้างกายอองลองคือโจโฉ",
  "_{1791_67_135}_": "เอฟเฟกต์ของถุงแพรเคาทูคือฆ่าเป้าหมายฟื้นฟูโทสะของตนเอง1แต้ม",
  "_{1791_67_1360}_": "'ชนะสิบครั้งแพ้สิบครั้ง'ในสามก๊กเป็นทฤษฎีมาจากกุยแก",
  "_{1791_67_1361}_": "'ชนะสิบครั้งแพ้สิบครั้ง'ในสามก๊กเป็นทฤษฎีมาจากสุมาอี้",
  "_{1791_67_1362}_": "'ชนะสิบครั้งแพ้สิบครั้ง'ในสามก๊กเป็นทฤษฎีมาจากจูกัดเหลียง",
  "_{1791_67_1363}_": "'ชนะสิบครั้งแพ้สิบครั้ง'ในสามก๊กเป็นทฤษฎีมาจากจิวยี่",
  "_{1791_67_1364}_": "ในโจฉองชั่งช้าง ช้างตัวนี้ซุนกวนเป็นผู้มอบให้",
  "_{1791_67_1365}_": "ในโจฉองชั่งช้าง ช้างตัวนี้เล่าปี่เป็นผู้มอบให้",
  "_{1791_67_1366}_": "ในโจฉองชั่งช้าง ช้างตัวนี้เบ้งเฮ็กเป็นผู้มอบให้",
  "_{1791_67_1367}_": "ม้าเฉียวกับมาเชียวเป็นพี่น้องร่วมสายโลหิตกัน",
  "_{1791_67_1368}_": "ม้าเฉียวกับมาไทเป็นพี่น้องร่วมสายโลหิตกัน",
  "_{1791_67_1369}_": "ม้าเฉียวกับม้าต้ายเป็นพี่น้องร่วมสายโลหิตกัน",
  "_{1791_67_136}_": "เอฟเฟกต์ของถุงแพรเอียนสีคือดาเมจสกิลแปลงเป็นอัตรารักษาเพิ่มขึ้น",
  "_{1791_67_1370}_": "หลังจากบังทองเสียชีวิต เล่าปี่ได้ส่งกวนเป๋งไปเกงจิ๋วเพื่อเชิญจูกัดเหลียงเข้าร่วม",
  "_{1791_67_1371}_": "หลังจากบังทองเสียชีวิต เล่าปี่ได้ส่งกวนสกไปเกงจิ๋วเพื่อเชิญจูกัดเหลียงเข้าร่วม",
  "_{1791_67_1372}_": "หลังจากบังทองเสียชีวิต เล่าปี่ได้ส่งกวนซิงไปเกงจิ๋วเพื่อเชิญจูกัดเหลียงเข้าร่วม",
  "_{1791_67_1373}_": "ดวงตาของขุนพลแฮหัวตุ้นถูกโจเส็งยิงบอด",
  "_{1791_67_1374}_": "ดวงตาของขุนพลแฮหัวตุ้นถูกโกซุ่นยิงบอด",
  "_{1791_67_1375}_": "ดวงตาของขุนพลแฮหัวตุ้นถูกม้าต๋งยิงบอด",
  "_{1791_67_1376}_": "ใน《สามก๊ก》 กำเหลงถูกขุนพลจ๊กก๊กสะโมโขยิงถูกหน้าผากตาย",
  "_{1791_67_1377}_": "ใน《สามก๊ก》 กำเหลงถูกขุนพลจ๊กก๊กฮองตงยิงถูกหน้าผากตาย",
  "_{1791_67_1378}_": "ใน《สามก๊ก》 กำเหลงถูกขุนพลจ๊กก๊กเบ้งตัดยิงถูกหน้าผากตาย",
  "_{1791_67_1379}_": "ม้าเฉียวและเตียวหุยต่อสู้กันในด่านแฮบังก๋วน ไม่รู้ผลแพ้ชนะ",
  "_{1791_67_137}_": "เอฟเฟกต์ของถุงแพรฮัวโต๋คือดาเมจถูกพิษฟื้นฟูเลือดของตนเอง",
  "_{1791_67_1380}_": "ม้าเฉียวและเคาทูต่อสู้กันในด่านแฮบังก๋วน ไม่รู้ผลแพ้ชนะ",
  "_{1791_67_1381}_": "กำฮูหยินเป็นผู้ให้กำเนิดเล่าเสี้ยน",
  "_{1791_67_1382}_": "บิฮูหยินเป็นผู้ให้กำเนิดเล่าเสี้ยน",
  "_{1791_67_1383}_": "ซุนฮูหยินเป็นผู้ให้กำเนิดเล่าเสี้ยน",
  "_{1791_67_1384}_": "ขณะที่เล่าปี่ปิดล้อมเฉิงตู ได้ส่งกันหยงไปพูดกล่อมเล่าเจี้ยง",
  "_{1791_67_1385}_": "ขณะที่เล่าปี่ปิดล้อมเฉิงตู ได้ส่งหวดเจ้งไปพูดกล่อมเล่าเจี้ยง",
  "_{1791_67_1386}_": "ขณะที่เล่าปี่ปิดล้อมเฉิงตู ได้ส่งซุนเขียนไปพูดกล่อมเล่าเจี้ยง",
  "_{1791_67_1387}_": "นี้เป็นคำถามแจกคะแนน เพียงแค่เลือกให้ถูกต้องก็พอแล้ว",
  "_{1791_67_1388}_": "นี้เป็นคำถามแจกคะแนน เพียงแค่เลือกให้ผิดก็พอแล้ว",
  "_{1791_67_1389}_": "ในขณะที่เล่าปี่ดื่มสุรากับโจโฉ เล่าปี่ไม่เคยพูดถึงซุนเกี๋ยน",
  "_{1791_67_138}_": "เอฟเฟกต์ของถุงแพรไต้เกี้ยวคือเอฟเฟกต์รักษาเพิ่มขึ้นและเพิ่มโล่ลดดาเมจ",
  "_{1791_67_1390}_": "ในขณะที่เล่าปี่ดื่มสุรากับโจโฉ เล่าปี่ไม่เคยพูดถึงซุนเซ็ก",
  "_{1791_67_1391}_": "ในขณะที่เล่าปี่ดื่มสุรากับโจโฉ เล่าปี่ไม่เคยพูดถึงอ้วนเสี้ยว",
  "_{1791_67_1392}_": "ในขณะที่เล่าปี่ดื่มสุรากับโจโฉ เล่าปี่ไม่เคยพูดถึงลิโป้",
  "_{1791_67_1393}_": "ขงหยงเป็นหลานรุ่นที่20ของขงจื๊อ",
  "_{1791_67_1394}_": "ขงหยงเป็นหลานรุ่นที่19ของขงจื๊อ",
  "_{1791_67_1395}_": "ขงหยงเป็นหลานรุ่นที่18ของขงจื๊อ",
  "_{1791_67_1396}_": "สันนิษฐานว่า โจผีชื่นชอบผูเถา",
  "_{1791_67_1397}_": "กุยแกเสียชีวิตในการต่อสู้เหนือปราบอูหวน",
  "_{1791_67_1398}_": "กุยแกเสียชีวิตในการต่อสู้สงครามกัวต๋อ",
  "_{1791_67_1399}_": "กุยแกเสียชีวิตในการต่อสู้ใต้ปราบเตียวสิ้ว",
  "_{1791_67_139}_": "เอฟเฟกต์ของถุงแพรเตียวเสี้ยนคือลดอัตราถูกควบคุมของตนเอง",
  "_{1791_67_13}_": "ผู้เล่นอันดับ1ในอันดับจำนวนดาวดันเจี้ยนสายหลักปัจจุบันคือ#param#",
  "_{1791_67_1400}_": "สงครามกัวต๋อ เขาฮิวติดต่อโจโฉเผาไหม้อัวเจ๋า",
  "_{1791_67_1401}_": "สงครามกัวต๋อ ซุนฮิวติดต่อโจโฉเผาไหม้อัวเจ๋า",
  "_{1791_67_1402}_": "สงครามกัวต๋อ เตียวคับติดต่อโจโฉเผาไหม้อัวเจ๋า",
  "_{1791_67_1403}_": "ในสงครามกัวต๋อ โจโฉสั่งให้ซุนฮกอยู่เฝ้าฮูโต๋",
  "_{1791_67_1404}_": "ในสงครามกัวต๋อ โจโฉสั่งให้เทียหยกอยู่เฝ้าฮูโต๋",
  "_{1791_67_1405}_": "ขณะกวนอูฝ่าห้าด่านสังหารหกขุนพล เมื่อสังหารซัวหยงแล้วจึงอธิบายความสงสัยที่เตียวหุยมีต่อเขา",
  "_{1791_67_1406}_": "ขณะกวนอูฝ่าห้าด่านสังหารหกขุนพล เมื่อสังหารชัวโฮแล้วจึงอธิบายความสงสัยที่เตียวหุยมีต่อเขา",
  "_{1791_67_1407}_": "ขณะกวนอูฝ่าห้าด่านสังหารหกขุนพล เมื่อสังหารขงสิ้วแล้วจึงอธิบายความสงสัยที่เตียวหุยมีต่อเขา",
  "_{1791_67_1408}_": "ขณะกวนอูฝ่าห้าด่านสังหารหกขุนพล เมื่อสังหารเปี๋ยนฮีแล้วจึงอธิบายความสงสัยที่เตียวหุยมีต่อเขา",
  "_{1791_67_1409}_": "ใน《สามก๊ก》 ม้าเซ็กเธาว์ของลิโป้ ตั๋งโต๊ะเป็นผู้มอบให้",
  "_{1791_67_140}_": "เอฟเฟกต์ของถุงแพรอ้วนสุดคืออัตราคริติคอล+30%",
  "_{1791_67_1410}_": "ใน《สามก๊ก》 ม้าเซ็กเธาว์ของลิโป้ เต๊งหงวนเป็นผู้มอบให้",
  "_{1791_67_1411}_": "ใน《สามก๊ก》 ม้าเซ็กเธาว์ของลิโป้ ตนเองเป็นผู้ค้นพบ",
  "_{1791_67_1412}_": "หลังจากกวนอูพ่ายแพ้เป๊กเสีย ม้าเซ็กเธาว์ก็ถูกม้าต๋งเอาไป",
  "_{1791_67_1413}_": "หลังจากกวนอูพ่ายแพ้เป๊กเสีย ม้าเซ็กเธาว์ก็ถูกพัวเจี้ยงเอาไป",
  "_{1791_67_1414}_": "ตำนานตัดผมแทนหัวมาจากโจโฉ",
  "_{1791_67_1415}_": "ตำนานตัดผมแทนหัวมาจากเล่าปี่",
  "_{1791_67_1416}_": "ตำนานตัดผมแทนหัวมาจากซุนกวน",
  "_{1791_67_1417}_": "'ร่ำเพลงแกล้มสุรา ชีวายาวฤาสั้น'มาจาก《ต่วนเกอสิง》ของโจโฉ",
  "_{1791_67_1418}_": "'ร่ำเพลงแกล้มสุรา ชีวายาวฤาสั้น'มาจาก《กุยซุยโซ่ว》ของโจโฉ",
  "_{1791_67_1419}_": "'ร่ำเพลงแกล้มสุรา ชีวายาวฤาสั้น'มาจาก《กวนชางไห่》ของโจโฉ",
  "_{1791_67_141}_": "เอฟเฟกต์ของถุงแพรอุยซีคืออัตราต้านคริติคอล+30%",
  "_{1791_67_1420}_": "'ร่ำเพลงแกล้มสุรา ชีวายาวฤาสั้น'มาจาก《ปิงเชอสิง》ของโจโฉ",
  "_{1791_67_1421}_": "ลิซกใช้ม้าเซ็กเธาว์เป็นของขวัญ อาศัยลิ้นสามนิ้วโน้มน้าวลิโป้ให้ยอมจำนนตั๋งโต๊ะ",
  "_{1791_67_1422}_": "กาเซี่ยงใช้ม้าเซ็กเธาว์เป็นของขวัญ อาศัยลิ้นสามนิ้วโน้มน้าวลิโป้ให้ยอมจำนนตั๋งโต๊ะ",
  "_{1791_67_1423}_": "ลิยูใช้ม้าเซ็กเธาว์เป็นของขวัญ อาศัยลิ้นสามนิ้วโน้มน้าวลิโป้ให้ยอมจำนนตั๋งโต๊ะ",
  "_{1791_67_1424}_": "สงครามตงซิ่งเป็นการต่อสู้ระหว่างวุยก๊กและจ๊กก๊ก",
  "_{1791_67_1425}_": "สงครามตงซิ่งเป็นการต่อสู้ระหว่างวุยก๊กและง่อก๊ก",
  "_{1791_67_1426}_": "สงครามตงซิ่งเป็นการต่อสู้ระหว่างจ๊กก๊กและง่อก๊ก",
  "_{1791_67_1427}_": "อาจารย์ของเล่าปี่ กองซุนจ้าน ในขณะเรียนหนังสือคือโลติด",
  "_{1791_67_1428}_": "อาจารย์ของเล่าปี่ กองซุนจ้าน ในขณะเรียนหนังสือคือเกียวเหี้ยน",
  "_{1791_67_1429}_": "อาจารย์ของเล่าปี่ กองซุนจ้าน ในขณะเรียนหนังสือคือเกียวก๊กโล",
  "_{1791_67_142}_": "เอฟเฟกต์ของถุงแพรเตียนอุยคือดาเมจ+15%",
  "_{1791_67_1430}_": "เตียนอุยก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของเตียวเมา",
  "_{1791_67_1431}_": "เตียนอุยก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของฮันฮก",
  "_{1791_67_1432}_": "เตียนอุยก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของโตเกี๋ยม",
  "_{1791_67_1433}_": "ซิหลงก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของเอียวฮอง",
  "_{1791_67_1434}_": "ซิหลงก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของเตียวเมา",
  "_{1791_67_1435}_": "ซิหลงก่อนเข้าร่วมกับโจโฉ เป็นผู้ใต้บังคับบัญชาของฮันฮก",
  "_{1791_67_1436}_": "ใน《สามก๊ก》 ขุนพลวุยก๊กซิหลงถูกเบ้งตัดยิงหน้าผาก เสียชีวิต",
  "_{1791_67_1437}_": "ใน《สามก๊ก》 ขุนพลวุยก๊กซิหลงถูกฮองตงยิงหน้าผาก เสียชีวิต",
  "_{1791_67_1438}_": "ใน《สามก๊ก》 ขุนพลวุยก๊กซิหลงถูกไทสูจู้ยิงหน้าผาก เสียชีวิต",
  "_{1791_67_1439}_": "ในศึกผาแดง เทียหยกดูออกว่าอุยกายหลอกลวง",
  "_{1791_67_143}_": "เอฟเฟกต์ของถุงแพรตั๋งโต๊ะคือลดดาเมจ+15%",
  "_{1791_67_1440}_": "ในศึกผาแดง กุยแกดูออกว่าอุยกายหลอกลวง",
  "_{1791_67_1441}_": "ในศึกผาแดง กาเซี่ยงดูออกว่าอุยกายหลอกลวง",
  "_{1791_67_1442}_": "หลังจากศึกผาแดง โจโฉถอยกลับฮูโต๋ และส่งโจหยินอยู่เฝ้าเกงจิ๋ว",
  "_{1791_67_1443}_": "หลังจากศึกผาแดง โจโฉถอยกลับฮูโต๋ และส่งโจหองอยู่เฝ้าเกงจิ๋ว",
  "_{1791_67_1444}_": "หลังจากศึกผาแดง โจโฉถอยกลับฮูโต๋ และส่งแฮหัวตุ้นอยู่เฝ้าเกงจิ๋ว",
  "_{1791_67_1445}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่1นำไปสู่การสกัดกั้นของจูล่ง",
  "_{1791_67_1446}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่1นำไปสู่การสกัดกั้นของลิบอง",
  "_{1791_67_1447}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่2นำไปสู่การสกัดกั้นของเตียวหุย",
  "_{1791_67_1448}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่2นำไปสู่การสกัดกั้นของกวนอู",
  "_{1791_67_1449}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่3นำไปสู่การสกัดกั้นของกวนอู",
  "_{1791_67_144}_": "เอฟเฟกต์ของถุงแพรซุนซ่างเซียงคือดาเมจคริติคอล+15%",
  "_{1791_67_1450}_": "หลังจากโจโฉพ่ายแพ้ผาแดง เคย'สามยิ้ม' ยิ้มที่3นำไปสู่การสกัดกั้นของจูล่ง",
  "_{1791_67_1451}_": "หลังจากไฟผาแดงลุกโชน เตียวเลี้ยวยิงอุยกาย ขับเรือช่วยเหลือโจโฉ",
  "_{1791_67_1452}_": "หลังจากไฟผาแดงลุกโชน โจหยินยิงอุยกาย ขับเรือช่วยเหลือโจโฉ",
  "_{1791_67_1453}_": "หลังจากไฟผาแดงลุกโชน แฮหัวตุ้นยิงอุยกาย ขับเรือช่วยเหลือโจโฉ",
  "_{1791_67_1454}_": "หลังจากไฟผาแดงลุกโชน เตียวคับยิงอุยกาย ขับเรือช่วยเหลือโจโฉ",
  "_{1791_67_1455}_": "ก่อนศึกผาแดง โจโฉร้องเพลงร่ำสุรา เล่าฮกเนื่องจากพูดไม่เป็นมงคลต่อโจโฉจึงถูกโจโฉแทงจนตาย",
  "_{1791_67_1456}_": "ก่อนสงครามผาแดง โจโฉร้องเพลงร่ำสุรา หลิวเสียเนื่องจากพูดไม่เป็นมงคลต่อโจโฉจึงถูกโจโฉแทงจนตาย",
  "_{1791_67_1457}_": "ก่อนสงครามผาแดง โจโฉร้องเพลงร่ำสุรา หลิวซีเนื่องจากพูดไม่เป็นมงคลต่อโจโฉจึงถูกโจโฉแทงจนตาย",
  "_{1791_67_1458}_": "โจซุนเคยเป็นผู้บัญชาการกองทัพทหารเสือดาวของโจโฉ",
  "_{1791_67_1459}_": "ขณะโจผีตั้งตัวเป็นกษัตริย์ ได้เปลี่ยนชื่อรัชกาลเป็นหวงชู",
  "_{1791_67_145}_": "เอฟเฟกต์ของถุงแพรเล่าปี่คือปล่อยโจมตีทั่วไปรักษาเพิ่มขึ้น",
  "_{1791_67_1460}_": "ขณะโจผีตั้งตัวเป็นกษัตริย์ ได้เปลี่ยนชื่อรัชกาลเป็นไท่เหอ",
  "_{1791_67_1461}_": "ขณะโจผีตั้งตัวเป็นกษัตริย์ ได้เปลี่ยนชื่อรัชกาลเป็นจิ่งชู",
  "_{1791_67_1462}_": "ขณะโจผีตั้งตัวเป็นกษัตริย์ ได้เปลี่ยนชื่อรัชกาลเป็นเจียผิง",
  "_{1791_67_1463}_": "ขณะโจโฉปราบปรามเลียงจิ๋ว กาเซี่ยงก็วางแผนให้ม้าเฉียวและหันซุยแตกคอกัน",
  "_{1791_67_1464}_": "ขณะโจโฉปราบปรามเลียงจิ๋ว ซุนฮกก็วางแผนให้ม้าเฉียวและหันซุยแตกคอกัน",
  "_{1791_67_1465}_": "ขณะโจโฉปราบปรามเลียงจิ๋ว เทียหยกก็วางแผนให้ม้าเฉียวและหันซุยแตกคอกัน",
  "_{1791_67_1466}_": "เนื่องจากโจโก๋ถูกสังหาร โจโฉจึงโกรธและพาลโตเกี๋ยม จึงได้ส่งทหารไปโจมตีซีจิ๋ว",
  "_{1791_67_1467}_": "เนื่องจากโจงั่งถูกสังหาร โจโฉจึงโกรธและพาลโตเกี๋ยม จึงได้ส่งทหารไปโจมตีซีจิ๋ว",
  "_{1791_67_1468}_": "บุตรชายของโจโฉเคาจุนแต่งงานกับบุตรสาวของเตียวสิ้ว",
  "_{1791_67_1469}_": "บุตรชายของโจโฉโจงั่งแต่งงานกับบุตรสาวของเตียวสิ้ว",
  "_{1791_67_146}_": "เอฟเฟกต์ของถุงแพรลกซุนคือดาเมจเผาไหม้เพิ่มขึ้น",
  "_{1791_67_1470}_": "บุตรชายของโจโฉโจฮิวแต่งงานกับบุตรสาวของเตียวสิ้ว",
  "_{1791_67_1471}_": "หลังจากโจโฉพิชิตเตียวฬ่อ ก็ได้กักตัวเขา",
  "_{1791_67_1472}_": "หลังจากโจโฉพิชิตเตียวฬ่อ ก็ได้ตัวหัวของเขา",
  "_{1791_67_1473}_": "หลังจากโจโฉพิชิตเตียวฬ่อ ก็ได้เนรเทศเขา",
  "_{1791_67_1474}_": "หลังจากโจโฉพิชิตเตียวฬ่อ ก็ได้คุมขังเขา",
  "_{1791_67_1475}_": "ขณะโจโฉจัดงานเลี้ยงปราสาทนกยูงทองเเดง ซิหลงและเคาทูแย่งชิงเสื้อผ้าแพรจนเกิดการต่อสู้กัน",
  "_{1791_67_1476}_": "ขณะโจโฉจัดงานเลี้ยงปราสาทนกยูงทองเเดง โจฮิวและบุนเพ่งแย่งชิงเสื้อผ้าแพรจนเกิดการต่อสู้กัน",
  "_{1791_67_1477}_": "ขณะโจโฉจัดงานเลี้ยงปราสาทนกยูงทองเเดง โจหองและเตียวคับแย่งชิงเสื้อผ้าแพรจนเกิดการต่อสู้กัน",
  "_{1791_67_1478}_": "ขณะโจโฉจัดงานเลี้ยงปราสาทนกยูงทองเเดง แฮหัวเอี๋ยนและซิหลงแย่งชิงเสื้อผ้าแพรจนเกิดการต่อสู้กัน",
  "_{1791_67_1479}_": "หลังจากโจโฉสังหารตั๋งโต๊ะไม่สำเร็จก็ได้หลบหนีไปที่มณฑลจงมู่และถูกจับ",
  "_{1791_67_147}_": "เอฟเฟกต์ของถุงแพรกองซุนจ้านคือโจมตีเป้าหมายแถวหน้าลดโทสะ1แต้ม",
  "_{1791_67_1480}_": "หลังจากโจโฉสังหารตั๋งโต๊ะไม่สำเร็จก็ได้หลบหนีไปที่ลกเอี๋ยงและถูกจับ",
  "_{1791_67_1481}_": "หลังจากโจโฉสังหารตั๋งโต๊ะไม่สำเร็จก็ได้หลบหนีไปที่ถนนมู่เหมินและถูกจับ",
  "_{1791_67_1482}_": "โจโฉ'ตัดหนวดหนีตาย'เกิดขึ้นในสงครามถงกวน",
  "_{1791_67_1483}_": "โจโฉ'ตัดหนวดหนีตาย'เกิดขึ้นในสงครามกัวต๋อ",
  "_{1791_67_1484}_": "โจโฉ'ตัดหนวดหนีตาย'เกิดขึ้นในศึกผาแดง",
  "_{1791_67_1485}_": "ขณะที่โจโฉและเล่าปี่อุ่นสุราวิจารณ์วีรบุรุษ ผู้ที่ถูกโจโฉเรียกว่ากระดูกในสุสานคืออ้วนสุด",
  "_{1791_67_1486}_": "ขณะที่โจโฉและเล่าปี่อุ่นสุราวิจารณ์วีรบุรุษ ผู้ที่ถูกโจโฉเรียกว่ากระดูกในสุสานคืออ้วนเสี้ยว",
  "_{1791_67_1487}_": "ขณะที่โจโฉและเล่าปี่อุ่นสุราวิจารณ์วีรบุรุษ ผู้ที่ถูกโจโฉเรียกว่ากระดูกในสุสานคือกองซุนจ้าน",
  "_{1791_67_1488}_": "ขณะที่โจโฉและเล่าปี่อุ่นสุราวิจารณ์วีรบุรุษ ผู้ที่ถูกโจโฉเรียกว่ากระดูกในสุสานคือซุนเซ็ก",
  "_{1791_67_1489}_": "ใน《สามก๊ก》 อ้วนสุดอยากผูกมิตรกับลิโป้ ผลสุดท้ายลิโป้เชื่อคำพูดของตันกุ๋ยจึงยกเลิกสัญญา",
  "_{1791_67_148}_": "เอฟเฟกต์ของถุงแพรกวนอูคือแต่ละรอบฟื้นฟูโทสะ1แต้ม",
  "_{1791_67_1490}_": "ใน《สามก๊ก》 อ้วนสุดอยากผูกมิตรกับลิโป้ ผลสุดท้ายลิโป้เชื่อคำพูดของตันเต๋งจึงยกเลิกสัญญา",
  "_{1791_67_1491}_": "ใน《สามก๊ก》 อ้วนสุดอยากผูกมิตรกับลิโป้ ผลสุดท้ายลิโป้เชื่อคำพูดของตันก๋งจึงยกเลิกสัญญา",
  "_{1791_67_1492}_": "ใน《สามก๊ก》 แห้ฝือถูกปิดล้อม เฮาเสงขโมยม้าเซ็กเธาว์ของลิโป้ไปให้โจโฉ",
  "_{1791_67_1493}_": "ใน《สามก๊ก》 แห้ฝือถูกปิดล้อม ซงเหียนขโมยม้าเซ็กเธาว์ของลิโป้ไปให้โจโฉ",
  "_{1791_67_1494}_": "ใน《สามก๊ก》 แห้ฝือถูกปิดล้อม งุยซกขโมยม้าเซ็กเธาว์ของลิโป้ไปให้โจโฉ",
  "_{1791_67_1495}_": "ใน《สามก๊ก》 ขณะที่กวนอูเข้าร่วมกับโจโฉ ได้รับข่าวคราวของเล่าปี่จากปากของซุนเขียน",
  "_{1791_67_1496}_": "ใน《สามก๊ก》 ขณะที่กวนอูเข้าร่วมกับโจโฉ ได้รับข่าวคราวของเล่าปี่จากปากของเล่าเพ็ก",
  "_{1791_67_1497}_": "ใน《สามก๊ก》 ขณะที่กวนอูเข้าร่วมกับโจโฉ ได้รับข่าวคราวของเล่าปี่จากปากของกันหยง",
  "_{1791_67_1498}_": "ใน《สามก๊ก》 ขณะที่เล่าปี่เข้าพบจูกัดเหลียงครั้งแรก เข้าใจผิดคิดว่าชุยโจวผิงเป็นจูกัดเหลียง",
  "_{1791_67_1499}_": "ใน《สามก๊ก》 ขณะที่เล่าปี่เข้าพบจูกัดเหลียงครั้งแรก เข้าใจผิดคิดว่าสือกว่างหยวนเป็นจูกัดเหลียง",
  "_{1791_67_149}_": "เอฟเฟกต์ของถุงแพรม้าเฉียวคือรอบการส่งผลต่อเนื่องของโล่เพิ่มขึ้น",
  "_{1791_67_14}_": "ผู้เล่นอันดับ2ในอันดับจำนวนดาวดันเจี้ยนสายหลักปัจจุบันคือ#param#",
  "_{1791_67_1500}_": "ใน《สามก๊ก》 ขณะที่เล่าปี่เข้าพบจูกัดเหลียงครั้งแรก เข้าใจผิดคิดว่าเมิ่งกงเวยเป็นจูกัดเหลียง",
  "_{1791_67_1501}_": "ใน《สามก๊ก》 ขณะที่เล่าปี่เข้าพบจูกัดเหลียงครั้งแรก เข้าใจผิดคิดว่าสวีหยวนจื๋อเป็นจูกัดเหลียง",
  "_{1791_67_1502}_": "'จูล่งผู้มีแต่ความกล้าหาญ'เป็นการประเมินค่าของเล่าปี่ต่อจูล่งในศึกฮั่นต๋ง",
  "_{1791_67_1503}_": "'จูล่งผู้มีแต่ความกล้าหาญ'เป็นการประเมินค่าของเล่าปี่ต่อจูล่งในสมรภูมิรบเนินเตียวปันโป๋",
  "_{1791_67_1504}_": "'จูล่งผู้มีแต่ความกล้าหาญ'เป็นการประเมินค่าของเล่าปี่ต่อจูล่งในศึกผาแดง",
  "_{1791_67_1505}_": "'จูล่งผู้มีแต่ความกล้าหาญ'เป็นการประเมินค่าของเล่าปี่ต่อจูล่งในสงครามอี๋หลิง",
  "_{1791_67_1506}_": "'พัดขนนกโพกแพรพรรณ ขณะแย้มสรวลสนทนา กระโดงกรรเชียงนาวาไหม้เป็นจุณ'พรรณนาถึงจิวยี่",
  "_{1791_67_1507}_": "'พัดขนนกโพกแพรพรรณ ขณะแย้มสรวลสนทนา กระโดงกรรเชียงนาวาไหม้เป็นจุณ'พรรณนาถึงจูกัดเหลียง",
  "_{1791_67_1508}_": "ขณะบังทองคิดอุบายห่วงโซ่เคยถูกชีซีผู้ใต้บังคับบัญชาของโจโฉมองออก",
  "_{1791_67_1509}_": "ขณะบังทองคิดอุบายห่วงโซ่เคยถูกเขาฮิวผู้ใต้บังคับบัญชาของโจโฉมองออก",
  "_{1791_67_150}_": "เอฟเฟกต์ของถุงแพรกาเซี่ยงคือดาเมจถูกพิษเพิ่มขึ้น",
  "_{1791_67_1510}_": "ขณะบังทองคิดอุบายห่วงโซ่เคยถูกกุยแกผู้ใต้บังคับบัญชาของโจโฉมองออก",
  "_{1791_67_1511}_": "ยุคสามก๊ก เล่าปี่ไม่เคยได้รับตราราชลัญจกรหยกฮั่น",
  "_{1791_67_1512}_": "ยุคสามก๊ก อ้วนสุดไม่เคยได้รับตราราชลัญจกรหยกฮั่น",
  "_{1791_67_151}_": "เอฟเฟกต์ของถุงแพรชีซีคือรอบการส่งผลต่อเนื่องของมึนงงเพิ่มขึ้น",
  "_{1791_67_152}_": "เอฟเฟกต์ของถุงแพรอิเกียดคืออัตราถูกพิษเพิ่มขึ้น",
  "_{1791_67_153}_": "เอฟเฟกต์ของถุงแพรเสี่ยวเกี้ยวคือรอบการส่งผลต่อเนื่องของเหน็บชาเพิ่มขึ้น",
  "_{1791_67_154}_": "เอฟเฟกต์ของถุงแพรกุยแกคือรอบการส่งผลต่อเนื่องของเงียบขรึมเพิ่มขึ้น",
  "_{1791_67_155}_": "เอฟเฟกต์ของถุงแพรแฮหัวตุ้นคืออัตราสะท้อนดาเมจเพิ่ม50%",
  "_{1791_67_156}_": "เอฟเฟกต์ของถุงแพรเคาทูคือโจมตีทั่วไปฟื้นฟูโทสะของตนเอง1แต้ม",
  "_{1791_67_157}_": "เอฟเฟกต์ของถุงแพรเอียนสีคือดาเมจสกิลสามารถแปลงเป็นรักษาตนเอง",
  "_{1791_67_158}_": "เอฟเฟกต์ของถุงแพรฮัวโต๋คือปล่อยสกิลรักษาเพิ่มขึ้น",
  "_{1791_67_159}_": "เอฟเฟกต์ของถุงแพรไต้เกี้ยวคือเอฟเฟกต์รักษาเพิ่มขึ้นและเพิ่มเอฟเฟกต์ฟื้นฟูต่อเนื่อง",
  "_{1791_67_15}_": "ผู้เล่นอันดับ3ในอันดับจำนวนดาวดันเจี้ยนสายหลักปัจจุบันคือ#param#",
  "_{1791_67_160}_": "เอฟเฟกต์ของถุงแพรเตียวเสี้ยนคือลดอัตราถูกลดโกรธของตนเอง",
  "_{1791_67_161}_": "เอฟเฟกต์ของถุงแพรจูล่งคือโจมตีทั่วไปเกิดคริติคอลแน่นอน",
  "_{1791_67_162}_": "เอฟเฟกต์ของถุงแพรจิวยี่คือรอบการส่งผลต่อเนื่องของเผาไหม้เพิ่มขึ้น",
  "_{1791_67_163}_": "เอฟเฟกต์ของถุงแพรโจจู๋คือถูกพิษเพิ่มเอฟเฟกต์ผนึกรักษา",
  "_{1791_67_164}_": "เอฟเฟกต์ของถุงแพรโจโฉคือกำจัดเอฟเฟกต์ไร้ศัตรูของขุนพลศัตรู",
  "_{1791_67_165}_": "เอฟเฟกต์ของถุงแพรเทพ·โจหยินคือโจมตีเป้าหมายแถวแนวตั้งลดโทสะ1แต้ม",
  "_{1791_67_166}_": "เอฟเฟกต์ของถุงแพรเทพ·ลกซุนคือประทับไร้ศัตรูขุนพลถูกเผาไหม้",
  "_{1791_67_167}_": "เอฟเฟกต์ของถุงแพรเทพ·อุยซีคือรอบแรกป้องกันการภูมิคุ้มกัน",
  "_{1791_67_168}_": "เอฟเฟกต์ของถุงแพรเทพ·ฮัวโต๋คือดาเมจสกิลแปลงเป็นการรักษา",
  "_{1791_67_169}_": "เอฟเฟกต์ของถุงแพรสุมาอี้คือใช้โทสะทั้งหมดเพิ่มดาเมจสกิล",
  "_{1791_67_16}_": "ผู้เล่นอันดับ1ในอันดับจำนวนดาวดันเจี้ยนมือเอกปัจจุบันคือ#param#",
  "_{1791_67_170}_": "เอฟเฟกต์ของถุงแพรเทพ·กาเซี่ยงคือรอบการส่งผลต่อเนื่องของถูกพิษเพิ่มขึ้น",
  "_{1791_67_171}_": "เอฟเฟกต์ของถุงแพรเทพ·ซุนฮกคือปล่อยสกิลรักษาเพิ่มขึ้น",
  "_{1791_67_172}_": "เอฟเฟกต์ของถุงแพรร่วมสาบานสวนท้อคือแบ่งกันถูกดาเมจ",
  "_{1791_67_173}_": "เอฟเฟกต์ของถุงแพรเทพ·ไทสูจู้คืออัตราเผาไหม้เพิ่มขึ้นจำนวนมาก",
  "_{1791_67_174}_": "เอฟเฟกต์ของถุงแพรชิงชิงจื่อจินคือสิ้นสุดรอบฟื้นฟูพันเกี่ยวใจข้าโทสะ1แต้ม",
  "_{1791_67_175}_": "เอฟเฟกต์ของถุงแพรพันเกี่ยวใจข้าคือสิ้นสุดรอบฟื้นฟูชิงชิงจื่อจินโทสะ1แต้ม",
  "_{1791_67_176}_": "เอฟเฟกต์ของถุงแพรบุกเดี่ยวพันลี้คือโจมตีขุนพลที่มีเลือดน้อยที่สุดในปัจจุบันของฝ่ายศัตรู",
  "_{1791_67_177}_": "เอฟเฟกต์ของถุงแพรหนึ่งม้าลุยเดี่ยวคือฆ่าเป้าหมายเพิ่มสกิล1ครั้ง",
  "_{1791_67_178}_": "เอฟเฟกต์ของถุงแพรเจ็ดสังหารคือสร้างดาเมจถูกแบ่งสัดส่วนลดลง",
  "_{1791_67_179}_": "เอฟเฟกต์ของถุงแพรหมาป่าโลภคือฆ่าเป้าหมายได้รับโทสะ",
  "_{1791_67_17}_": "ผู้เล่นอันดับ2ในอันดับจำนวนดาวดันเจี้ยนมือเอกปัจจุบันคือ#param#",
  "_{1791_67_180}_": "เอฟเฟกต์ของถุงแพรตำนาน·กวนอูคือความโกรธเบื้องต้นเพิ่มขึ้น2แต้ม",
  "_{1791_67_181}_": "เอฟเฟกต์ของถุงแพรทุบหม้อจมเรือคือแต่ละรอบถูกดาเมจอย่างจำกัด",
  "_{1791_67_182}_": "เอฟเฟกต์ของถุงแพรลงเรือลำเดียวกันคือดูดซับดาเมจของขุนพลเพื่อนค่ายเดียวกัน",
  "_{1791_67_183}_": "เอฟเฟกต์ของถุงแพรจูล่งคือสกิลโจมตีเกิดคริติคอลแน่นอน",
  "_{1791_67_184}_": "เอฟเฟกต์ของถุงแพรจิวยี่คืออัตราเผาไหม้เพิ่มขึ้นจำนวนมาก",
  "_{1791_67_185}_": "เอฟเฟกต์ของถุงแพรโจจู๋คือถูกพิษเพิ่มเอฟเฟกต์ลดโกรธ",
  "_{1791_67_186}_": "เอฟเฟกต์ของถุงแพรโจโฉคือโจมตีมองข้ามเอฟเฟกต์ไร้ศัตรูของขุนพลศัตรู",
  "_{1791_67_187}_": "เอฟเฟกต์ของถุงแพรเทพ·โจหยินคือโจมตีเป้าหมายแถวหลังลดโทสะ1แต้ม",
  "_{1791_67_188}_": "เอฟเฟกต์ของถุงแพรเทพ·ลกซุนคือผนึกรักษาขุนพลที่ถูกเผาไหม้",
  "_{1791_67_189}_": "เอฟเฟกต์ของถุงแพรเทพ·อุยซีคือภูมิคุ้มกันควบคุมถาวร",
  "_{1791_67_18}_": "ผู้เล่นอันดับ3ในอันดับจำนวนดาวดันเจี้ยนมือเอกปัจจุบันคือ#param#",
  "_{1791_67_190}_": "เอฟเฟกต์ของถุงแพรเทพ·ฮัวโต๋คือดาเมจทั้งหมดแปลงเป็นรักษา",
  "_{1791_67_191}_": "เอฟเฟกต์ของถุงแพรสุมาอี้คือแต่ละรอบฟื้นฟูโทสะ2แต้ม",
  "_{1791_67_192}_": "เอฟเฟกต์ของถุงแพรเทพ·กาเซี่ยงคือดาเมจถูกพิษเพิ่มขึ้น",
  "_{1791_67_193}_": "เอฟเฟกต์ของถุงแพรเทพ·ซุนฮกคือปล่องสกิลเพิ่มโล่ป้องกันดาเมจ",
  "_{1791_67_194}_": "เอฟเฟกต์ของถุงแพรร่วมสาบานสวนท้อคือแบ่งปันดาเมจทั้งหมด",
  "_{1791_67_195}_": "เอฟเฟกต์ของถุงแพรเทพ·ไทสูจู้คือรอบการส่งผลต่อเนื่องของเผาไหม้เพิ่มขึ้น",
  "_{1791_67_196}_": "เอฟเฟกต์ของถุงแพรชิงชิงจื่อจินคือหลังจากโจมตีฟื้นฟูพันเกี่ยวใจข้าโทสะ1แต้ม",
  "_{1791_67_197}_": "เอฟเฟกต์ของถุงแพรพันเกี่ยวใจข้าคือหลังจากโจมตีฟื้นฟูชิงชิงจื่อจินโทสะ1แต้ม",
  "_{1791_67_198}_": "เอฟเฟกต์ของถุงแพรบุกเดี่ยวพันลี้คือโจมตีขุนพลที่มีเลือดทั้งหมดน้อยที่สุดของฝ่ายศัตรู",
  "_{1791_67_199}_": "เอฟเฟกต์ของถุงแพรหนึ่งม้าลุยเดี่ยวคือฆ่าเป้าหมายเพิ่มโจมตีทั่วไป1ครั้ง",
  "_{1791_67_19}_": "ผู้เล่นอันดับ1ในอันดับจำนวนดาวฝ่าด่านสังหารขุนพลปัจจุบันคือ#param#",
  "_{1791_67_1}_": "ผู้เล่นอันดับ1ในอันดับเลเวลปัจจุบันคือ#param#",
  "_{1791_67_200}_": "เอฟเฟกต์ของถุงแพรเจ็ดสังหารคือมองข้ามเอฟเฟกต์ดาเมจถูกแบ่งปัน",
  "_{1791_67_201}_": "เอฟเฟกต์ของถุงแพรหมาป่าโลภคือฆ่าเป้าหมายฟื้นฟูโทสะ2แต้ม",
  "_{1791_67_202}_": "เอฟเฟกต์ของถุงแพรตำนาน·กวนอูคือแต่ละรอบฟื้นฟูโทสะ2แต้ม",
  "_{1791_67_203}_": "เอฟเฟกต์ของถุงแพรทุบหม้อจมเรือคือได้รับเอฟเฟกต์ป้องกันตายต่อเนื่อง1รอบ1ครั้ง",
  "_{1791_67_204}_": "เอฟเฟกต์ของถุงแพรลงเรือลำเดียวกันคือดูดซับดาเมจของขุนพลเพื่อน",
  "_{1791_67_205}_": "สุมาอี้และซุนฮกออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_206}_": "โจโฉและกุยแกออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_207}_": "แฮหัวตุ้นและโจหยินออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_208}_": "เตียนอุยและเคาทูออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_209}_": "เตียวเลี้ยวและเตียวคับออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_20}_": "ผู้เล่นอันดับ2ในอันดับจำนวนดาวฝ่าด่านสังหารขุนพลปัจจุบันคือ#param#",
  "_{1791_67_210}_": "โจผีและเอียนสีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_211}_": "สุมาอี้และกุยแกออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_212}_": "โจโฉและซุนฮกออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_213}_": "แฮหัวตุ้นและเคาทูออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_214}_": "เตียนอุยและโจหยินออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_215}_": "เตียวเลี้ยวและเอียนสีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_216}_": "โจผีและเตียวคับออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_217}_": "จูล่งและเล่าปี่ออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_218}_": "จูกัดเหลียงและอุยซีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_219}_": "กวนอูและเตียวหุยออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_21}_": "ผู้เล่นอันดับ3ในอันดับจำนวนดาวฝ่าด่านสังหารขุนพลปัจจุบันคือ#param#",
  "_{1791_67_220}_": "ม้าเฉียวและฮองตงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_221}_": "เกียงอุยและอุยเอี๋ยนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_222}_": "บังทองและชีซีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_223}_": "จูล่งและเกียงอุยออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_224}_": "จูกัดเหลียง และบังทองออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_225}_": "กวนอูและฮองตงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_226}_": "ม้าเฉียวและเกียงอุยออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_227}_": "เกียงอุยและชีซีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_228}_": "บังทองและอุยซีออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_229}_": "ซุนเซ็กและไต้เกี้ยวออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_22}_": "ผู้เล่นอันดับ1ในอันดับจำนวนเปิดใช้สมุดขุนพลปัจจุบันคือ#param#",
  "_{1791_67_230}_": "จิวยี่และเสี่ยวเกี้ยวออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_231}_": "ไทสูจู้และซุนกวนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_232}_": "ลิบองและกำเหลงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_233}_": "ซุนเกี๋ยนและซุนซ่างเซียงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_234}_": "ลกซุนและโลซกออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_235}_": "ซุนเซ็กและกำเหลงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_236}_": "ไต้เกี้ยวและเสี่ยวเกี้ยวออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_237}_": "โลซกและซุนกวนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_238}_": "ลิบองและจิวยี่ออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_239}_": "ซุนเกี๋ยนและซุนกวนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_23}_": "ผู้เล่นอันดับ2ในอันดับจำนวนเปิดใช้สมุดขุนพลปัจจุบันคือ#param#",
  "_{1791_67_240}_": "ลกซุนและไทสูจู้ออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_241}_": "โจจู๋และฮัวโต๋ออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_242}_": "ลิโป้และเตียวเสี้ยนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_243}_": "ตั๋งโต๊ะและฮัวหยงออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_244}_": "กาเซี่ยงและกองซุนจ้านออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_245}_": "เตียวก๊กและอิเกียดออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_246}_": "อ้วนเสี้ยวและอ้วนสุดออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_247}_": "โจจู๋และอิเกียดออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_248}_": "ลิโป้และตั๋งโต๊ะออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_249}_": "ตั๋งโต๊ะและเตียวเสี้ยนออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_24}_": "ผู้เล่นอันดับ3ในอันดับจำนวนเปิดใช้สมุดขุนพลปัจจุบันคือ#param#",
  "_{1791_67_250}_": "กาเซี่ยงและเตียวก๊กออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_251}_": "เตียวก๊กและอ้วนสุดออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_252}_": "อ้วนเสี้ยวและกองซุนจ้านออกรบพร้อมกันสามารถเปิดใช้ประสานโจมตีได้",
  "_{1791_67_253}_": "สกิลของสุมาอี้คือสร้างดาเมจใส่ฝ่ายศัตรูทุกคน",
  "_{1791_67_254}_": "สกิลของสุมาอี้คือสร้างดาเมจใส่แถวหน้าฝ่ายศัตรู",
  "_{1791_67_255}_": "สกิลของโจโฉคือสร้างดาเมจใส่แถวหน้าฝ่ายศัตรู",
  "_{1791_67_256}_": "สกิลของโจโฉคือสร้างดาเมจใส่ฝ่ายศัตรูทุกคน",
  "_{1791_67_257}_": "สกิลของซุนฮกคือรักษาฝ่ายตนเอง3คน",
  "_{1791_67_258}_": "สกิลของซุนฮกคือรักษาฝ่ายตนเองทุกคน",
  "_{1791_67_259}_": "สกิลของกุยแกคือสร้างดาเมจใส่แถวหน้าฝ่ายศัตรู",
  "_{1791_67_25}_": "กองทัพยึดครองลกเอี๋ยงในศึกแร่ปัจจุบันคือ#param#",
  "_{1791_67_260}_": "สกิลของกุยแกคือสร้างดาเมจใส่แถวหลังฝ่ายศัตรู",
  "_{1791_67_261}_": "พรสวรรค์สะท้อนดาเมจของแฮหัวตุ้นต้องการทะลวง+5จึงจะสามารถเปิดใช้ได้",
  "_{1791_67_262}_": "พรสวรรค์สะท้อนดาเมจที่เกิดมาพร้อมกับแฮหัวตุ้น",
  "_{1791_67_263}_": "สกิลของโจหยินคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_264}_": "สกิลของโจหยินคือโจมตีศัตรูเดี่ยว",
  "_{1791_67_265}_": "สกิลของเตียนอุยคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_266}_": "สกิลของเตียนอุยคือโจมตีแถวหลังฝ่ายศัตรู",
  "_{1791_67_267}_": "สกิลของเคาทูมาพร้อมกับสเตตัสพิเศษไล่โจมตี",
  "_{1791_67_268}_": "เคาทูเป็นขุนพลคนเดียวของวุยก๊กที่มีสเตตัสพิเศษไล่โจมตี",
  "_{1791_67_269}_": "โจมตีทั่วไปของเตียวเลี้ยวคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_26}_": "กองทัพยึดครองฮูโต๋ในศึกแร่ปัจจุบันคือ#param#",
  "_{1791_67_270}_": "สกิลของเตียวเลี้ยวคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_271}_": "โล่ไร้ศัตรูของเตียวคับไม่สามารถปล่อยใส่ตนเองได้",
  "_{1791_67_272}_": "โล่ไร้ศัตรูของเตียวคับสามารถปล่อยใส่ตนเองได้",
  "_{1791_67_273}_": "สกิลของโจผีโจมตีถูกศัตรู4คนสามารถฟื้นฟูโทสะได้",
  "_{1791_67_274}_": "สกิลของโจผีโจมตีถูกศัตรู2คนสามารถฟื้นฟูโทสะได้",
  "_{1791_67_275}_": "เอียนสีปล่อยสกิลสามารถรักษาเพื่อนร่วมทีมได้",
  "_{1791_67_276}_": "เอียนสีปล่อยโจมตีทั่วไปสามารถรักษาเพื่อนร่วมทีมได้",
  "_{1791_67_277}_": "เมื่อเล่าปี่ถูกดาเมจรุนแรง ไม่สามารถกระตุ้นพรสวรรค์ถูกดาเมจแปลงเป็นเลือดได้",
  "_{1791_67_278}_": "เมื่อเล่าปี่ถูกดาเมจรุนแรง สามารถกระตุ้นพรสวรรค์ถูกดาเมจแปลงเป็นเลือดได้",
  "_{1791_67_279}_": "จูกัดเหลียงโจมตีทั่วไปและสกิลเป็นการโจมตีเป้าหมายแถวหลัง",
  "_{1791_67_27}_": "กองทัพยึดครองเตียงฮันในศึกแร่ปัจจุบันคือ#param#",
  "_{1791_67_280}_": "จูกัดเหลียงมีเพียงสกิลที่เป็นการโจมตีเป้าหมายแถวหลัง",
  "_{1791_67_281}_": "ประเภทโจมตีของอุยซีเป็นโจมตีเวทมนตร์",
  "_{1791_67_282}_": "ประเภทโจมตีของอุยซีเป็นโจมตีกายภาพ",
  "_{1791_67_283}_": "สกิลโจมตีของกวนอูเป็นโจมตีศัตรูเดี่ยว",
  "_{1791_67_284}_": "สกิลโจมตีของกวนอูเป็นโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_285}_": "หลังจากเตียวหุยทะลวง+5 HPยิ่งต่ำ ดาเมจยิ่งสูง",
  "_{1791_67_286}_": "หลังจากเตียวหุยทะลวง+5 HPยิ่งสูง ดาเมจยิ่งสูง",
  "_{1791_67_287}_": "หลังจากม้าเฉียวปล่อยสกิล สามารถเพิ่มโล่ป้องกันดาเมจให้แถวหน้าฝ่ายตนเองได้",
  "_{1791_67_288}_": "หลังจากม้าเฉียวปล่อยสกิล สามารถเพิ่มโล่ป้องกันดาเมจให้ทุกคนฝ่ายตนเองได้",
  "_{1791_67_289}_": "สกิลโจมตีของฮองตงคือโจมตีแถวหน้าฝ่ายศัตรู",
  "_{1791_67_28}_": "กองทัพยึดครองฉิวฉุนในศึกแร่ปัจจุบันคือ#param#",
  "_{1791_67_290}_": "สกิลโจมตีของฮองตงคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_291}_": "สกิลโจมตีของเกียงอุยคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_292}_": "สกิลโจมตีของเกียงอุยคือโจมตีศัตรูเดี่ยว",
  "_{1791_67_293}_": "สกิลโจมตีของอุยเอี๋ยนคือโจมตีแถวแนวตั้งฝ่ายศัตรู",
  "_{1791_67_294}_": "สกิลโจมตีของอุยเอี๋ยนคือโจมตีเดี่ยวแถวหลังฝ่ายศัตรู",
  "_{1791_67_295}_": "หลังจากบังทองปล่อยสกิล สามารถฟื้นฟูโทสะของตนเอง1แต้ม",
  "_{1791_67_296}_": "บังทองฉายาหงส์อ่อน จึงมีสเตตัสพิเศษพิเศษตายแล้วสามารถฟื้นชีพได้",
  "_{1791_67_297}_": "หลังจากชีซีปล่อยสกิล มีโอกาสเพิ่มเอฟเฟกต์มึน",
  "_{1791_67_298}_": "หลังจากชีซีปล่อยสกิล มีโอกาสเพิ่มเอฟเฟกต์เงียบขรึม",
  "_{1791_67_299}_": "สกิลโจมตีของซุนเซ็กเผาไหม้เป้าหมาย สร้างดาเมจเพิ่มขึ้น",
  "_{1791_67_29}_": "กองทัพยึดครองด่านเฮาโลก๋วนในศึกกองทัพปัจจุบันคือ#param#",
  "_{1791_67_2}_": "ผู้เล่นอันดับ2ในอันดับเลเวลปัจจุบันคือ#param#",
  "_{1791_67_300}_": "สกิลโจมตีของซุนเซ็กเผาไหม้เป้าหมาย มองข้ามการป้องกันของเป้าหมาย",
  "_{1791_67_301}_": "เมื่อไต้เกี้ยวปล่อยสกิล สามารถรักษาฝ่ายตนเองทุกคน",
  "_{1791_67_302}_": "เมื่อไต้เกี้ยวปล่อยสกิล รักษาเป็นเท่าตัวให้เป้าหมายที่มีHPต่ำสุด",
  "_{1791_67_303}_": "ประเภทโจมตีของจิวยี่คือโจมตีเวทมนตร์",
  "_{1791_67_304}_": "ประเภทโจมตีของจิวยี่คือโจมตีกายภาพ",
  "_{1791_67_305}_": "สกิลโจมตีของเสี่ยวเกี้ยวเผาไหม้เป้าหมาย มีโอกาสเพิ่มเอฟเฟกต์เหน็บชา",
  "_{1791_67_306}_": "สกิลโจมตีของเสี่ยวเกี้ยวเผาไหม้เป้าหมาย มีโอกาสเพิ่มเอฟเฟกต์มึน",
  "_{1791_67_307}_": "สกิลโจมตีของไทสูจู้คือโจมตีแถวหน้าฝ่ายศัตรู",
  "_{1791_67_308}_": "สกิลโจมตีของไทสูจู้คือโจมตีแถวหลังฝ่ายศัตรู",
  "_{1791_67_309}_": "สกิลโจมตีของซุนกวนเผาไหม้เป้าหมาย สร้างดาเมจเพิ่มขึ้น",
  "_{1791_67_30}_": "กองทัพยึดครองด่านหานกู่ในศึกกองทัพปัจจุบันคือ#param#",
  "_{1791_67_310}_": "สกิลโจมตีของซุนกวนเผาไหม้เป้าหมาย สามารถฟื้นฟูHPของตนเองได้",
  "_{1791_67_311}_": "สุมาอี้ปล่อยสกิลมีโอกาสเพิ่มสกิล1ครั้งเป็นสเตตัสพิเศษศาสตรา",
  "_{1791_67_312}_": "สุมาอี้ปล่อยสกิลมีโอกาสเพิ่มสกิล1ครั้งเป็นสเตตัสพิเศษขุนพล",
  "_{1791_67_313}_": "สเตตัสพิเศษศาสตราของเตียวคับคือปล่อยสกิลเพิ่มโล่ไร้ศัตรู",
  "_{1791_67_314}_": "สเตตัสพิเศษศาสตราของเตียวคับคือเพิ่มคริติคอลทั้งหมด",
  "_{1791_67_315}_": "เมื่อจูล่งทะลวง+12 มีโอกาส35%ดำเนินการช่วยโจมตี",
  "_{1791_67_316}_": "ฆ่าเป้าหมายเพิ่มโจมตีทั่วไปเป็นสเตตัสพิเศษศาสตราของจูล่ง",
  "_{1791_67_317}_": "ฆ่าเป้าหมายเพิ่มโจมตีทั่วไปเป็นสเตตัสพิเศษทะลวง+10ของจูล่ง",
  "_{1791_67_318}_": "อุยซีไม่พกพาศาสตราปล่อยสกิลไม่สามารถฟื้นฟูโทสะให้ทุกคน1แต้ม",
  "_{1791_67_31}_": "กองทัพยึดครองหอกระบี่ในศึกกองทัพปัจจุบันคือ#param#",
  "_{1791_67_32}_": "กองทัพยึดครองเซียวเหยาจินในศึกกองทัพปัจจุบันคือ#param#",
  "_{1791_67_33}_": "อันดับ1ในเส้นทางฮัวหยงครั้งที่แล้วคือ#param#",
  "_{1791_67_34}_": "อันดับ2ในเส้นทางฮัวหยงครั้งที่แล้วคือ#param#",
  "_{1791_67_35}_": "อันดับ3ในเส้นทางฮัวหยงครั้งที่แล้วคือ#param#",
  "_{1791_67_3}_": "ผู้เล่นอันดับ3ในอันดับเลเวลปัจจุบันคือ#param#",
  "_{1791_67_4}_": "ผู้เล่นอันดับ1ในอันดับพลังรบปัจจุบันคือ#param#",
  "_{1791_67_5}_": "ผู้เล่นอันดับ2ในอันดับพลังรบปัจจุบันคือ#param#",
  "_{1791_67_6}_": "ผู้เล่นอันดับ3ในอันดับพลังรบปัจจุบันคือ#param#",
  "_{1791_67_7}_": "กองทัพอันดับ1ในอันดับกองทัพปัจจุบันคือ#param#",
  "_{1791_67_8}_": "กองทัพอันดับ2ในอันดับกองทัพปัจจุบันคือ#param#",
  "_{1791_67_9}_": "กองทัพอันดับ3ในอันดับกองทัพปัจจุบันคือ#param#"
}
