--historical_hero_equipment

local historical_hero_equipment = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --名称-string 
      short_description = 3,    --装备短描述-string 
      long_description = 4,    --装备详细描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"古琴号鐘","高漸離専用装備。加護武将のHPが上昇","高漸離専用武器。高漸離が加護する武将のHP+5%",},
        [2] = {102,"驚龍の刃","阿珂専用装備。加護武将の与えるダメージが上昇","荊軻専用武器。荊軻が加護する武将のダメージ+5%",},
        [3] = {103,"寒光銀槍","韓信専用装備。加護武将の攻撃力が上昇","韓信専用兵器。韓信が加護する武将の攻撃力+5%",},
        [4] = {104,"虚空の筆","張良専用装備。加護武将のダメージ軽減効果が上昇","張良専用兵器。張良が加護する武将のダメージ軽減+5%",},
        [5] = {201,"定秦の長剣","始皇帝専用装備。受ける直接ダメージを減少","始皇帝専用武器。始皇帝が加護する武将が敵から受ける直接ダメージがさらに-9%、受ける異常効果(麻痺、めまい、沈黙、やけど、中毒、虚弱、制圧、鉄鎖、吹っ飛ばし)の確率-12%",},
        [6] = {202,"八服漢剣","漢の武帝専用装備。加護武将の攻撃力が上昇","漢の武帝の専用兵器。武帝が加護する武将の攻撃力および回復+9%、会心ダメージ+24%",},
        [7] = {203,"覇王槍","項羽専用装備。味方の神獣効果を増幅する","項羽専用兵器、項羽が加護する武将は味方の青龍、朱雀、玄武のバフを受ける時、効果が更に+25%(怒気増加なし)",},
        [8] = {204,"含光琵琶","虞美人専用装備。加護武将の異常状態を解消","加護武将が敵武将の直接ダメージを受ける時、自身のやけどまたは中毒を解消する",},
    },

    -- index
    __index_id = {
        [101] = 1,
        [102] = 2,
        [103] = 3,
        [104] = 4,
        [201] = 5,
        [202] = 6,
        [203] = 7,
        [204] = 8,
    }
}

return historical_hero_equipment