--official_rank

local official_rank = {
    version =  1,
    -- key
    __key_map = {
      id = 1,    --id-int 
      name = 2,    --晋升名称-string 
      text_1 = 3,    --主界面提示文本-string 
      text_2 = 4,    --晋升提示文本-string 
    
    },
    -- data
    _data = {
        [1] = {0,"平民","今回の昇進で新たに増えた主人公の縁: 防御の書(中)—防御+70%","新しく増えた主人公の縁: 防御の書(中)—防御力ボーナス+70%",},
        [2] = {1,"護軍","","",},
        [3] = {2,"司馬","今回の昇進で主人公の縁が新規追加: 命の書(下)—HPボーナス+80%","新しく増えた主人公の縁: 命の書(下)—HP+80%",},
        [4] = {3,"都尉","","",},
        [5] = {4,"校尉","","",},
        [6] = {5,"太守","","",},
        [7] = {6,"刺史","今回の昇進で追加された縁: 攻撃の書(下)—攻撃力ボーナス+70%","新しく増えた主人公の縁: 攻撃の書(下)—攻撃力ボーナス+70%",},
        [8] = {7,"中郎将","","",},
        [9] = {8,"京兆尹","","",},
        [10] = {9,"尚書令","","",},
        [11] = {10,"衛将軍","新しく増えた主人公の縁: 武将(金)との縁","新しく増えた主人公の縁: 武将(金)との縁",},
        [12] = {11,"大都督","","",},
        [13] = {12,"大将軍","","",},
        [14] = {13,"大司空","","",},
        [15] = {14,"大司徒","","",},
        [16] = {15,"大司馬","","",},
        [17] = {16,"太尉","","",},
    },

    -- index
    __index_id = {
        [0] = 1,
        [1] = 2,
        [10] = 11,
        [11] = 12,
        [12] = 13,
        [13] = 14,
        [14] = 15,
        [15] = 16,
        [16] = 17,
        [2] = 3,
        [3] = 4,
        [4] = 5,
        [5] = 6,
        [6] = 7,
        [7] = 8,
        [8] = 9,
        [9] = 10,
    }
}

return official_rank