--festival_res

local festival_res = {
    -- key
    __key_map = {
      id = 1,    --排序id_key-int 
      res_name = 2,    --资源名称-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"欢庆佳节-夏季通用",},
        [2] = {2,"说明-夏季通用",},
        [3] = {3,"欢庆佳节-通用",},
        [4] = {4,"说明-通用",},
        [5] = {5,"欢庆佳节-七夕新版",},
        [6] = {6,"说明-七夕新版",},
        [7] = {7,"宣传-七夕新版",},
        [8] = {8,"欢庆佳节-合服",},
        [9] = {9,"说明-合服",},
        [10] = {10,"宣传-国庆",},
        [11] = {11,"欢庆佳节-秋季通用",},
        [12] = {12,"说明-秋季通用",},
        [13] = {13,"欢庆佳节-双12狂欢",},
        [14] = {14,"说明-双12狂欢",},
        [15] = {15,"欢庆佳节-年终盛典",},
        [16] = {16,"说明-年终盛典",},
        [17] = {17,"欢庆佳节-快乐圣诞",},
        [18] = {18,"说明-快乐圣诞",},
        [19] = {19,"欢庆佳节-喜迎新春",},
        [20] = {20,"说明-喜迎新春",},
    }
}

return festival_res