--auction

local auction = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --子叶签-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {101,"軍團BOSS",},
        [2] = {102,"軍團答題",},
        [3] = {103,"軍團試煉",},
        [4] = {104,"三國戰紀",},
        [5] = {105,"軍團戰",},
        [6] = {201,"全服",},
        [7] = {301,"陣營競技",},
        [8] = {401,"城池行商",},
        [9] = {501,"神秘行商",},
        [10] = {601,"跨服個人",},
        [11] = {701,"跨服軍團戰",},
    }
}

return auction