--bubble

local bubble = {
    -- key
    __key_map = {
      id = 1,    --对话id_key-int 
      content = 2,    --对话内容-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1001,"主公, 看我給你尋找更多的體力丹, 精力丹和銀兩!",},
        [2] = {1002,"主公, 待我尋得大量將魂, 武將經驗道具歸來!",},
        [3] = {1003,"主公, 有我在, 再也不用擔心突破丹不夠了!",},
        [4] = {1004,"主公, 看我給你尋覓更多的裝備精煉石!",},
        [5] = {1005,"主公, 養寶物不用愁, 待我給你整來更多寶物精煉石!",},
        [6] = {1006,"主公, 多拿些神兵進階石, 培養神兵, 我就可以吊打別人了!",},
        [7] = {1007,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [8] = {1008,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [9] = {1009,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [10] = {1010,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [11] = {1011,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [12] = {1012,"主公, 在你的守護下, 城池現在欣欣向榮, 請收下天下百姓的心意吧.",},
        [13] = {1013,"主公加油, 我去巡邏了!",},
        [14] = {1101,"想戰勝我需要點實力!",},
        [15] = {1102,"想戰勝我需要點實力!",},
        [16] = {1103,"想戰勝我需要點實力!",},
        [17] = {1104,"想戰勝我需要點實力!",},
        [18] = {1105,"想戰勝我需要點實力!",},
        [19] = {1106,"想戰勝我需要點實力!",},
        [20] = {1201,"大人威武",},
        [21] = {1202,"好愛大人",},
        [22] = {1203,"麼麼噠大人",},
        [23] = {1204,"好萌啊大人, 人家要給你生猴子!",},
        [24] = {1205,"大膽妖孽!",},
        [25] = {1206,"媽媽啊, 怕怕!",},
        [26] = {1207,"啊啊, 快跑啊!",},
        [27] = {1208,"討厭, 哼!",},
        [28] = {1301,"叛軍來了, 救我!",},
        [29] = {1302,"正在請求增援!",},
        [30] = {1303,"可惡!難道我要命喪於此?",},
        [31] = {1304,"撐不住了, 快來幫我!",},
        [32] = {1305,"大哥, 行行好, 幫個忙!",},
        [33] = {1401,"孤獨是多麼多麼寂寞!",},
        [34] = {1402,"你們這群渣渣, 怎懂我的孤獨!",},
        [35] = {1403,"受死吧, 一幫蠢貨!",},
        [36] = {1404,"想我一代風流人物, 獨領風騷!",},
        [37] = {2000,"一統天下, 舍我其誰!",},
        [38] = {2001,"麾下武將等級不足, 快升級一下吧",},
        [39] = {2002,"麾下武將還可以突破到更高等級!",},
        [40] = {2003,"武將覺醒能帶來很多戰力哦～",},
        [41] = {2004,"我們的武將還需要等級更高的裝備",},
        [42] = {2005,"精煉裝備能大幅提升戰力!",},
        [43] = {2006,"寶物還沒有得到足夠的強化",},
        [44] = {2007,"精煉寶物能帶來很強大的戰力",},
        [45] = {2008,"神兵進階到25級, 能解鎖更強大的技能!",},
    }
}

return bubble