--cake_task

local cake_task = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      desc = 2,    --描述_翻译-string 
    
    },
    -- data
    _data = {
        [1] = {100,"挑戰主線或精英副本25次",},
        [2] = {101,"挑戰主線或精英副本50次",},
        [3] = {102,"挑戰主線或精英副本75次",},
        [4] = {103,"挑戰主線或精英副本100次",},
        [5] = {200,"遊歷25次",},
        [6] = {201,"遊歷50次",},
        [7] = {202,"遊歷75次",},
        [8] = {203,"遊歷100次",},
        [9] = {300,"每日任務活躍度達到30",},
        [10] = {301,"每日任務活躍度達到60",},
        [11] = {302,"每日任務活躍度達到90",},
        [12] = {303,"每日任務活躍度達到120",},
        [13] = {304,"每日任務活躍度達到150",},
        [14] = {400,"參加12點軍團BOSS活動1次",},
        [15] = {500,"參加19點軍團BOSS活動1次",},
        [16] = {600,"參加答題活動1次",},
        [17] = {700,"參加軍團試煉1次",},
    }
}

return cake_task