--equipment

local equipment = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --装备名称-繁体-string 
      description = 3,    --装备描述-繁体-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {101,"古錠刀","採用上等精鐵, 運用古法鍛造, 重三十八斤, 常為軍內精銳配備.",1,},
        [2] = {102,"黑鐵甲","採用上等玄鐵, 鍛造七七四十九天而成, 非普攻兵器可破之甲.",1,},
        [3] = {103,"逍遙巾","採用上等布匹, 用清心明目藥物浸泡製成, 護體明心, 使人時刻保持清醒.",1,},
        [4] = {104,"雲紋靴","採用上等獸皮, 又以秘法鞣制而成, 甚為透氣吸汗, 可長時間穿戴.",1,},
        [5] = {201,"寒冰劍","寒鐵鑄之, 劍身冰寒, 兵未到而寒先至, 禦敵于寒光之中.",1,},
        [6] = {202,"環鎖鎧","精鋼鑄之, 一百零八片精鋼片是為一鎧, 防禦出眾且輕便.",1,},
        [7] = {203,"亮銀盔","精鋼鑄之, 以秘銀塗之表面, 可有效保護頭部, 抵禦攻擊.",1,},
        [8] = {204,"貂皮靴","貂皮縫之, 一貂為一靴, 冬暖夏涼, 行軍上品.",1,},
        [9] = {301,"驚雷長槍","百煉精鋼, 天雷淬煉, 揮舞時有電光閃爍, 驚雷咆哮.",1,},
        [10] = {302,"幻日戰甲","百煉精鋼, 描以幻日, 能夠使敵人產生錯覺, 攻擊落空.",1,},
        [11] = {303,"落月髮冠","月缺而編, 月圓而成, 日息月作, 故有月光之力.",1,},
        [12] = {304,"幻影皮靴","飛蝠所制, 靈活輕便,  穿之可日行百里而不歇.",1,},
        [13] = {305,"斷魂戰斧","傳聞此斧斬敵上千, 斧下亡魂凝而不散, 禦敵之時斧未至, 魂先斷, 故為斷魂.",1,},
        [14] = {306,"霹靂銀鎧","采極品秘銀, 引九天之雷, 常有霹靂閃現其上.",1,},
        [15] = {307,"烈焰戰盔","采火山岩鐵, 引地火煉造, 常有烈焰閃耀其上.",1,},
        [16] = {308,"疾風戰靴","采大鵬之羽, 蘊疾風之力, 行之如有疾風助力.",1,},
        [17] = {401,"真武麒麟弓","蘊含麒麟之力的神弓, 非千斤之力不可開.",1,},
        [18] = {402,"乾坤蛟鱗甲","采蛟龍之革, 蘊含乾坤八卦之力.",1,},
        [19] = {403,"無雙鳳翎盔","頭盔插有鳳翎, 蘊含鳳凰之能.",1,},
        [20] = {404,"混元金剛靴","金剛所鑄, 堅韌無比, 蘊含混沌之力.",1,},
        [21] = {405,"清霜寒冰劍","采九天寒冰, 低溫鍛造數年而成, 相傳為大都督周瑜摯愛之劍.",1,},
        [22] = {406,"玲瓏赤羽甲","傳說左慈為天命之人秘制的鎧甲, 採用翡翠精煉而成, 紅色羽毛編織的結繩更蘊含左慈的防禦仙術.",1,},
        [23] = {407,"九霄墨玉冠","世家大族所用之物, 通體以墨玉點綴, 上等絲線縫製而成, 高雅美觀.",1,},
        [24] = {408,"織羽金絲靴","採用精美錦緞與碧玉製成, 華美貴氣, 對敵之時更具備不錯的防護力.",1,},
        [25] = {409,"破軍·七殺槍","破軍套裝部件之一, 曾有猛將手持此槍, 于數萬敵軍七進七出而不敗.",1,},
        [26] = {410,"破軍·貪狼甲","破軍套裝部件之一, 兩肩為貪狼之形, 全甲有貪狼之威.",1,},
        [27] = {411,"破軍·銀獅盔","破軍套裝部件之一, 以珍貴的西涼秘銀鍛造而成, 外形如獅子, 威武無比.",1,},
        [28] = {412,"破軍·踏天靴","破軍套裝部件之一, 外附隕鐵之片, 內以珍獸之革, 舉手投足之間, 擁有踏天之勢.",1,},
        [29] = {501,"四神·青龍槍","四神套裝部件之一, 融合了少許神獸青龍的氣息, 揮舞時常有龍嘯之音, 可震敵於無形.",1,},
        [30] = {502,"四神·玄武甲","四神套裝部件之一, 融合了少許神獸玄武的氣息, 擁有完美的防身效果.",1,},
        [31] = {503,"四神·白虎盔","四神套裝部件之一, 融合了少許神獸白虎的氣息, 可使人戰力非凡, 更上層樓.",1,},
        [32] = {504,"四神·朱雀靴","四神套裝部件之一, 融合了少許神獸朱雀的氣息, 朱雀之力可使人體魄遠超常人.",1,},
        [33] = {601,"八荒·饕餮戟","八荒套裝部件之一, 蘊含著上古凶獸饕餮的靈力, 戰鬥時如有神助, 威力不凡.",1,},
        [34] = {602,"八荒·窮奇鎧","八荒套裝部件之一, 蘊含著上古凶獸窮奇的靈力, 防禦堅固, 堅不可摧.",1,},
        [35] = {603,"八荒·檮杌冠","八荒套裝部件之一, 蘊含著上古凶獸檮杌的靈力, 堅定意志, 穩固心神.",1,},
        [36] = {604,"八荒·混沌靴","八荒套裝部件之一, 蘊含著上古凶獸混沌的靈力, 能帶給人無窮的生機.",1,},
    }
}

return equipment