--explore_discover

local explore_discover = {
    -- key
    __key_map = {
      id = 1,    --奇遇类型_key-int 
      name = 2,    --奇遇事件-繁体-string 
      description = 3,    --文本描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"水鏡學堂","",},
        [2] = {2,"小遊戲","",},
        [3] = {3,"小遊戲","",},
        [4] = {4,"慕名而來","聽聞主公招賢納士, 無憂驚天不世之才!特來投奔!",},
        [5] = {5,"半價物資","主公, 這些都是走私過來的物資, 只要主公願意, 我就把他們全部半價拿了!",},
        [6] = {6,"洛陽之戰","董卓挾持漢獻帝劉協西走長安, 並驅使洛陽數百萬人口西遷長安.\n行前, 西涼軍大肆燒殺搶掠, 洛陽周圍二百里內盡成瓦礫.",},
        [7] = {7,"董卓戰亂","權傾朝野, 美人貂蟬, 挾天子以令諸侯, 誰能奈我何?",},
        [8] = {8,"神秘寶箱","此神秘寶箱乃夏商時期巧匠必勝心血所制, 主公稍後片刻即可.",},
        [9] = {11,"遊歷跑圖獎勵_藍色寶物","",},
        [10] = {12,"遊歷跑圖獎勵_紫色碎片寶物","",},
        [11] = {13,"遊歷跑圖獎勵_紫色完整寶物","",},
        [12] = {14,"遊歷跑圖獎勵_橙色碎片寶物","",},
        [13] = {15,"遊歷跑圖獎勵_橙色完整寶物","",},
    }
}

return explore_discover