--function_preview

local function_preview = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      text = 2,    --文本描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"#level#級開啟, 招募武將可啟動上陣武將名將冊, 戰力會有大幅提升!",},
        [2] = {2,"#level#級可穿戴裝備, 初級裝備可從主線副本獲得!",},
        [3] = {3,"#level#級開啟第4陣位, 可上陣第4名武將!",},
        [4] = {4,"#level#級開啟競技場, 挑戰可獲得大量元寶, 排名越高獎勵越多!",},
        [5] = {5,"#level#級開啟遊歷系統, 在神州大地上遊歷, 觸發奇遇可獲得寶物!",},
        [6] = {6,"達到#level#級, 主角和武將可突破+2, 每次突破都會大幅提升武將戰鬥力!",},
        [7] = {8,"#level#級開啟第5陣位, 可上陣第5名武將!",},
        [8] = {9,"#level#級開啟官銜, 晉升官銜, 爭奪榮耀巔峰!",},
        [9] = {10,"#level#級開啟, 挑戰歷代名將, 勇奪裝備精華, 神裝等你來拿!",},
        [10] = {11,"#level#級開啟日常副本, 海量資源天天拿!",},
        [11] = {12,"#level#級開啟軍團, 打軍團BOSS拿海量元寶分紅!",},
        [12] = {13,"達到#level#級, 主角和武將可突破+3!",},
        [13] = {14,"#level#級開啟第4陣位, 可上陣第6名武將!",},
        [14] = {15,"#level#級開啟領地巡邏, 派遣名將巡邏城池, 得海量資源, 還有幾率偶遇整將!",},
        [15] = {16,"#level#級開啟援軍, 招募武將上陣援助, 啟動羈絆, 享有大量戰力加成!",},
        [16] = {17,"達到#level#級, 主角和武將可突破+4!",},
        [17] = {18,"#level#級開啟裝備精煉, 裝備精煉可大大提高戰鬥力, 別忘了多多收集精煉石喲!",},
        [18] = {19,"#level#級開啟名將副本, 海量元寶, 將魂任你拿!",},
        [19] = {20,"#level#級開啟南蠻入侵, 挑戰蠻荒凶徒, 獲取神兵利器!",},
        [20] = {21,"#level#級開啟寶物精煉, 主公記得多買寶物精煉石!",},
        [21] = {22,"#level#級開啟武將覺醒, 武將覺醒可大大提高武將的基礎屬性!",},
        [22] = {23,"#level#級開啟錦囊系統, 裝備錦囊大大增強武將特性, 玩法更多變喲!",},
        [23] = {24,"#level#級開啟變身卡, 可自由轉換主角, 隨心所欲搭配陣營, 玩的更嗨!",},
        [24] = {25,"#level#級開啟神獸功能, 萌寵在手, 天下我有!",},
        [25] = {26,"#level#級開啟武將置換, 可隨意置換橙, 紅武將, 隨心所欲玩轉陣容!",},
        [26] = {27,"#level#級開啟界限突破, 橙色武將逆天改命, 實力暴漲!",},
        [27] = {28,"#level#級開啟玉石鑲嵌, 裝備屬性如虎添翼, 戰鬥力更上一層樓!",},
    }
}

return function_preview