--gemstone

local gemstone = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --名称-繁体-string 
      bag_description = 3,    --背包描述-繁体-string 
      description = 4,    --装备描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {101,"綠晶攻擊寶石","晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.","綠瑩瑩晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.",},
        [2] = {102,"綠晶防禦寶石","晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.","綠瑩瑩晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.",},
        [3] = {103,"綠晶生命寶石","晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.","綠瑩瑩晶瑩璀璨的寶石, 通體綠瑩瑩, 摸起來涼涼的.",},
        [4] = {104,"綠晶覺醒卷軸","孕育綠色寶石的原始卷軸, 有不可思議的能量.","孕育綠色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [5] = {201,"藍晶攻擊寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [6] = {202,"藍晶防禦寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [7] = {203,"藍晶生命寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [8] = {204,"藍晶覺醒卷軸","孕育藍色寶石的原始卷軸, 有不可思議的能量.","孕育藍色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [9] = {301,"海藍攻擊寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [10] = {302,"海藍防禦寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [11] = {303,"海藍生命寶石","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.","晶瑩璀璨的寶石, 通體天藍色, 摸起來涼涼的.",},
        [12] = {304,"海藍覺醒卷軸","孕育藍色寶石的原始卷軸, 有不可思議的能量.","孕育藍色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [13] = {401,"紫晶攻擊寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [14] = {402,"紫晶防禦寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [15] = {403,"紫晶生命寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [16] = {404,"紫晶覺醒卷軸","孕育紫色寶石的原始卷軸, 有不可思議的能量.","孕育紫色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [17] = {501,"紫耀攻擊寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [18] = {502,"紫耀防禦寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [19] = {503,"紫耀生命寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [20] = {504,"紫耀覺醒卷軸","孕育紫色寶石的原始卷軸, 有不可思議的能量.","孕育紫色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [21] = {601,"星空攻擊寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [22] = {602,"星空防禦寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [23] = {603,"星空生命寶石","高級的紫寶石, 摸起來涼涼的.","高級的紫寶石, 摸起來涼涼的.",},
        [24] = {604,"星空覺醒卷軸","孕育紫色寶石的原始卷軸, 有不可思議的能量.","孕育紫色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [25] = {701,"黃晶攻擊寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [26] = {702,"黃晶防禦寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [27] = {703,"黃晶生命寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [28] = {704,"黃晶覺醒卷軸","孕育橙色寶石的原始卷軸, 有不可思議的能量.","孕育橙色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [29] = {801,"龍晶攻擊寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [30] = {802,"龍晶防禦寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [31] = {803,"龍晶生命寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [32] = {804,"龍晶覺醒卷軸","孕育橙色寶石的原始卷軸, 有不可思議的能量.","孕育橙色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [33] = {901,"太陽攻擊寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [34] = {902,"太陽防禦寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [35] = {903,"太陽生命寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [36] = {904,"太陽覺醒卷軸","孕育橙色寶石的原始卷軸, 有不可思議的能量.","孕育橙色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [37] = {1001,"璀璨攻擊寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [38] = {1002,"璀璨防禦寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [39] = {1003,"璀璨生命寶石","頂級寶石, 通體發橙光, 摸起來涼涼的.","頂級寶石, 通體發橙光, 摸起來涼涼的.",},
        [40] = {1004,"璀璨覺醒卷軸","孕育橙色寶石的原始卷軸, 有不可思議的能量.","孕育橙色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [41] = {1101,"紅晶攻擊寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [42] = {1102,"紅晶防禦寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [43] = {1103,"紅晶生命寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [44] = {1104,"紅晶覺醒卷軸","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [45] = {1201,"赤焰攻擊寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [46] = {1202,"赤焰防禦寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [47] = {1203,"赤焰生命寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [48] = {1204,"赤焰覺醒卷軸","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [49] = {1301,"血月攻擊寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [50] = {1302,"血月防禦寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [51] = {1303,"血月生命寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [52] = {1304,"血月覺醒卷軸","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
        [53] = {1401,"輝煌攻擊寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [54] = {1402,"輝煌防禦寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [55] = {1403,"輝煌生命寶石","頂級寶石, 通體發紅光, 摸起來涼涼的.","頂級寶石, 通體發紅光, 摸起來涼涼的.",},
        [56] = {1404,"輝煌覺醒卷軸","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.","孕育紅色寶石的原始卷軸, 聽說威力巨大, 有不可思議的能量.",},
    }
}

return gemstone