--guild_stage_atk_reward

local guild_stage_atk_reward = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --名称-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"大將軍",},
        [2] = {2,"車騎將軍",},
        [3] = {3,"驃騎將軍",},
        [4] = {4,"翊軍將軍",},
        [5] = {5,"龍驤將軍",},
        [6] = {6,"奮威將軍",},
        [7] = {7,"破虜將軍",},
        [8] = {8,"奮武將軍",},
        [9] = {9,"討逆將軍",},
        [10] = {10,"征虜將軍",},
        [11] = {11,"平東將軍",},
        [12] = {12,"平南將軍",},
        [13] = {13,"平西將軍",},
        [14] = {14,"平北將軍",},
        [15] = {15,"鎮軍將軍",},
        [16] = {16,"蕩寇將軍",},
        [17] = {17,"平虜將軍",},
        [18] = {18,"威遠將軍",},
        [19] = {19,"綏遠將軍",},
        [20] = {20,"牙門將軍",},
        [21] = {21,"武威將軍",},
        [22] = {22,"武衛將軍",},
        [23] = {23,"平狄將軍",},
        [24] = {24,"威虜將軍",},
        [25] = {25,"揚威將軍",},
        [26] = {26,"振威將軍",},
        [27] = {27,"振武將軍",},
        [28] = {28,"鷹揚將軍",},
        [29] = {29,"偏將軍",},
        [30] = {30,"揚武將軍",},
        [31] = {31,"折衝將軍",},
        [32] = {32,"虎翼將軍",},
        [33] = {33,"裨將軍",},
        [34] = {34,"橫野將軍",},
        [35] = {35,"橫江將軍",},
        [36] = {36,"建武將軍",},
        [37] = {37,"伏波將軍",},
        [38] = {38,"虎威將軍",},
        [39] = {39,"虎烈將軍",},
        [40] = {40,"校尉",},
    }
}

return guild_stage_atk_reward