--guild_stage_talk

local guild_stage_talk = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      talk1 = 2,    --说话1-繁体-string 
      talk2 = 3,    --说话2-繁体-string 
      talk3 = 4,    --说话3-繁体-string 
      talk4 = 5,    --说话4-繁体-string 
      talk5 = 6,    --说话5-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"不是……不要誤會, 我不是針對你","我是說在做各位……都是垃圾","我一拳下去, 你可能會死哦!","弱者為何要戰鬥?!","我一根手指都能滅了你!",},
        [2] = {2,"順流而下, 襲敵不備!","你是令人敬佩的對手!","旗鼓相當的對手, 本將軍喜歡!","今日便是你們軍團的末日!","不要走!今日我要與你大戰300回合!",},
        [3] = {3,"我從未見過有如此厚顏無恥之人!","將軍饒命, 小的上有老下有小!","不找個旗鼓相當的對手嗎?","打我對你沒啥好處!","我建議你找我上面的傢伙!",},
    }
}

return guild_stage_talk