--guild_boss_info

local guild_boss_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      city_name = 2,    --城池名称-繁体-string 
      name = 3,    --名称-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"兗州","華雄",},
        [2] = {2,"徐州","公孫瓚",},
        [3] = {3,"西城","龐統",},
        [4] = {4,"街亭","徐庶",},
        [5] = {5,"夏口","甘寧",},
        [6] = {6,"三江口","呂蒙",},
        [7] = {7,"倉亭","曹仁",},
        [8] = {8,"烏巢","張郃",},
        [9] = {9,"","魏武帝曹操",},
        [10] = {10,"","臥龍諸葛亮",},
        [11] = {11,"","大都督周瑜",},
        [12] = {12,"","戰神呂布",},
    }
}

return guild_boss_info