--guild_cross_war

local guild_cross_war = {
    -- key
    __key_map = {
      id = 1,    --索引id_key-int 
      point_name = 2,    --据点名字-string 
      name = 3,    --BOSS名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"軍營駐地","黃巾賊亡魂",},
        [2] = {2,"軍營駐地","黃巾賊亡魂",},
        [3] = {3,"軍營駐地","黃巾賊亡魂",},
        [4] = {4,"軍營駐地","黃巾賊亡魂",},
        [5] = {5,"軍營駐地","黃巾賊亡魂",},
        [6] = {6,"軍營駐地","黃巾賊亡魂",},
        [7] = {7,"軍營駐地","黃巾賊亡魂",},
        [8] = {8,"軍營駐地","黃巾賊亡魂",},
        [9] = {9,"軍營駐地","黃巾賊亡魂",},
        [10] = {10,"軍營駐地","黃巾賊亡魂",},
        [11] = {11,"軍營駐地","黃巾賊亡魂",},
        [12] = {12,"軍營駐地","黃巾賊亡魂",},
        [13] = {13,"軍營駐地","黃巾賊亡魂",},
        [14] = {14,"軍營駐地","黃巾賊亡魂",},
        [15] = {15,"軍營駐地","黃巾賊亡魂",},
        [16] = {16,"軍營駐地","黃巾賊亡魂",},
        [17] = {17,"青州","",},
        [18] = {18,"徐州","",},
        [19] = {19,"揚州","",},
        [20] = {20,"荊州","",},
        [21] = {21,"益州","",},
        [22] = {22,"涼州","",},
        [23] = {23,"並州","",},
        [24] = {24,"幽州","",},
        [25] = {25,"中州","",},
    }
}

return guild_cross_war