--guild_support_talks

local guild_support_talks = {
    -- key
    __key_map = {
      id = 1,    --说话id_key-int 
      talks = 2,    --援助看板娘随机说话文本，每次进入界面或者点击立绘头像随机播放文字-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"還沒有在軍團求援嗎?趕緊去求援吧!",},
        [2] = {2,"每天求援可以獲得3個紅色色武將碎片哦!",},
        [3] = {3,"每天求援可以獲得5個紫色武將碎片哦!",},
        [4] = {4,"每天求援可以獲得4個橙色武將碎片哦!",},
        [5] = {5,"還沒完成求援?快去軍團呼叫吧!",},
        [6] = {6,"多餘的武將碎片可以贈予同軍團成員!",},
        [7] = {7,"贈送武將碎片可以獲得軍團貢獻",},
        [8] = {8,"完成3次求援可獲得星彩精心準備的大獎哦!",},
    }
}

return guild_support_talks