--head_frame

local head_frame = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      is_work = 4,    --是否生效-int 
    
    },
    -- data
    _data = {
        [1] = {1,"快解鎖頭像框吧","",1,},
        [2] = {2,"情有獨鍾頭像框","累計簽到達到365天獲取",1,},
        [3] = {3,"超群絕倫頭像框","累計參加99次軍團boss獲取",1,},
        [4] = {4,"才華橫溢頭像框","累計參加50次軍團答題獲取",1,},
        [5] = {5,"出類拔萃頭像框","累計參加50次軍團試煉獲取",1,},
        [6] = {6,"勇冠三軍頭像框","累計參加20次三國戰紀獲取",1,},
        [7] = {7,"所向披靡頭像框","累計參加20次軍團戰獲取",1,},
        [8] = {8,"大家風範頭像框","貴族3專屬",1,},
        [9] = {9,"名門望族頭像框","貴族7專屬",1,},
        [10] = {10,"侯服玉食頭像框","貴族12專屬",1,},
        [11] = {11,"佩金帶紫頭像框","貴族13專屬",1,},
        [12] = {12,"玉葉金柯頭像框","貴族14專屬",1,},
        [13] = {13,"不貲之軀頭像框","貴族15專屬",1,},
        [14] = {14,"龍血鳳髓頭像框","貴族16專屬",1,},
        [15] = {15,"1週年頭像框","1週年活動限時獲取",0,},
        [16] = {16,"建功立業頭像框","慶典活動限時獲取",1,},
        [17] = {17,"豐功偉績頭像框","慶典活動限時獲取",1,},
        [18] = {18,"流芳百世頭像框","慶典活動限時獲取",1,},
        [19] = {19,"結交頭像框","見龍在田活動限時獲取",1,},
        [20] = {20,"尋隱頭像框","見龍在田活動限時獲取",1,},
        [21] = {21,"見龍在田頭像框","見龍在田活動限時獲取",1,},
    }
}

return head_frame