--horse_star

local horse_star = {
    -- key
    __key_map = {
      id = 1,    --编号_math-int 
      name = 2,    --装备名称-繁体-string 
      skill = 3,    --技能描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"青騅","[青騅]騎乘武將攻擊加成+1%",},
        [2] = {1,"追風·青騅","[追風·青騅]騎乘武將攻擊加成+2%",},
        [3] = {1,"逐日·青騅","[逐日·青騅]騎乘武將攻擊加成+3%",},
        [4] = {2,"綠耳","[綠耳]騎乘武將防禦加成+1%",},
        [5] = {2,"追風·綠耳","[追風·綠耳]騎乘武將防禦加成+2%",},
        [6] = {2,"逐日·綠耳","[逐日·綠耳]騎乘武將防禦加成+3%",},
        [7] = {3,"渠黃","[渠黃]騎乘武將生命加成+1%",},
        [8] = {3,"追風·渠黃","[追風·渠黃]騎乘武將生命加成+2%",},
        [9] = {3,"逐日·渠黃","[逐日·渠黃]騎乘武將生命加成+3%",},
        [10] = {4,"棗騮","[棗騮]騎乘武將暴擊傷害加成+1%",},
        [11] = {4,"追風·棗騮","[追風·棗騮]騎乘武將暴擊傷害加成+2%",},
        [12] = {4,"逐日·棗騮","[逐日·棗騮]騎乘武將暴擊傷害加成+3%",},
        [13] = {5,"雪裡白","[雪裡白]騎乘武將傷害加成+3%",},
        [14] = {5,"追風·雪裡白","[追風·雪裡白]騎乘武將傷害加成+6%",},
        [15] = {5,"逐日·雪裡白","[逐日·雪裡白]騎乘武將傷害加成+9%",},
        [16] = {6,"颯露紫","[颯露紫]騎乘武將受到的傷害減免+3%",},
        [17] = {6,"追風·颯露紫","[追風·颯露紫]騎乘武將受到的傷害減免+6%",},
        [18] = {6,"逐日·颯露紫","[逐日·颯露紫]騎乘武將受到的傷害減免+9%",},
        [19] = {7,"紅玉輦","[紅玉輦]騎乘武將生命加成+3%",},
        [20] = {7,"追風·紅玉輦","[追風·紅玉輦]騎乘武將生命加成+6%",},
        [21] = {7,"逐日·紅玉輦","[逐日·紅玉輦]騎乘武將生命加成+9%",},
        [22] = {8,"碧驄駒","[碧驄駒]騎乘武將暴擊概率加成+3%",},
        [23] = {8,"追風·碧驄駒","[追風·碧驄駒]騎乘武將暴擊概率加成+6%",},
        [24] = {8,"逐日·碧驄駒","[逐日·碧驄駒]騎乘武將暴擊概率加成+9%",},
        [25] = {9,"飛霜千里","[飛霜千里]攻擊對敵方造成傷害的20%轉化為治療, 治療己方血量最少的目標.",},
        [26] = {9,"追風·飛霜千里","[追風·飛霜千里]攻擊對敵方造成傷害的30%轉化為治療, 治療己方血量最少的目標, 並為該目標額外回復10%生命上限的血量.",},
        [27] = {9,"逐日·飛霜千里","[逐日·飛霜千里]攻擊對敵方造成傷害的30%轉化為治療, 治療己方血量最少的目標, 並為該目標額外回復30%生命上限的血量.",},
        [28] = {10,"烏雲踏雪","[烏雲踏雪]攻擊對敵方造成傷害額外增加16%.",},
        [29] = {10,"追風·烏雲踏雪","[追風·烏雲踏雪]攻擊對敵方造成傷害額外增加25%, 擊殺目標後50%概率回復自身1點怒氣.",},
        [30] = {10,"逐日·烏雲踏雪","[逐日·烏雲踏雪]攻擊對敵方造成傷害額外增加25%, 擊殺目標後回復自身1點怒氣, 並且下次回怒時額外回復自身1點怒氣",},
        [31] = {11,"胭脂火龍","[胭脂火龍]治療效果提高10%, 治療被封療的目標, 可為其附加持續一回合的吸收傷害護盾, 吸收40%治療量的傷害",},
        [32] = {11,"追風·胭脂火龍","[追風·胭脂火龍]治療效果提高18%, 治療被封療的目標, 可為其附加持續一回合的吸收傷害護盾, 吸收70%治療量的傷害",},
        [33] = {11,"逐日·胭脂火龍","[逐日·胭脂火龍]治療效果提高25%, 治療被封療的目標, 可為其附加持續一回合的吸收傷害護盾, 吸收100%治療量的傷害",},
        [34] = {12,"夜照玉獅","[夜照玉獅]戰鬥中每回合最多受到2點怒氣降低效果",},
        [35] = {12,"追風·夜照玉獅","[追風·夜照玉獅]戰鬥前最多受到1點怒氣降低效果, 戰鬥中每回合最多受到2點怒氣降低效果",},
        [36] = {12,"逐日·夜照玉獅","[逐日·夜照玉獅]戰鬥前最多受到1點怒氣降低效果, 戰鬥中每回合最多受到1點怒氣降低效果",},
        [37] = {15,"奔雷青驄","[奔雷青驄]生命最大值提高15%.戰鬥中首次受到致命傷害時, 不會死亡並且會回復20%最大生命值的生命",},
        [38] = {15,"追風·奔雷青驄","[追風·奔雷青驄]生命最大值提高30%.戰鬥中首次受到致命傷害時, 不會死亡並且回復40%最大生命值的血量, 回復自身2點怒氣.",},
        [39] = {15,"逐日·奔雷青驄","[逐日·奔雷青驄]生命最大值提高45%.戰鬥中首次受到致命傷害時, 不會死亡並且回復60%最大生命值的血量, 回復自身4點怒氣",},
        [40] = {13,"爪黃飛電","[爪黃飛電]敬請期待",},
        [41] = {13,"望月·爪黃飛電","[望月·爪黃飛電]敬請期待",},
        [42] = {13,"踏天·爪黃飛電","[踏天·爪黃飛電]敬請期待",},
        [43] = {14,"霹靂的盧","[霹靂的盧]敬請期待",},
        [44] = {14,"望月·霹靂的盧","[望月·霹靂的盧]敬請期待",},
        [45] = {14,"踏天·霹靂的盧","[踏天·霹靂的盧]敬請期待",},
    }
}

return horse_star