--horse

local horse = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --装备名称-繁体-string 
      description = 3,    --装备描述-繁体-string 
      type = 4,    --泛用性-繁体-string 
      show_day = 5,    --图鉴显示天数-int 
    
    },
    -- data
    _data = {
        [1] = {1,"青騅","青騅, 蒼白雜色的駿馬, 戰場上毫無畏懼, 迎箭而上迅猛異常.","所有",0,},
        [2] = {2,"綠耳","綠耳, 青黃色的馬, 穆王八駿之一, 日行千里, 不知疲倦.","所有",0,},
        [3] = {3,"渠黃","渠黃, 如其名全身鵝黃色, 穆王八駿之一, 一形十影, 速度極快.","所有",0,},
        [4] = {4,"棗騮","棗騮, 全身褐色, 肌如鋼鐵, 力氣很大, 負百斤之重, 仍可健步如飛.","所有",0,},
        [5] = {5,"雪裡白","雪裡白, 通體雪白, 蹄為黑者, 踏雪如履平地, 馬之君子.","所有",0,},
        [6] = {6,"颯露紫","颯露紫, 如紫色飛燕, 傲骨嶙嶙, 氣愚三川, 威淩八陣.","所有",0,},
        [7] = {7,"紅玉輦","紅玉輦, 體如紅玉, 吉祥如意, 真龍天子之駒.","所有",0,},
        [8] = {8,"碧驄駒","碧驄駒, 體呈青白, 身形健碩, 奔跑似龍行天際, 速度快且型美.","所有",0,},
        [9] = {9,"飛霜千里","飛霜千里, 身體雪白似冰霜, 神秘輕盈, 行萬里不知疲憊, 所過之處如飛霜過境, 寒氣逼人, 讓人無法靠近.","輔助類",40,},
        [10] = {10,"烏雲踏雪","烏雲踏雪, 通體如黑緞子一般, 油光放亮, 唯有四個馬蹄部位白得賽雪, 背長腰短而平直, 四肢關節筋腱發育壯實, 身覆重甲, 從一而終.","輸出類",40,},
        [11] = {11,"胭脂火龍","胭脂火龍, 渾身上下, 火炭般赤, 無半根雜毛, 嘶喊咆哮, 有騰空入海之狀, 鬃卷似江波, 又如少女髮絲般柔軟, 行速如飛, 過川登山, 如履平地.","治療類",40,},
        [12] = {12,"夜照玉獅","夜照玉獅, 一色雪白, 僅脖子尾巴覆金色毛髮, 大蹄, 宛如雄獅一般, 性格暴烈, 既能日行千里, 亦能跨越天險, 出入戰場如入無人之境.","輔助, 控制類",40,},
        [13] = {15,"奔雷青驄","萬里追電攔路虎, 舉世無雙一奔雷.頭帶閃電, 腳踏幽光, 奔跑時如疾雷呼嘯而過.通曉人性, 耐力持久, 助英雄在戰場上屢立奇功.","肉盾類",40,},
        [14] = {13,"神·爪黃飛電","神·爪黃飛電, 通體雪白, 四蹄為黃, 氣質高貴非凡, 傲氣不可一世, 與眾不同, 梟雄帝王之駒.","所有",9999,},
        [15] = {14,"神·的盧追月","神·的盧追月, 兇悍淩厲, 速度之快可及日月, 既能穿行水中, 又能一越三丈, 躍溪跨潭不在話下.","所有",9999,},
    }
}

return horse