--horse_equipment

local horse_equipment = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --装备名称-string 
      description = 3,    --装备描述-string 
    
    },
    -- data
    _data = {
        [1] = {101,"白玉馬鞍","白玉製成的馬鞍, 極為名貴.",},
        [2] = {102,"紫金馬鐙","紫金鑲嵌的馬鐙, 彰顯氣質.",},
        [3] = {103,"銀環韁繩","藍緞製成的韁繩, 盡享絲滑.",},
        [4] = {201,"滄海碧蛟鞍","據說有蛟龍的靈魂附著其上, 保佑征戰無往不勝.",},
        [5] = {202,"大漠蒼狼鐙","有蒼狼之靈保佑的馬鐙, 默默守護著主人.",},
        [6] = {203,"烈日騰蛇韁","牽著附有騰蛇氣息的韁繩, 騎馬時如騰雲駕霧一般.",},
    }
}

return horse_equipment