--jade

local jade = {
    -- key
    __key_map = {
      id = 1,    --玉石id_key-int 
      name = 2,    --玉石名称-string 
      profile = 3,    --玉石短描述-繁体-string 
      description = 4,    --玉石详情-繁体-string 
      bag_description = 5,    --背包玉石描述-繁体-string 
      button_txt = 6,    --按钮文字-繁体-string 
      equipment = 7,    --适用装备-繁体_math-string 
    
    },
    -- data
    _data = {
        [1] = {1101,"青龍星光玉·攻","攻擊+5000","攻擊+5000(主角每升1級攻擊額外+100)","攻擊+5000","鑲 嵌","601|501|409",},
        [2] = {1102,"青龍星光玉·療","治療加成+8%","治療加成+8%(僅對治療型武將的治療生效)","治療加成+8%","鑲 嵌","601|501|409",},
        [3] = {1103,"青龍星光玉·暴","暴擊幾率+12%","暴擊幾率+12%","暴擊幾率+12%","鑲 嵌","601|501|409",},
        [4] = {1104,"玄武星光玉·物","物理防禦+2500","物理防禦+2500(主角每升1級物理防禦額外+50)","物理防禦+2500","鑲 嵌","602|502|410",},
        [5] = {1105,"玄武星光玉·愈","被治療率+8%","被治療率+8%(僅對治療型武將的治療生效)","被治療率+8%","鑲 嵌","602|502|410",},
        [6] = {1106,"玄武星光玉·抗","抗暴幾率+12%","抗暴幾率+12%","抗暴幾率+12%","鑲 嵌","602|502|410",},
        [7] = {1107,"白虎星光玉·法","法術防禦+2500","法術防禦+2500(主角每升1級法術防禦額外+50)","法術防禦+2500","鑲 嵌","603|503|411",},
        [8] = {1108,"白虎星光玉·愈","被治療率+8%","被治療率+8%(僅對治療型武將的治療生效)","被治療率+8%","鑲 嵌","603|503|411",},
        [9] = {1109,"白虎星光玉·閃","閃避幾率+12%","閃避幾率+12%","閃避幾率+12%","鑲 嵌","603|503|411",},
        [10] = {1110,"朱雀星光玉·血","生命+37500","生命+37500(主角每升1級生命額外+750)","生命+37500","鑲 嵌","604|504|412",},
        [11] = {1111,"朱雀星光玉·療","治療加成+8%","治療加成+8%(僅對治療型武將的治療生效)","治療加成+8%","鑲 嵌","604|504|412",},
        [12] = {1112,"朱雀星光玉·命","命中幾率+12%","命中幾率+12%","命中幾率+12%","鑲 嵌","604|504|412",},
        [13] = {1201,"青龍月華玉·攻","攻擊加成+12%","攻擊加成+12%","攻擊加成+12%","鑲 嵌","601|501|409",},
        [14] = {1202,"青龍月華玉·療","治療加成+12%","治療加成+12%(僅對治療型武將的治療生效)","治療加成+12%","鑲 嵌","601|501|409",},
        [15] = {1203,"青龍月華玉·暴","暴擊幾率+22%","暴擊幾率+22%","暴擊幾率+22%","鑲 嵌","601|501|409",},
        [16] = {1204,"玄武月華玉·物","物理防禦加成+12%","物理防禦加成+12%","物理防禦加成+12%","鑲 嵌","602|502|410",},
        [17] = {1205,"玄武月華玉·愈","被治療率+12%","被治療率+12%(僅對治療型武將的治療生效)","被治療率+12%","鑲 嵌","602|502|410",},
        [18] = {1206,"玄武月華玉·抗","抗暴幾率+22%","抗暴幾率+22%","抗暴幾率+22%","鑲 嵌","602|502|410",},
        [19] = {1207,"白虎月華玉·法","法術防禦加成+12%","法術防禦加成+12%","法術防禦加成+12%","鑲 嵌","603|503|411",},
        [20] = {1208,"白虎月華玉·愈","被治療率+12%","被治療率+12%(僅對治療型武將的治療生效)","被治療率+12%","鑲 嵌","603|503|411",},
        [21] = {1209,"白虎月華玉·閃","閃避幾率+22%","閃避幾率+22%","閃避幾率+22%","鑲 嵌","603|503|411",},
        [22] = {1210,"朱雀月華玉·血","生命加成+12%","生命加成+12%","生命加成+12%","鑲 嵌","604|504|412",},
        [23] = {1211,"朱雀月華玉·療","治療加成+12%","治療加成+12%(僅對治療型武將的治療生效)","治療加成+12%","鑲 嵌","604|504|412",},
        [24] = {1212,"朱雀月華玉·命","命中幾率+22%","命中幾率+22%","命中幾率+22%","鑲 嵌","604|504|412",},
        [25] = {1301,"青龍日耀玉·傷","傷害加成+18%","傷害加成+18%","傷害加成+18%","鑲 嵌","601|501|409",},
        [26] = {1302,"青龍日耀玉·療","治療加成+18%","治療加成+18%(僅對治療型武將的治療生效)","治療加成+18%","鑲 嵌","601|501|409",},
        [27] = {1303,"青龍日耀玉·暴","暴擊幾率+32%","暴擊幾率+32%","暴擊幾率+32%","鑲 嵌","601|501|409",},
        [28] = {1304,"青龍日耀玉·克","PVP增傷+18%","PVP增傷+18%","PVP增傷+18%","鑲 嵌","601|501|409",},
        [29] = {1305,"玄武日耀玉·護","傷害減免+18%","傷害減免+18%","傷害減免+18%","鑲 嵌","602|502|410",},
        [30] = {1306,"玄武日耀玉·愈","被治療率+18%","被治療率+18%(僅對治療型武將的治療生效)","被治療率+18%","鑲 嵌","602|502|410",},
        [31] = {1307,"玄武日耀玉·抗","抗暴幾率+32%","抗暴幾率+32%","抗暴幾率+32%","鑲 嵌","602|502|410",},
        [32] = {1308,"玄武日耀玉·韌","PVP減傷+18%","PVP減傷+18%","PVP減傷+18%","鑲 嵌","602|502|410",},
        [33] = {1309,"白虎日耀玉·護","傷害減免+18%","傷害減免+18%","傷害減免+18%","鑲 嵌","603|503|411",},
        [34] = {1310,"白虎日耀玉·愈","被治療率+18%","被治療率+18%(僅對治療型武將的治療生效)","被治療率+18%","鑲 嵌","603|503|411",},
        [35] = {1311,"白虎日耀玉·閃","閃避幾率+32%","閃避幾率+32%","閃避幾率+32%","鑲 嵌","603|503|411",},
        [36] = {1312,"白虎日耀玉·韌","PVP減傷+18%","PVP減傷+18%","PVP減傷+18%","鑲 嵌","603|503|411",},
        [37] = {1313,"朱雀日耀玉·傷","傷害加成+18%","傷害加成+18%","傷害加成+18%","鑲 嵌","604|504|412",},
        [38] = {1314,"朱雀日耀玉·療","治療加成+18%","治療加成+18%(僅對治療型武將的治療生效)","治療加成+18%","鑲 嵌","604|504|412",},
        [39] = {1315,"朱雀日耀玉·命","命中幾率+32%","命中幾率+32%","命中幾率+32%","鑲 嵌","604|504|412",},
        [40] = {1316,"朱雀日耀玉·克","PVP增傷+18%","PVP增傷+18%","PVP增傷+18%","鑲 嵌","604|504|412",},
        [41] = {2101,"青龍斷魂玉·殺意","攻擊受到控制的目標增加傷害","攻擊受到控制效果(暈眩, 沉默, 麻痹)的目標時, 增加15%的傷害.","攻擊受到控制的目標增加傷害","鑲 嵌","601|501",},
        [42] = {2102,"青龍斷魂玉·嗜血","技能攻擊可造成額外傷害","攻擊目標數量為1/2/3/4/6個目標時, 額外造成目標生命上限15%/7.5%/5%/3.75%/ 2.5%的傷害","技能攻擊可造成額外傷害","鑲 嵌","601|501",},
        [43] = {2103,"青龍斷魂玉·同心","造成傷害或治療提高","釋放技能或普攻時, 使自身造成的傷害或治療提高(己方每有一個與自己同陣營的武將, 傷害或治療+3.75%)","造成傷害或治療提高","鑲 嵌","601|501",},
        [44] = {2104,"青龍斷魂玉·如意","擊殺目標可清除異常效果","擊殺目標後, 清除己方武將身上該目標死亡前釋放的所有異常效果(灼燒, 中毒, 暈眩, 沉默, 麻痹)","擊殺目標可清除異常效果","鑲 嵌","601|501",},
        [45] = {2105,"玄武金剛玉·吸星","回合開始前獲得吸收傷害護盾","戰鬥開始前, 使自身獲得一個吸收傷害盾, 吸收自身血量上限30%的直接傷害, 持續一回合","回合開始前獲得吸收傷害護盾","鑲 嵌","602|502",},
        [46] = {2106,"玄武金剛玉·銀霜","行動後獲得吸收傷害護盾","自身行動後, 使自身獲得一個吸收傷害盾, 吸收自身生命上限15%的直接傷害, 持續一回合(自身回合內僅觸發一次)","行動後獲得吸收傷害護盾","鑲 嵌","602|502",},
        [47] = {2107,"玄武金剛玉·同澤","死亡時使隊友獲得無敵護盾","死亡時, 使血量最少的友方目標獲得一個無敵護盾, 持續1回合(護盾強度等同於張郃突破5所附加的護盾)","死亡時使隊友獲得無敵護盾","鑲 嵌","602|502",},
        [48] = {2108,"玄武金剛玉·化傷","受到極大傷害時獲得傷害減免","受到武將直接傷害時, 如果該傷害超過自身生命上限的50%, 減免此次傷害的30%","受到極大傷害時獲得傷害減免","鑲 嵌","602|502",},
        [49] = {2109,"白虎神怒玉·迴光","回合結束時回復怒氣","自身行動後, 回復自身1點怒氣(自身回合內僅觸發一次)","回合結束時回復怒氣","鑲 嵌","603|503",},
        [50] = {2110,"白虎神怒玉·靈霜","隊友釋放技能有幾率回復怒氣","隊友釋放技能後, 有20%的概率回復自身1點怒氣","隊友釋放技能有幾率回復怒氣","鑲 嵌","603|503",},
        [51] = {2111,"白虎神怒玉·化極","整體回合結束時幾率回復怒氣","整體回合結束時, 如果自身怒氣低於4點, 有35%的概率將怒氣回復至4點","整體回合結束時幾率回復怒氣","鑲 嵌","603|503",},
        [52] = {2112,"白虎神怒玉·返錦","釋放技能有幾率回復消耗怒氣","釋放技能後, 有25%的幾率獲得本次技能消耗50%的怒氣, 最多不超過4點","釋放技能有幾率回復消耗怒氣","鑲 嵌","603|503",},
        [53] = {2113,"朱雀生息玉·培元","釋放技能有幾率使隊友控制抗性增加","釋放技能後, 有50%的幾率使周圍的友方目標受到控制效果(暈眩, 沉默, 麻痹)的概率下降35%, 持續一回合","釋放技能有幾率使隊友控制抗性增加","鑲 嵌","604|504",},
        [54] = {2114,"朱雀生息玉·固本","自身恢復怒氣時可回復血量","自身回合內, 恢復怒氣的同時, 恢復自身生命上限15%的血量","自身恢復怒氣時可回復血量","鑲 嵌","604|504",},
        [55] = {2115,"朱雀生息玉·凝神","自身未行動過可獲得免控護盾","自身回合結束時, 如果本回合沒有主動行動過, 獲得1個免疫控制效果(暈眩, 沉默, 麻痹)的護盾, 持續一回合","自身未行動過可獲得免控護盾","鑲 嵌","604|504",},
        [56] = {2116,"朱雀生息玉·清心","回合開始前有幾率移除自身異常效果","自身回合開始前, 有25%的幾率移除自身所有的異常效果(灼燒, 中毒, 暈眩, 沉默, 麻痹)","回合開始前有幾率移除自身異常效果","鑲 嵌","604|504",},
    }
}

return jade