--monster_talk

local monster_talk = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      bubble = 2,    --战斗中说话内容，不要超过25个字-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"大哥最近得了一件寶貝.",},
        [2] = {2,"看我符咒的厲害!",},
        [3] = {3,"蒼天已死, 黃天當立!",},
        [4] = {4,"戰鬥初始2怒, 普攻加2怒, 4點怒氣就可以放技能哦.",},
        [5] = {5,"關銀屏姐姐是主攻手, 主公要多多培養她哦.",},
        [6] = {6,"站在前排好危險, 主公能把我放後排去嗎?",},
        [7] = {7,"站在前排好危險, 主公能把我放後排去嗎?",},
        [8] = {8,"放在後排好像安全多了, 謝謝主公!",},
        [9] = {9,"武將升級突破了嗎?穿裝備並強化了嗎?",},
        [10] = {10,"主公, 不好好培養, 是戰勝不了張讓的!",},
        [11] = {11,"主公, 不要忘記培養一下我哦!",},
        [12] = {12,"主公, 不要忘記培養一下我哦!",},
        [13] = {13,"主公, 不要忘記培養一下我哦!",},
        [14] = {14,"主公, 不要忘記培養一下我哦!",},
        [15] = {15,"主公, 不要忘記培養一下我哦!",},
        [16] = {16,"主公, 不要忘記培養一下我哦!",},
        [17] = {17,"主公, 不要忘記培養一下我哦!",},
        [18] = {18,"主公, 不要忘記培養一下我哦!",},
        [19] = {19,"打劫!把競技場得到的元寶交出來!",},
        [20] = {20,"不好好培養武將和裝備, 是打不過我的!",},
        [21] = {21,"15級武將突破+2後, 你打我才有絲絲勝算.",},
        [22] = {22,"不好好培養武將和裝備, 是打不過我的!",},
        [23] = {23,"掃蕩主線副本升到20級才能打贏我!",},
        [24] = {24,"掃蕩主線副本升到23級才能打贏我!",},
        [25] = {25,"掃蕩主線副本升到26級才能打贏我!",},
        [26] = {26,"掃蕩主線副本升到29級才能打贏我!",},
        [27] = {27,"競技場的元寶真是多啊, 哈哈哈!",},
        [28] = {28,"沒有元寶就去競技場打排名, 元寶非常多!",},
        [29] = {29,"其他人一定不知道16級即可掃蕩副本, 超快速提升等級, 哈哈.",},
        [30] = {31,"應該只有我才知道16級可以掃蕩滿星副本!",},
        [31] = {32,"武將升到25級即可突破+3, 突破+3可在第一回合釋放技能和合擊!",},
        [32] = {33,"掃蕩主線副本可快速提升主角等級",},
        [33] = {34,"掃蕩主線副本可快速提升主角等級",},
        [34] = {35,"掃蕩主線副本可快速提升主角等級",},
        [35] = {36,"掃蕩主線副本可快速提升主角等級",},
        [36] = {37,"聽聞武將升到25級即可突破+3, 突破+3可在第一回合釋放技能和合擊!",},
        [37] = {38,"聽聞武將升到25級即可突破+3, 突破+3可在第一回合釋放技能和合擊!",},
        [38] = {39,"我家主公這麼厲害, 全靠掃蕩主線提高的等級!",},
        [39] = {40,"聽聞武將升到25級即可突破+3, 突破+3可在第一回合釋放技能和合擊!",},
        [40] = {41,"橙將比紫將厲害很多!",},
        [41] = {42,"你可知道招募是可以獲得橙將的!",},
        [42] = {43,"你沒有橙將, 是打不過我的!快去招募吧!",},
        [43] = {44,"你沒有橙將, 是打不過我的!",},
        [44] = {45,"若是沒有招募獲得的橙將, 你可打不過我!",},
        [45] = {46,"若你有幾個橙將, 我定然打不過你!",},
        [46] = {47,"區區紫將, 也敢來戰?",},
        [47] = {48,"你沒有更多橙將, 是打不過我的!",},
        [48] = {49,"憑什麼我夏侯淵是紫將!",},
    }
}

return monster_talk