--notification

local notification = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      time_txt = 2,    --标题-繁体-string 
      chat_before = 3,    --文本-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"午宴開始了","各位主公, 午宴已經開始, 快去參加午宴補充大量體力吧!",},
        [2] = {2,"晚宴開始了","各位主公, 晚宴已經開始, 快去參加晚宴補充大量體力吧!",},
        [3] = {3,"夜宵開始了","各位主公, 夜宵已經開始, 快去參加夜宵補充大量體力吧!",},
        [4] = {4,"軍團BOSS來臨","軍團BOSS將在5分鐘後來臨, 主公請前往挑戰, 擊退BOSS後可參與拍賣和分紅!",},
        [5] = {5,"軍團BOSS來臨","軍團BOSS將在5分鐘後來臨, 主公請前往挑戰, 擊退BOSS後可參與拍賣和分紅!",},
        [6] = {6,"每日早上禮物","各位主公, 快點登錄領取您的早上禮物吧~~~",},
        [7] = {7,"三國戰紀開戰","三國戰紀將在5分鐘後開戰, 挑戰BOSS並擊破之, 可以參與拍賣和分紅!",},
        [8] = {8,"陣營競技開戰","陣營競技將在5分鐘後開戰, 誰是陣營王者, 請前往一決高下!",},
        [9] = {9,"軍團戰一觸即發","軍團戰將在5分鐘後開戰, 奪城占地, 做巔峰軍團, 就在此時!",},
    }
}

return notification