--official_rank

local official_rank = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --晋升名称-繁体-string 
      text_1 = 3,    --主界面提示文本-繁体-string 
      text_2 = 4,    --晋升提示文本-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {0,"平民","本次晉升新增主角緣分: 防禦中冊—防禦加成+70%","新增主角緣分: 防禦中冊—防禦加成+70%",},
        [2] = {1,"護軍","","",},
        [3] = {2,"司馬","本次晉升新增主角緣分: 生命下冊—生命加成+80%","新增主角緣分: 生命下冊—生命加成+80%",},
        [4] = {3,"都尉","","",},
        [5] = {4,"校尉","","",},
        [6] = {5,"太守","","",},
        [7] = {6,"刺史","本次晉升新增主角緣分: 攻擊下冊—攻擊加成+70%","新增主角緣分: 攻擊下冊—攻擊加成+70%",},
        [8] = {7,"中郎將","","",},
        [9] = {8,"京兆尹","","",},
        [10] = {9,"尚書令","","",},
        [11] = {10,"衛將軍","","",},
        [12] = {11,"大都督","","",},
        [13] = {12,"大將軍","","",},
    }
}

return official_rank