--pet

local pet = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --名称-繁体-string 
      description = 3,    --宠物描述-繁体-string 
      description1 = 4,    --show宠物描述1-繁体-string 
      description2 = 5,    --show宠物描述2-繁体-string 
      skill_name = 6,    --show宠物技能名称-繁体-string 
      skill_description = 7,    --show宠物技能描述-繁体-string 
      is_fight = 8,    --无差别竞技里是否可用_math-int 
    
    },
    -- data
    _data = {
        [1] = {1,"熊貓","熊貓, 又稱食鐵獸, 熊貓爸爸兇猛有力, 熊貓寶寶聰明呆萌, 父子組合, 所向披靡","熊貓爸爸兇猛有力, 熊貓寶寶聰明呆萌","父子組合, 所向披靡","[破膽咆哮]","對敵方單體造成傷害",0,},
        [2] = {2,"靈鹿","靈鹿, 生長在天地間的神奇靈物, 鹿角為天地靈氣凝結而成, 靈氣綻放時可助人起死回生.","生長在天地間的神奇靈物","鹿角為天地靈氣凝結而成","[花繁葉茂]","治療己方生命最少的隊友",0,},
        [3] = {3,"烈火狐","烈火狐, 傳說此狐三尾, 四爪帶火, 凶戾高傲, 但恩怨分明, 有仇報仇, 有恩報恩.","三尾, 四爪帶火","恩怨分明, 有仇報仇, 有恩報恩","[火狐卷尾]","對敵方後排造成傷害",0,},
        [4] = {4,"紫青鸞","紫青鸞, 羽色華麗, 紫中帶青.古人視赤色為鳳, 青色為鸞.傳說青鸞為愛情的象徵, 唱歌時會給心誠之人帶來桃花運.","羽色華麗, 紫中帶青","傳說是愛情的象徵","[風捲殘雲]","對敵方前排造成傷害",0,},
        [5] = {5,"雷霆白虎","雷霆白虎, 四神獸之一, 通體雪白, 紫光流溢, 可禦使雷電之力.","通體雪白, 紫光流溢","可禦使雷電之力","[曜日奔雷]","戰前減怒, 戰中再減怒",1,},
        [6] = {6,"滄海青龍","滄海青龍, 四神獸之首, 自古就是祥瑞的象徵.東方青龍, 角亢之精, 吐雲鬱炁, 啖雷發聲, 飛翔八極, 周遊四冥, 來立吾左.","四神獸之首","自古就是祥瑞的象徵","[青龍之怒]","恢復我方成員怒氣",1,},
        [7] = {7,"赤炎朱雀","赤炎朱雀, 百鳥之王, 四大神獸中的顏值擔當.主火, 唯美而暴力, 自歌自舞, 預示著吉祥安寧, 蓬勃騰達.","能繼燃灼燒之物","能接引靈魂上升於天","[業炎焚天]","對敵方全體被灼燒目標造成傷害",1,},
        [8] = {8,"裂天玄武","裂天玄武, 四神獸之一, 龜, 蛇組成的靈物, 自古就是長生不老的象徵.玄武者, 北方壬癸水黑汞也, 能柔能剛, 非鉛非錫非眾石之類, 水乃河東神水, 生乎天地之先, 至藥不可暫舍, 能養育萬物.","龜蛇組合成的靈物","長生不老的象徵","[玄武之佑]","給我方成員附加護盾",1,},
        [9] = {9,"北冥聖鯤","鯤出自莊子·逍遙遊: 北冥有魚, 其名為鯤.鯤之大, 不知其幾千里也.明代德清莊子內篇注雲: 北冥即北海, 以曠遠非世人所見之地, 以喻玄冥大道.海中之鯤, 以喻大道體中養成大聖之胚胎, 喻如大鯤, 非北海之大不能養成也.","北冥有魚, 其名為鯤","鯤之大, 不知其幾千里也","[雲夢逍遙]","清除我方成員眩暈狀態",1,},
        [10] = {10,"雷火麒麟","雷火麒麟, 與鳳龜龍謂之四靈, 遊必澤土, 祥而後處, 不履生蟲, 不踐生草, 王者有出, 辨善惡通天理.","千年祥瑞神靈","辨善惡通天理","[天命抉擇]","對敵方隨機目標造成生命上限50%的傷害",1,},
        [11] = {11,"麟華年獸","傳說中每逢歲末時出沒在人間的幼年凶獸, 眼若銅鈴, 來去如風, 金身流彩, 威風凜凜；性如幼童般活潑好動, 十分喜愛熱鬧.","金身流彩, 威風凜凜","性如幼童般活潑好動","[燎竹天降]","血量低於一定值的目標會被斬殺",0,},
        [12] = {12,"天瑞白澤","象征著祥瑞的白澤, 通人語, 通萬物之情, 曉天下萬物狀貌, 是令人逢凶化吉的吉祥之獸.","曉天下萬物狀貌","逢凶化吉","[幽雨流光]","回合開始前放逐敵方目標",0,},
        [13] = {106,"神·青龍","滄海青龍, 四神獸之首, 自古就是祥瑞的象征.東方青龍, 角亢之精, 吐云郁炁, 啖雷發聲, 飛翔八極, 周遊四冥, 來利吾左.","四神獸之首","自古就是祥瑞的象征","[青龍之怒]","恢復我方成員怒氣",0,},
    }
}

return pet