--pet_map

local pet_map = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --图鉴名称-繁体-string 
      show_day = 3,    --达到开服天数显示-int 
      show = 4,    --是否显示-int 
    
    },
    -- data
    _data = {
        [1] = {1,"鐘靈毓秀",1,1,},
        [2] = {2,"霽風朗月",1,1,},
        [3] = {3,"水火不容",21,1,},
        [4] = {4,"月舞神殤",21,1,},
        [5] = {5,"漫天烽火",21,1,},
        [6] = {6,"絕天龍牙",21,1,},
        [7] = {7,"楚竹驚鸞",21,1,},
        [8] = {8,"天外行雲",21,1,},
        [9] = {9,"驚雷炎火",10,1,},
        [10] = {10,"森羅萬象",10,1,},
        [11] = {11,"霞姿月韻",50,1,},
        [12] = {12,"清風霽月",50,1,},
        [13] = {13,"紅煌流星",50,1,},
        [14] = {14,"絕雲烈日",50,1,},
        [15] = {15,"破炎",999,1,},
        [16] = {16,"破雲",999,1,},
        [17] = {17,"逢凶化吉",999,1,},
        [18] = {18,"地火天雷",999,1,},
    }
}

return pet_map