--play_horse_bubble

local play_horse_bubble = {
    -- key
    __key_map = {
      rank = 1,    --名次_key-int 
      text_1 = 2,    --文本1-繁体-string 
      text_2 = 3,    --文本2-繁体-string 
      text_3 = 4,    --文本3-繁体-string 
      text_4 = 5,    --文本4-繁体-string 
      text_5 = 6,    --文本5-繁体-string 
      text_6 = 7,    --文本6-繁体-string 
      text_7 = 8,    --文本7-繁体-string 
      text_8 = 9,    --文本8-繁体-string 
      text_9 = 10,    --文本9-繁体-string 
      text_10 = 11,    --文本10-繁体-string 
      text_11 = 12,    --文本11-繁体-string 
      text_12 = 13,    --文本12-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"開局第一, 穩拿第一.","你們就歇著吧, 第一我來拿.","你們跑得太慢了, 完全不是對手.","今天伙食不錯, 第一勢在必得!","腳下生風, 沒聽過嗎?","是時候展現真正的實力了.","你們腳下灌鉛了嗎, 真慢!","沖啊, 101小姐姐快來給我加油吧!","前方就是終點, 第一非我莫屬.","我屬兔子的, 你們都屬烏龜, 哈哈哈哈!","都不用搶了, 第一馬上是我的了!","衝刺, 勝利在向我召喚!",},
        [2] = {2,"開局跑這麼快幹嘛, 省點力氣衝刺!","讓你一步, 待我運功發力就追上你.","別嘚瑟了, 我馬上就能追上你!","跑完了去喝個小酒, 聽個小曲, 怎麼樣?","我還沒有使出全力呢.","今天不是你第一, 就是我第二…","和第一就差一個身位, 加把勁趕上去!","你看我這身材, 肯定能拿個好名次!","除了第一, 第二和第五好像沒什麼區別.","我不要當什麼第二!","最後的奮力一搏, 啊啊啊啊!","就差一點點, 好不甘心啊!",},
        [3] = {3,"我就讓一讓你們, 別得意太早.","我這叫保存體力, 你們懂嗎.","你們不看好我嗎, 我可能是黑馬喲.","…跑步就跑步, 你們廢話真多!","賽場還有一半, 論輸贏還早.","別看不起我的淩波微步, 馬上就能追上你們.","前面的兩個等等我!","有些人啊, 自己跑不動, 就怨別人.","前面的, 我馬上就能追上你!","加把勁, 拿個第三也不錯!","我才不要當第三, 不行不行!","這一次輸了沒關係, 下一次還有機會!",},
        [4] = {4,"不行不行, 我怎麼倒數第二了!","我身上裝備重, 等我脫掉幾件就能追上來.","起步打滑了一下而已, 待我後程發力.","別嫌我慢, 我已經很努力了.","別看不起我, 誰還沒腳滑的時候.","前面的慢點, 你們元寶掉了.","有句話叫後來居上, 相信我.","狗策劃, 終點這麼遠, 想累死我嗎?","完了, 感覺自己擠不進前三了, 可恨.","啊啊啊啊, 打死也不能當倒數第一.","馬上到終點了, 應該不用當最後一名.","人艱不拆, 重在參與, 呵呵噠!",},
        [5] = {5,"開始慢, 不一定代表一直慢.","別看我現在第五, 說不定最後我拿第一!","我可是練過的, 別以為我跑不快.","今天伙食不錯, 吃太多了有點跑不動.","呼呼呼呼, 好累跑不動了.","前面的都等等我!","早知道不夜夜笙歌了, 感覺好乏力啊.","我也累, 晚上回家一定要補個雞腿!","昨晚誰給我下瀉藥了?腳好軟, 跑不動.","你們跑慢點, 我要掉出萤幕了.","你們是不是吃了什麼神藥, 跑這麼快!","看什麼看?我可是靠實力才跑到第五的!",},
    }
}

return play_horse_bubble