--play_horse_hero

local play_horse_hero = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      text_1 = 2,    --文本1-繁体-string 
      text_2 = 3,    --文本2-繁体-string 
      text_3 = 4,    --文本3-繁体-string 
      text_4 = 5,    --文本4-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"習武可制虎豹, 集智方取天下, 腿長可贏賽跑!","我昨夜觀天象, 掐指一算, 今日第一必歸我.","我司馬世家, 怎會輸掉這個比賽.","誰敢跑我前面, 我梟首杖伺候.",},
        [2] = {2,"別看我胖, 我滾起來可快了!","沒見識過跑得快的胖子吧, 等會讓你看看眼.","我拎著大鐵錘也能跑過你, 信不!","我單手倒拖牛尾走百步, 區區賽跑不在話下.",},
        [3] = {3,"讓你們看看最美男人, 最靈動的步伐.","我有無敵盾, 賽跑時休想扯我衣裳.","我以擅長利用地形著稱, 賽場地形我已經摸了透.","為這場比賽, 我可是置辦了新行頭.",},
        [4] = {4,"我一女子參加比賽, 大家讓著點喲.","敢比我跑得快的, 鞭子伺候.","我腰以下全是腿, 跑步能慢嘛!","是男人就先讓我跑兩丈地.",},
        [5] = {5,"別看我容貌短小, 跑步我可不差.","五子良將裡屬我最跑快.","我打小穿梭市集, 腳力甚好.","小聲跟你講, 每次于禁都跑不過我.",},
        [6] = {6,"孰重孰輕, 一稱便知, 誰快誰慢, 一比便是.","跑步有助身體健康, 不容易生病.","爹爹對我寵愛有加, 我怎可丟爹爹臉.","我昨日還和哥哥曹丕練習賽跑, 我不比他慢喲.",},
        [7] = {7,"讓司馬懿滾一邊去!今天老娘必拿第一!","贏下這場比賽, 讓司馬懿另眼相看!","柏夫人雖然年輕, 但沒我有韻味啊!","無來無去, 不悔不怨.",},
        [8] = {8,"疾風行者這名號如何, 若能獲勝以後便用此名號了.","別聽樂進的, 五子良將裡跑步我才是最快的.","等下就讓你們見識我疾風般的速度.","樂進再說我沒他跑得快, 我就削他.",},
        [9] = {9,"我可是刺客, 速度是最快的!","跑到第一, 拿了賞銀, 我就去買件新裝備!","太久沒殺人, 我的刀都快生銹了!","跑完比賽, 我就請命去刺殺!",},
        [10] = {10,"孟德會來看我比賽嗎?","妾身體弱, 可不擅長這塞道之事.","知閨中樂事, 才曉人生之味.","比賽有什麼好玩的, 何不比賽之後來找我玩.",},
        [11] = {11,"七進七出, 論速度我最快!","大家記住了, 我可是人稱常勝將軍的男人.","我抱個娃子, 也能跑贏你們.","一片赤膽平亂世, 腳底生風拿第一!",},
        [12] = {12,"貴為五虎上將之首, 武聖, 不拿第一多沒面子.","早年因犯事逃至幽州涿郡, 就因為跑得快.","溫酒斬華雄算啥, 待我溫酒得第一.","我可是騎赤兔馬的男人, 速度怎會慢!",},
        [13] = {13,"我吼一嗓子, 就能把你們都震倒.","待我飲一壇烈酒, 再與你們賽跑.","誰說屠夫不能拿第一的, 今天就讓你們大開眼界.","我燕人張翼德今天就是要拿第一, 誰也別攔著!",},
        [14] = {14,"打小就是套馬的漢子, 飛奔的駿馬.","黃忠來了嘛, 快用合體技把我射出去!","認真講, 五虎上將裡數我最能跑.","你看我姓馬, 就知道我和馬跑得一樣快.",},
        [15] = {15,"族人當中, 就數我跑得最快.","誰又稱我們南蠻呢?有本事出來和我比比!","別跟我提七擒孟獲, 讓諸葛亮出來, 我們賽道上較量.","論謀略可能沒有謀士厲害, 論賽跑可就不一定了!",},
        [16] = {16,"看我的尾巴性感吧!","雖為女輩, 但我可不比你們跑得慢.","我打小山中穿梭獵兔殺豬, 身手敏捷得很.","讓諸葛亮出來, 我要在賽場上給夫君報七擒七縱之恨.",},
        [17] = {17,"打打殺殺真沒意思, 還是這賽跑有意思.","我把熊貓丟過線, 能算我贏嗎?","仁德治天下, 比賽重在參與.","快開始比賽, 結束了我還要去抱熊貓呢.",},
        [18] = {18,"看比賽的人真多, 好害羞啊!","主公, 主公, 星彩一定會為你跑個冠軍的!","嗯, 這麼多人比賽啊, 有點怕怕哦.","人這麼多, 小心中暑!",},
        [19] = {19,"虎父無犬女, 我關三小姐可不差.","我關銀屏美麗聰慧, 一身武藝, 這就給爹爹拿個第一.","總有一天我會超過爹爹, 就從今天拿第一開始吧!","今天我一定要跑個第一, 給爹爹爭口氣.",},
        [20] = {20,"我自小便精通騎射, 這跑步功夫也難不倒我!","主公, 我一定為您跑個冠軍回來!","還在倒計時?能不能快點開始!","我要拿個第一來證明我自己!",},
        [21] = {21,"吾乃江東小霸王孫伯符!","江東子弟, 何懼於天下!","我孫伯符今天勢奪第一!","江東的子弟們, 看好了!",},
        [22] = {22,"太陽這麼大, 曬黑了怎麼辦?還好有蓮華幽傘保護我!","伯符人呢, 說好為我加油的呢.","贏了比賽就輸了人生, 你們捨得贏我嗎?","等下幫我看看, 我跑起來好看嗎.",},
        [23] = {23,"哼, 不要小瞧女孩子呦!","公瑾說, 跑輸跑贏不重要, 開心才最重要!","嘻嘻, 我的星華雙扇肯定能幫我拿冠軍!","輸贏不重要, 開心才是最重要的!",},
        [24] = {24,"這裡, 是我甘寧的地盤!","我的地盤, 我肯定能拿冠軍!","在我錦帆的怒濤之下, 你們都是渣渣!","我甘興霸要把自己的名字寫在冠軍獎盃上!",},
        [25] = {25,"英姿颯爽, 不讓鬚眉!","征戰沙場都不在話下, 何況這小小賽道.","就算哥哥在場, 我也不會相讓!比賽, 就要竭盡所能!","如果我跑太快, 玄德還能追上我嗎.",},
        [26] = {26,"奏樂能不能小聲點, 我耳朵都快炸了!","給我一朵雲, 我能跑十萬八千里給你看!","誰欺我年少輕狂, 我就跑個第一讓他好看!","哈哈, 今天我一定能拿第一!",},
        [27] = {27,"妾心所系, 如月之恒.","小妹妹唱歌郎奏琴, 人生誰不惜青春.","君子樂胥, 萬邦之屏.","小妹妹似線郎似針, 郎呀穿在一起不離分.",},
        [28] = {28,"這麼皮?竟然讓我一個瞎子來跑步!","這, 萬一跑到別人的賽道怎麼算?","誰坑我, 給我報的名啊?","你們幫我看看, 莫非這是殘疾人運動會?",},
        [29] = {29,"提著燈籠跑步, 帥不帥?","仲謀說我臉長似驢, 你們覺得呢?","我諸葛一族, 人才輩出!","孔明說志當存高遠, 不想拿第一, 還參加什麼比賽啊.",},
        [30] = {30,"我的貂蟬呢?我的赤兔呢?","我戰神呂布就算不騎馬, 照樣贏你們.","你們就算騎馬也贏不了我!","整個天下都是我呂布的, 何況這小小賽道!",},
        [31] = {31,"嚶嚶嚶…妾身當盡力而為, 方不負呂布一片癡心.","誰會在終點迎接我呢?","妾身十分想念奉先.","無論輸贏, 奉先都會愛我如故!",},
        [32] = {32,"哈哈, 選中本太師, 你真有眼光!","等拿了第一, 本太師請你喝酒吃肉抱美人!","誰敢跑在本太師前面, 剁了他!","我們涼州人士, 從來就沒怕過輸!",},
        [33] = {33,"待會誰敢接近我, 我就毒死他!","你們是來比賽的, 而我于吉是來遛我家小傀儡的!","小傀儡滿肚子都是毒液, 靠近我們小心被毒死!","道法玄機, 贏比賽輕輕鬆松!",},
        [34] = {34,"誰敢槍我的玉璽?誰敢贏我?","我是袁家嫡子, 今天肯定拿第一!","誰拿第一, 封爵賞地!","我的天殘神腿, 跑起來特別快!",},
        [35] = {35,"馬頭琴好重, 今天能拿第一嗎?","妾身可撫琴, 可做賦, 可撰書, 你確定要讓我上場嗎?","聽到這熟悉的音樂, 我想起了小時候.","人生苦短, 不如開開心心來參加一場比賽.",},
        [36] = {36,"只要奉先不在, 我肯定拿第一!","若今天能跑贏比賽, 霸業可圖也!","我能跑過呂布, 你信不信?","誰拿了今天的冠軍, 我定當輔佐於他!",},
        [37] = {37,"我騎竹馬, 誰有我跑得快!","來來來, 送你吃梨, 你讓讓我好不好!","名門之後, 必奪第一!","阿斗呢, 等跑完比賽我就去玩玩他的小熊貓.",},
        [38] = {38,"我爹爹可是戰神呂布!所以我不能輸!","我只想上陣殺敵!參加比賽太大大材小用了!","爹爹答應我, 跑贏了就不用嫁給袁術的兒子!","等我拿了冠軍, 我要把獎盃送給爹爹當酒杯!",},
        [39] = {39,"斷子絕孫的味道, 想嘗嘗嗎?","哼, 跑不贏比賽, 我就剪了你!","何進那廝要殺我, 我可得跑快一點!","董卓要進京了, 大家快跑啊!",},
        [40] = {40,"等會誰敢跑在我前面, 我的大錘可饒不了他!","咳咳, 我說在場的諸位, 你們肯定跑不贏我!","我這體型, 一看就是冠軍啊.","勇者無懼, 我肯定能拿第一!",},
    }
}

return play_horse_hero