--qin_monster

local qin_monster = {
    -- key
    __key_map = {
      id = 1,    --boss序号_key-int 
      small_name = 2,    --普通怪物名称-string 
      big_name = 3,    --精英怪物名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"先秦甲士","皇陵夢魘",},
        [2] = {2,"先秦甲士","皇陵夢魘",},
        [3] = {3,"先秦甲士","皇陵夢魘",},
        [4] = {4,"先秦徒兵","皇陵夢魘",},
        [5] = {5,"先秦徒兵","皇陵夢魘",},
        [6] = {6,"先秦徒兵","皇陵夢魘",},
        [7] = {7,"先秦車兵","皇陵夢魘",},
        [8] = {8,"先秦車兵","皇陵夢魘",},
        [9] = {9,"先秦車兵","皇陵夢魘",},
    }
}

return qin_monster