--resource

local resource = {
    -- key
    __key_map = {
      id = 1,    --资源id_key-int 
      name = 2,    --资源名称-繁体-string 
      description = 3,    --道具描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"元寶","建功立業必不可少, 可招募名將和購買道具.",},
        [2] = {2,"銀兩","硬通貨, 裝備強化, 武將突破等等都能用到.",},
        [3] = {3,"體力","挑戰主線, 精英, 名將副本時需要消耗體力.",},
        [4] = {4,"精力","遊歷時需要消耗的重要資源.",},
        [5] = {5,"經驗","挑戰主線副本, 遊歷和進行冒險都能獲得經驗.",},
        [6] = {6,"貴族經驗","提高貴族等級可以解鎖更多貴族功能.",},
        [7] = {7,"威望","可在競技場商店兌換武將碎片或突破丹.",},
        [8] = {8,"功勳","可在神兵商店兌換神兵和神兵進階石.",},
        [9] = {9,"將魂","可在神將商店兌換武將, 突破丹, 銀兩和杜康.",},
        [10] = {10,"精鐵","可在裝備商店兌換裝備和裝備精煉石.",},
        [11] = {11,"南蠻令","攻擊南蠻消耗的次數",},
        [12] = {12,"挑戰次數","過關斬將的挑戰次數, 過關斬將可獲得大量裝備.",},
        [13] = {13,"軍團貢獻","可在軍團商店兌換武將或高價值道具.",},
        [14] = {14,"神魂","可在覺醒商店兌換覺醒時消耗的道具.",},
        [15] = {15,"神兵之魂","回收神兵可以獲得, 可以在神兵商店兌換神兵和神兵進階石",},
        [16] = {16,"儲值額度","使用可以獲得累計儲值, 單筆儲值活動中的儲值額度.",},
        [17] = {17,"寶物之魂","可在寶物商店兌換寶物和寶物進階石.",},
        [18] = {18,"軍團聲望","累積軍團聲望可提升軍團等級.",},
        [19] = {19,"獸魂","可在神獸商店兌換神獸或神獸相關的資源.",},
        [20] = {20,"水晶","儲值可以獲得的高級資源, 在水晶商店中使用.",},
        [21] = {21,"儲值積分","儲值獲得儲值積分, 在水晶商店獲得大量獎勵.",},
        [22] = {22,"糧草","在礦戰中移動需要消耗糧草.",},
        [23] = {23,"攻擊令","在礦戰中每次攻擊消耗1次攻擊次數.",},
        [24] = {24,"變身碎片","可在身外化身活動期間在變身卡商店兌換變身卡.",},
        [25] = {25,"追擊次數","可在割須棄袍活動期間追擊曹操獲得各種獎勵.",},
        [26] = {26,"觀星次數","可在臥龍觀星活動期間觀星獲得各種獎勵.",},
        [27] = {27,"專屬儲值額度","使用可以獲得累計儲值, 單筆儲值活動中的專屬儲值額度.",},
        [28] = {28,"馬魂","可在戰馬商店中兌換戰馬",},
        [29] = {29,"刀幣","可在王者商店中兌換紅裝及紅色錦囊.",},
        [30] = {30,"玉魂","可在原石商店中兌換原石.",},
        [31] = {31,"功績","可在慶典活動商店中兌換珍稀資源.",},
        [32] = {32,"蟠螭龍之魂","可在見龍在田活動商店中兌換珍稀資源.",},
    }
}

return resource