--seven_days_admin

local seven_days_admin = {
    -- key
    __key_map = {
      day = 1,    --天数_key-int 
      name = 2,    --页签名称-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"每日好康",},
        [2] = {1,"主線副本",},
        [3] = {1,"裝備強化",},
        [4] = {1,"半價搶購",},
        [5] = {2,"每日好康",},
        [6] = {2,"遊歷和競技",},
        [7] = {2,"寶物升級",},
        [8] = {2,"半價搶購",},
        [9] = {3,"每日好康",},
        [10] = {3,"過關斬將",},
        [11] = {3,"裝備精煉",},
        [12] = {3,"半價搶購",},
        [13] = {4,"每日好康",},
        [14] = {4,"南蠻入侵",},
        [15] = {4,"神兵進階",},
        [16] = {4,"半價搶購",},
        [17] = {5,"每日好康",},
        [18] = {5,"武將商店",},
        [19] = {5,"升級和突破",},
        [20] = {5,"半價搶購",},
        [21] = {6,"每日好康",},
        [22] = {6,"軍團BOSS",},
        [23] = {6,"寶物精煉",},
        [24] = {6,"半價搶購",},
        [25] = {7,"每日好康",},
        [26] = {7,"總戰力",},
        [27] = {7,"名將冊",},
        [28] = {7,"半價搶購",},
    }
}

return seven_days_admin