--shop_crystal

local shop_crystal = {
    -- key
    __key_map = {
      good_id = 1,    --商品id_key-int 
      description = 2,    --说明-繁体-string 
      pay_amount = 3,    --条件值_math-int 
      size_2 = 4,    --奖励数量2_math-int 
      is_work = 5,    --开关_math-int 
    
    },
    -- data
    _data = {
        [1] = {101,"今日單筆儲值#num#元寶",60,60,1,},
        [2] = {102,"今日單筆儲值#num#元寶",300,300,1,},
        [3] = {103,"本週單筆儲值#num#元寶",900,900,1,},
        [4] = {104,"參加12點的軍團BOSS",1,0,1,},
        [5] = {105,"參加19點的軍團BOSS",1,0,1,},
        [6] = {106,"參加軍團試煉",1,0,1,},
        [7] = {107,"參加軍團答題",1,0,1,},
        [8] = {108,"參加三國戰紀",1,0,1,},
        [9] = {109,"參加陣營競技",1,0,0,},
        [10] = {110,"本週單筆儲值#num#元寶",1800,1800,1,},
        [11] = {111,"參加答題活動",1,0,1,},
        [12] = {201,"今日單筆儲值#num#元寶",60,60,0,},
    }
}

return shop_crystal