--shop

local shop = {
    -- key
    __key_map = {
      shop_id = 1,    --商店ID_key-int 
      shop_name = 2,    --商店名称-繁体-string 
      tab_name1 = 3,    --页签名称-繁体-string 
      tab_name2 = 4,    --页签名称-繁体-string 
      tab_name3 = 5,    --页签名称-繁体-string 
      tab_name4 = 6,    --页签名称-繁体-string 
      tab_name5 = 7,    --页签名称-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"商城","道  具","商  品","","","",},
        [2] = {2,"裝備商店","道  具","紫  裝","橙  裝","獎  勵","",},
        [3] = {3,"神兵商店","道  具","","","","",},
        [4] = {4,"競技商店","道  具","武  將","獎  勵","","",},
        [5] = {5,"軍團商店","道  具","魏  國","蜀  國","吳  國","群  雄",},
        [6] = {6,"武將商店","武  將","","","","",},
        [7] = {7,"寶物商店","道  具","紫  寶","橙  寶","","",},
        [8] = {8,"覺醒商店","道  具","","","","",},
        [9] = {9,"每日特惠","","","","","",},
        [10] = {10,"每週特惠","","","","","",},
        [11] = {11,"神獸商店","","","","","",},
        [12] = {12,"半價物資","","","","","",},
        [13] = {13,"變身商店","魏  國","蜀  國","吳  國","群  雄","",},
        [14] = {14,"套裝商店","","","","","",},
        [15] = {15,"神獸商店","道  具","","","","",},
        [16] = {16,"覺醒商店","道  具","藍  色","紫  色","橙  色","紅  色",},
        [17] = {17,"觀星商店","","","","","",},
        [18] = {18,"戰馬商店","戰  馬","馬  具","","","",},
        [19] = {19,"王者商店","","","","","",},
        [20] = {20,"原石商店","原  石","","","","",},
        [21] = {21,"馴馬商店","","","","","",},
        [22] = {22,"慶典商店","首  日","次  日","三  日","元  寶","",},
        [23] = {24,"金將商店","金  將","限  購","資  源","","",},
    }
}

return shop