--silkbag

local silkbag = {
    -- key
    __key_map = {
      id = 1,    --锦囊id_key-int 
      name = 2,    --锦囊名称-繁体-string 
      profile = 3,    --锦囊短描述-繁体-string 
      description = 4,    --锦囊详情-繁体-string 
      bag_description = 5,    --背包锦囊描述-繁体-string 
      button_txt = 6,    --按钮文字-繁体-string 
      show_day = 7,    --图鉴显示天数-int 
      hero = 8,    --适用武将-繁体_math-string 
    
    },
    -- data
    _data = {
        [1] = {1101,"關銀屏錦囊","攻擊+1000","攻擊+1000(主角每升1級攻擊額外+40)","攻擊+1000(每級+40)","去穿戴",0,"999",},
        [2] = {1102,"張星彩錦囊","生命+7500","生命+7500(主角每升1級生命額外+300)","生命+7500(每級+300)","去穿戴",0,"999",},
        [3] = {1103,"周泰錦囊","防禦+500","防禦+500(主角每升1級防禦額外+20)","防禦+500(每級+20)","去穿戴",0,"999",},
        [4] = {1104,"呂靈雎錦囊","暴擊概率+8%","暴擊概率+8%","暴擊概率+8%","去穿戴",0,"999",},
        [5] = {1105,"黃蓋錦囊","抗暴概率+8%","抗暴概率+8%","抗暴概率+8%","去穿戴",0,"999",},
        [6] = {1106,"張讓錦囊","傷害+5%","傷害+5%","傷害+5%","去穿戴",0,"999",},
        [7] = {1107,"蔡文姬錦囊","傷害減免+5%","傷害減免+5%","傷害減免+5%","去穿戴",0,"999",},
        [8] = {1108,"于禁錦囊","暴擊傷害+5%","暴擊傷害+5%","暴擊傷害+5%","去穿戴",0,"999",},
        [9] = {1202,"劉備錦囊","釋放技能治療提升","治療武將釋放技能時, 對己方血量最少武將造成治療效果額外提升55%.","釋放技能治療增加","去穿戴",0,"102|202|302|402|216",},
        [10] = {1203,"陸遜錦囊","灼燒概率提升","攻擊目標越少, 灼燒概率提升越高, 最多對1個目標提高60%的灼燒概率.","灼燒概率增加","去穿戴",0,"303|305|311|319|313",},
        [11] = {1204,"公孫瓚錦囊","攻擊單體目標降低1點怒氣","攻擊單體目標時額外降低目標1點怒氣.","攻擊單體目標降低其1點怒氣","去穿戴",0,"212|312|404|408|409|412|413|414|415|416|417|419",},
        [12] = {1205,"關羽錦囊","初始提升1點怒氣","初始怒氣增加1點.","初始增加1點怒氣","去穿戴",0,"999",},
        [13] = {1207,"馬超錦囊","提升護盾傷害減免效果","保護目標越少, 減傷效果越高, 最高可以減免36%的傷害.(只對當前有減傷護盾的武將生效)","提升護盾傷害減免效果","去穿戴",0,"118|207|215|405",},
        [14] = {1208,"賈詡錦囊","中毒概率提升","技能攻擊目標越少, 中毒概率提升越高, 最多提高60%的中毒概率.","中毒概率增加","去穿戴",0,"410|407",},
        [15] = {1209,"徐庶錦囊","暈眩概率提升","攻擊目標越少, 暈眩概率提升越高, 最多提高48%的暈眩概率.(只對當前有暈眩效果的武將生效)","暈眩概率增加","去穿戴",0,"106|116|203|210|212|214|307|312|317|401|408|415",},
        [16] = {1211,"于吉錦囊","中毒傷害提升","攻擊目標越少, 技能造成的中毒傷害提升越高, 最多對1個目標提高60%的中毒傷害.","中毒傷害提升","去穿戴",0,"410|407",},
        [17] = {1212,"小喬錦囊","麻痹概率提升","攻擊目標越少, 麻痹概率提升越高, 最多對1個目標提高72%的麻痹概率.(只對當前有麻痹效果的武將生效)","麻痹概率提升","去穿戴",0,"219|304|411",},
        [18] = {1213,"郭嘉錦囊","沉默概率提升","攻擊目標越少, 沉默概率提升越高, 最多對1個目標提高72%的沉默概率.(只對當前有沉默效果的武將生效)","沉默概率提升","去穿戴",0,"104|115|409|419",},
        [19] = {1214,"夏侯惇錦囊","反傷比例提升","反傷增加30%.(只對當前有反傷效果的武將生效)","反傷比例提升","去穿戴",0,"105",},
        [20] = {1215,"張飛錦囊","攻擊+3000","攻擊+3000(主角每升1級攻擊額外+120)","攻擊+3000(每級+120)","去穿戴",0,"999",},
        [21] = {1216,"龐統錦囊","生命+22500","生命+22500(主角每升1級生命額外+900)","生命+22500(每級+900)","去穿戴",0,"999",},
        [22] = {1217,"孫堅錦囊","防禦+1500","防禦+1500(主角每升1級防禦額外+60)","防禦+1500(每級+60)","去穿戴",0,"999",},
        [23] = {1218,"袁術錦囊","暴擊概率+20%","暴擊概率+20%","暴擊概率+20%","去穿戴",0,"999",},
        [24] = {1219,"黃月英錦囊","抗暴概率+20%","抗暴概率+20%","抗暴概率+20%","去穿戴",0,"999",},
        [25] = {1220,"典韋錦囊","傷害+12%","傷害+12%","傷害+12%","去穿戴",0,"999",},
        [26] = {1221,"董卓錦囊","傷害減免+12%","傷害減免+12%","傷害減免+12%","去穿戴",0,"999",},
        [27] = {1222,"孫尚香錦囊","暴擊傷害+12%","暴擊傷害+12%","暴擊傷害+12%","去穿戴",0,"999",},
        [28] = {1223,"許褚錦囊","擊殺目標回復自身1點怒氣","擊殺目標回復自身1點怒氣.","擊殺目標回復自身1點怒氣","去穿戴",0,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",},
        [29] = {1224,"甄姬錦囊","技能傷害轉化治療比例提升","技能傷害轉化為血量治療當前血量最少的武將的比例提升18%.(只對當前有技能轉治療的輔助武將生效)","技能傷害轉化治療比例提升","去穿戴",7,"103|112|117|204|211|404|412",},
        [30] = {1225,"華佗錦囊","中毒傷害回復自身血量","造成的中毒傷害的10%轉化為血量治療自己.","造成的中毒傷害回復自身血量","去穿戴",7,"407|410",},
        [31] = {1226,"大喬錦囊","治療效果提升並附加減傷護盾","技能的治療效果提升25%, 同時為技能目標附加1個免傷盾, 受到所有傷害降低12%, 持續1回合.","治療效果提升並附加護盾","去穿戴",7,"102|202|302|402|216",},
        [32] = {1227,"貂蟬錦囊","降低自身被控制概率","受到的控制效果(麻痹, 沉默, 暈眩)概率降低35%.","降低自身被控制概率","去穿戴",7,"999",},
        [33] = {1301,"趙雲錦囊","普通攻擊必定暴擊","普通攻擊必定暴擊.(包括治療武將)","普通攻擊必定暴擊","去穿戴",7,"999",},
        [34] = {1303,"周瑜錦囊","灼燒持續回合數增加","主動造成的灼燒狀態額外延長1回合.","灼燒狀態額外增加1回合","去穿戴",7,"303|305|311|319|313",},
        [35] = {1304,"左慈錦囊","中毒附加封療效果","中毒附加封療效果, 中毒狀態的武將無法受到治療.","中毒附加封療效果","去穿戴",7,"410|407",},
        [36] = {1308,"曹操錦囊","清除敵方武將無敵效果","攻擊目標越少, 清除敵方武將無敵狀態概率越高, 最多對1個目標提高100%的清除無敵概率.","清除敵方武將無敵效果","去穿戴",7,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",},
        [37] = {1302,"神·曹仁錦囊","攻擊縱排目標降低1點怒氣","攻擊縱排目標時, 額外降低目標1點怒氣.(只對當前有縱排減怒效果的武將生效)","攻擊縱排目標降低其1點怒氣","去穿戴",7,"106|210|406",},
        [38] = {1309,"神·陸遜錦囊","被灼燒武將封無敵","被灼燒的武將無法獲得無敵和無敵吸血盾效果.","被灼燒的武將無法獲得無敵效果","去穿戴",7,"303|305|311|319|313",},
        [39] = {1310,"神·黃月英錦囊","首回合免疫控制","首回合免疫暈眩, 沉默, 麻痹效果.","首回合免疫暈眩, 沉默, 麻痹效果","去穿戴",7,"999",},
        [40] = {1311,"神·華佗錦囊","技能傷害轉化為治療","技能傷害的18%轉化為血量, 治療自己.","技能傷害轉化為血量治療自己","去穿戴",7,"1|2|3|4|5|11|12|13|14|15|101|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|150|201|203|204|205|206|207|208|209|210|211|212|213|214|215|217|218|219|250|301|303|304|305|306|307|308|309|310|311|312|313|314|315|316|317|318|319|350|401|403|404|405|406|407|408|409|410|411|412|413|414|415|416|417|418|419|450",},
        [41] = {1312,"司馬懿錦囊","消耗所有怒氣增加技能傷害","武將怒氣小於7點時, 不會釋放技能；釋放技能消耗當前所有怒氣, 超過4點怒氣部分, 每額外消耗1點怒氣, 技能傷害增加15%.","消耗所有怒氣增加技能傷害","去穿戴",7,"999",},
        [42] = {1305,"神·賈詡錦囊","中毒持續回合數增加","技能造成的中毒狀態延長1回合.","中毒狀態額外增加1回合","去穿戴",7,"410|407",},
        [43] = {1313,"神·荀彧錦囊","釋放技能治療提升","治療武將釋放技能時, 對己方血量最少的3個武將治療效果額外提升治療武將攻擊的32%.","釋放技能治療提升","去穿戴",7,"102|202|302|402|216",},
        [44] = {1314,"桃園結義錦囊","分攤受到的傷害","受到的傷害降低12%, 並且將自身受到的非致命傷害平分給自身及己方當前血量最高的2名武將.(被分攤傷害時處於無敵狀態的武將, 也會受到傷害)","分攤受到的傷害","去穿戴",7,"999",},
        [45] = {1315,"神·太史慈錦囊","灼燒概率大幅提升","攻擊目標越少, 灼燒概率提升越高, 最多對1個目標提高96%的灼燒概率.","灼燒概率大幅提升","去穿戴",7,"303|305|311|319|313",},
        [46] = {1316,"青青子衿錦囊","回合結束回復悠悠我心1點怒氣","該武將每回合首次出手後, 佩戴悠悠我心錦囊的武將可額外獲得1點怒氣.(每套陣容限定1名男性武將佩戴)","回合結束回復悠悠我心1點怒氣","去穿戴",21,"998",},
        [47] = {1317,"悠悠我心錦囊","回合結束回復青青子衿1點怒氣","該武將每回合首次出手後, 佩戴青青子衿錦囊的武將可額外獲得1點怒氣.(每套陣容限定1名女性武將佩戴)","回合結束回復青青子衿1點怒氣","去穿戴",21,"997",},
        [48] = {1318,"千里走單騎錦囊","攻擊敵方當前血量最少武將","單體輸出武將的所有攻擊優先攻擊敵方當前血量最低的武將.","攻擊敵方當前血量最少武將","去穿戴",21,"205|213|308|310|316|413",},
        [49] = {1319,"一騎當千錦囊","擊殺目標追加1次技能","單體輸出武將擊殺目標後, 追加1次技能, 對敵方單體造成175%物理傷害.(追加的技能不消耗怒氣, 不觸發任何特性)","擊殺目標追加1次技能","去穿戴",21,"205|213|308|310|316|413",},
        [50] = {1401,"七殺錦囊","造成的傷害被分攤比例下降","我方縱排, 前排, 後排輸出武將對敵方造成的傷害如果被分攤, 其分攤的比例降低50%","我方縱排, 前排, 後排輸出武將對敵方造成的傷害如果被分攤, 其分攤的比例降低50%","去穿戴",21,"107|108|109|113|114|201|206|208|209|217|218|250|301|306|318|406|407|414|416",},
        [51] = {1402,"貪狼錦囊","擊殺目標獲得怒氣","技能直接擊殺敵方目標時, 獲得目標剩餘的所有怒氣(輸出武將佩戴)","擊殺敵方目標時, 獲得目標剩餘的所有怒氣(輸出武將佩戴)","去穿戴",21,"101|107|108|109|111|113|114|150|201|205|206|208|209|217|218|250|301|306|308|310|316|318|350|403|406|407|410|413|414|416|450",},
        [52] = {1403,"傳說·關羽錦囊","初始怒氣增加2點","初始怒氣增加2點","初始怒氣增加2點","去穿戴",21,"999",},
        [53] = {1404,"破釜沉舟錦囊","每回合受到的傷害有上限","每回合最多受到自身生命值上限50%的傷害(該傷害為來自於武將的直接傷害)","每回合受到的傷害有上限","去穿戴",21,"105|119|207|215|309|314|405|418",},
        [54] = {1405,"同舟共濟錦囊","吸收同陣營友方武將的傷害","同陣營的武將受到敵方武將直接傷害時, 該傷害的50%會轉移給佩戴此錦囊的武將(無法觸發任何特性, 無法被無敵免疫)","吸收同陣營友方武將的傷害","去穿戴",21,"105|119|207|215|309|314|405|418",},
    }
}

return silkbag