--story_general_plan

local story_general_plan = {
    -- key
    __key_map = {
      id = 1,    --锦囊关id_key-int 
      name = 2,    --锦囊名称-繁体-string 
      des = 3,    --帐篷事件描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"名將挑戰","董卓, 字仲穎, 東漢末年涼州軍閥, 後入洛陽成為權臣, 官至太師, 權傾朝野.其人體魄健壯, 臂力過人, 善騎射, 愛喝酒, 愛吃肉, 更愛美人兒, 後因殘暴不仁濫殺無辜, 死於貂蟬的美人計之下, 被呂布斬殺.",},
        [2] = {2,"名將挑戰","孫策, 字伯符, 被稱江東小霸王, 東吳的奠基者之一.年少時容貌俊美, 性格闊達, 聲名遠播, 後與周瑜結拜.為繼承孫堅遺業而屈事袁術, 袁術僭越稱帝后, 孫策與袁術決裂, 統一江東.",},
        [3] = {3,"名將挑戰","趙雲, 字子龍, 蜀漢五虎上將之一.身長八尺, 姿顏雄偉, 曾在長阪坡七進七出百萬曹軍, 救出劉備的兒子阿斗, 先主雲: 子龍一身都是膽也.",},
        [4] = {4,"名將挑戰","張飛, 字益德, 蜀漢五虎上將之一, 與劉備, 關羽是桃園結義的兄弟, 以勇猛非凡, 性如烈火, 嫉惡如仇而著稱, 曾在長阪坡當陽橋一聲怒吼, 嚇退十萬曹軍.",},
        [5] = {5,"名將挑戰","周瑜, 字公瑾, 東吳名將, 大都督.因其容貌英俊而有周郎之稱, 精通音律, 故有[曲有誤, 周郎顧]之語.與孫策交好, 助孫策平定江東, 後孫策遇刺身亡, 又助孫權統領江東.208年, 周瑜率軍與劉備聯合, 於赤壁之戰中大敗曹軍, 由此奠定了三分天下的基礎.被後世譽為[世間豪傑英雄士, 江左風流美丈夫].",},
        [6] = {6,"名將挑戰","諸葛亮, 字孔明, 號臥龍, 蜀漢丞相.早年在隆中耕種, 後劉備三顧茅廬請出, 輔佐劉備建立蜀漢.曾舌戰群儒促成吳蜀聯盟, 空城計嚇退司馬懿, 一生為蜀漢事業鞠躬盡瘁, 死而後已, 是忠臣與智者的代表人物.其代表作有出師表誡子書等, 曾發明木牛流馬, 孔明燈, 諸葛連弩等.",},
        [7] = {7,"名將挑戰","曹操, 字孟德, 小名阿瞞, 漢末軍閥, 一代奸雄, 是魏國實際的奠基人, 不僅長於軍略, 也通音律, 善詞賦, 爵至魏王, 其子曹丕建魏後, 追諡武帝, 即魏武帝.",},
        [8] = {8,"名將挑戰","左慈, 字元放, 東漢末年知名道士, 精通五經, 占星, 奇門遁甲, 傳說能役使鬼神, 以方術名聞當世, 一手建立丹鼎派.左慈曾戲耍曹操與孫策, 後進山煉丹, 得道乘鶴而去.",},
        [9] = {9,"名將挑戰","呂布, 字奉先, 三國第一猛將.手持方天畫戟, 騎赤兔馬, 頭戴金冠, 器宇軒昂, 威風凜凜.關羽, 張飛, 劉備三人圍攻他, 也未能將其戰倒, 戰神之名當之無愧!",},
        [10] = {10,"名將挑戰","貂蟬, 中國古代四大美女之一, 王允義女, 呂布之妻.有絕世之顏, 閉月之貌, 傾國傾城.為了報答義父王允的養育之恩, 而甘願獻身完成刺殺董卓的連環計.",},
        [11] = {11,"名將挑戰","張遼, 字文遠, 呂布武將, 後仕曹操, 曹魏五子良將之一, 曾陣斬蹋頓, 擊破烏桓.建安二十一年, 東吳大軍進圍合肥, 張遼領數千精兵大破十萬吳軍, 幾乎活捉孫權, 小兒止啼的著名典故即由此而來.",},
        [12] = {12,"名將挑戰","孫堅, 字文台, 東吳霸業的奠基人, 被譽為江東烈虎.其人容貌不凡, 豪爽闊達, 擅使大刀, 喜戴紅頭巾, 曾參與討伐黃巾軍的戰役以及討伐董卓的戰役.",},
        [13] = {13,"名將挑戰","大喬, 孫策之妻, 三國知名美人, 與其妹小喬並稱江東二喬.通音律, 曉詩文, 肌膚勝雪, 眉目如畫, 淺笑盈盈, 十分動人.",},
        [14] = {14,"名將挑戰","典韋, 曹操武將, 身材魁梧, 力大無窮, 能驅趕猛虎.擅使大雙戟, 張繡叛變時, 為保護曹操力戰而死.",},
        [15] = {15,"名將挑戰","小喬, 周瑜之妻, 三國知名美人, 與其姐大喬並稱江東二喬.神采飛揚, 靈氣逼人, 天真爛漫, 銀鈴般的聲音, 嬌俏活潑, 聽著不自禁的讓人喜歡.",},
        [16] = {16,"名將挑戰","樂進, 字文謙, 曹魏五子良將之一.以膽識英烈而從曹操, 隨軍多年, 南征北討, 戰功無數.建安二十三年逝世, 諡曰威侯.",},
        [17] = {17,"名將挑戰","呂靈雎, 相傳為呂布與貂蟬之女, 美貌不亞於貂蟬, 武藝不亞于父親, 威風凜凜而寂寥, 勇敢而身先士卒.雖然有著能夠直面困難的堅強意志, 卻由於過去的經歷而有著非常害怕孤獨的一面.",},
        [18] = {18,"名將挑戰","甘寧, 字興霸, 東吳猛將.少年時好遊俠, 頭插鳥羽, 身佩鈴鐺, 披服錦繡, 四處遊蕩搶奪船隻財物, 人稱錦帆賊.青年時停止搶劫, 熟讀諸子, 曆仕于劉表和黃祖, 後率部投奔孫權, 開始建功立業.曾率百餘人夜襲曹營, 戰功赫赫.孫權曾說: 孟德有張遼, 孤有甘興霸, 足相敵也.",},
        [19] = {19,"名將挑戰","曹仁, 字子孝, 三國時期曹魏名將, 曹魏八虎騎之一, 治軍嚴謹, 擅長防守.跟隨曹操征戰多年, 功勳卓著, 官至大司馬.",},
        [20] = {20,"名將挑戰","周泰, 字幼平, 東吳重要武將.多次於戰亂當中保護孫權的安危, 身上受的傷多達幾十處, 就像在皮膚上雕畫一樣.孫權為了表彰周泰出生入死的功績, 賜給他青羅傘蓋.",},
        [21] = {21,"名將挑戰","甄姬, 三國知名美女, 別稱甄洛或甄宓[fú] , 文昭甄皇后.傾國傾城, 風華絕代, 本是魏文帝曹丕的正室妻子, 但傳說與曹植相愛, 相傳洛神賦即曹植為她所作, 成就洛神的千古佳話.",},
        [22] = {22,"名將挑戰","黃月英, 諸葛亮之妻, 荊州名士黃承彥之女.相傳其美麗無雙, 卻靦腆害羞, 因此用斗笠輕紗蒙面.她家學淵源, 才智無雙, 與諸葛一起發明了木牛流馬, 為世人津津樂道.",},
        [23] = {23,"名將挑戰","關平, 蜀漢將領, 關羽之子, 隨關羽東征西討, 武勇過人, 不遜乃父, 曾跟隨劉備出征西川, 立下戰功, 後來又與曹魏猛將龐德大戰三十回合, 彼此不分勝負.",},
        [24] = {24,"名將挑戰","韓當, 字義公, 東吳將領.長於弓箭, 騎術並且膂力過人, 曆仕孫堅, 孫策, 孫權三代, 功勳卓著, 對江東基業的逐漸穩固和吳國的建立有著重要影響.",},
        [25] = {25,"名將挑戰","呂蒙, 字子明, 東吳名將, 曾任大都督.十五歲時就從軍打仗, 能征慣戰, 但讀書甚少, 後來孫權勸他學習, 才開始發憤勤學, 魯肅來到尋陽與呂蒙研討議事, 十分驚奇他的進步.後以士別三日刮目相看, 吳下阿蒙等稱譽別人進步很大.呂蒙最出名的功績是襲取荊州, 擊敗蜀漢名將關羽, 留下白衣渡江典故.",},
        [26] = {26,"名將挑戰","陸遜, 字伯言, 東吳大將, 歷任吳國大都督, 上大將軍, 丞相, 在夷陵擊敗劉備所率蜀漢軍, 一戰成名.陸遜深得孫權器重, 深謀遠慮, 忠誠耿直, 一生出將入相, 被贊為社稷之臣.玩家喜稱周瑜為大都督, 陸遜為小都督.",},
        [27] = {27,"名將挑戰","司馬懿, 字仲達, 少有奇節, 聰明多大略, 博學洽聞, 伏膺儒教.魏國政治家, 軍事謀略家, 魏國權臣, 西晉王朝的奠基人.",},
        [28] = {28,"名將挑戰","關羽, 字雲長, 五虎上將之首.義薄雲天, 忠貞不移, 英勇驍戰, 留有溫酒斬華雄, 刮骨療傷等佳話.",},
        [29] = {29,"名將挑戰","夏侯惇, 字元讓, 曹魏名將, 性如烈火的獨目將軍.為曹家征戰一生, 為人清儉, 所得賞賜全部分給將士, 一生不置產業, 至死家無餘財.",},
        [30] = {30,"名將挑戰","孫堅, 字文台, 軍事家孫武的後裔, 東漢末年將領, 軍閥, 三國中吳國的奠基人.勇摯剛毅, 容貌不凡, 性闊達, 好奇節, 乃江東猛虎.",},
        [31] = {31,"名將挑戰","曹丕, 字子桓, 曹操次子, 著名的政治家, 文學家, 曹魏開國皇帝.自幼文武雙全, 博覽經傳, 通曉諸子百家學說.",},
        [32] = {32,"名將挑戰","徐庶, 字元直, 原劉備帳下謀士, 促成臥龍出山, 後歸曹操, 並仕于曹魏, 但一生並無大建樹.留有身在曹營心在漢的典故.",},
        [33] = {33,"名將挑戰","孫權, 字仲謀, 孫堅之子, 孫吳的建立者.于赤壁之戰中擊敗曹操, 奠定三國鼎立的基礎.形貌奇偉, 骨體不恒, 有大貴之表, 古有生子當如孫仲謀之言.",},
        [34] = {34,"名將挑戰","賈詡, 字文和, 涼州人, 三國著名謀士.原為董卓部將, 董卓死後, 因獻計導致李傕郭汜反攻長安, 被稱為毒士.之後, 賈詡輾轉成為張繡的謀士, 後降曹操, 成為曹魏重要謀臣.",},
        [35] = {35,"名將挑戰","郭嘉, 字奉孝, 魏國早期最傑出的謀士, 曹魏五謀臣之一.官至軍師祭酒.才智過人, 奇計百出, 曹操稱他為[奇佐], 但英年早逝, 曹操深為痛惜.",},
        [36] = {36,"名將挑戰","龐統, 字士元, 號鳳雛, 劉備重要謀士, 才智與諸葛亮齊名, 赤壁之戰, 他避亂江東, 為魯肅薦于周瑜, 併入曹營獻連環計, 助瑜火攻大敗曹操.",},
        [37] = {37,"名將挑戰","孫尚香, 孫權之妹, 赤壁之戰嫁給劉備為妻.她容貌秀麗, 才智敏捷, 桀驁不馴, 巾幗不讓鬚眉.",},
        [38] = {38,"名將挑戰","張角, 東漢末年黃巾軍的領袖, 太平道的創始人, 教徒多達幾十萬.184年, 張角以蒼天已死, 黃天當立, 歲在甲子, 天下大吉為口號, 自稱天公將軍, 率領群眾發動起義, 史稱黃巾起義.",},
        [39] = {39,"名將挑戰","張郃[hé], 字儁乂[jùn yì], 曹魏五子良將之一.曾仕袁紹, 官渡之戰中投效曹操, 張郃戎馬一生, 以用兵巧變, 善列營陣, 長於利用地形著稱, 跟隨曹操後屢建戰功.",},
        [40] = {40,"名將挑戰","孟獲, 南蠻王, 三國時期南中地區少數民族首領, 被諸葛亮率領大軍七擒七縱後降服, 此後不再叛亂.他不但作戰勇敢, 意志堅強, 而且待人忠厚, 在當地極得人心.",},
    }
}

return story_general_plan