--territory_performance

local territory_performance = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --城池名称-繁体-string 
      hero_name = 3,    --守关武将名字-繁体-string 
      directions = 4,    --城池描述-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"徐州","太史慈","    徐州作為華東的門戶城市, 此處環境優美, 人傑地靈, 其酒文化文明天下, 文人雅士常愛在此飲酒作樂, 經過歷代先人苦心釀造研製, 此地盛產杜康.",},
        [2] = {2,"豫州","張昭","    豫州是華夏文明的發源地, 長期位於中國的政治經濟和文化中心, 孕育出了大批軍事人才, 此處盛產武將經驗道具, 將魂等.",},
        [3] = {3,"荊州","劉表","    荊州其城名因地處荊山之南而得, 此處人傑地靈, 出過很多名將怪才, 因此地盛產突破丹, 同時也是兵家必爭之地.",},
        [4] = {4,"青州","曹仁","  東方屬木, 木色為青, 故名青州.此地礦產資源豐富, 鑄鐵工藝發達, 盛產各種裝備精煉石, 精鐵等.",},
        [5] = {5,"幽州","劉備","  春秋元命包雲: 箕星散為幽州, 分為燕國.言北方太陰, 故以幽冥為號.幽州是古九州及漢十三刺史部之一；此地盛產經驗寶物, 寶物精煉石等寶物養成資源.",},
        [6] = {6,"兗州","曹操","    兗州的這個兗字, 來源於兗水.兗水又稱濟水, 兗字有端信的含義, 孔子, 孟子等均曾在此講學, 此處盛產神兵進階石.",},
    }
}

return territory_performance