--time_limit_activity

local time_limit_activity = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      name = 2,    --限时活动名称-繁体-string 
      start_des = 3,    --开启描述-繁体-string 
      description = 4,    --活动描述-繁体-string 
      is_work = 5,    --生效-int 
    
    },
    -- data
    _data = {
        [1] = {1,"軍團BOSS","每日","軍團BOSS每天12點, 19點開啟；軍團參與人數越多, 拍賣獎勵越多；參與活動均可獲得軍團拍賣分紅.",1,},
        [2] = {2,"軍團答題","每日","軍團答題每天18點開啟；軍團參與人數越多, 拍賣獎勵越多；參與活動的玩家均可獲得軍團拍賣分紅.",1,},
        [3] = {3,"軍團試煉","每日","軍團試煉每天18點10分至18點40分開啟；軍團試煉積分越多, 拍賣獎勵越多；參與活動均可獲得軍團拍賣分紅.",1,},
        [4] = {4,"三國戰紀","每週三, 五, 日","縱橫亂世間, 霸氣沖雲天.三國名將, 戰!戰!戰!每週三, 五, 日的21點準時開啟, 等你來戰!!!",1,},
        [5] = {5,"陣營競技","每週一, 四","陣營競技每週一, 四4點開始報名, 21點準時開戰；報名人數越多, 拍賣獎勵越多；所有報名玩家都可獲得陣營競技拍賣分紅.",1,},
        [6] = {6,"華容道","每日","華容道每天10點, 14點, 16點, 22點各開啟2場, 一天共開啟8場, 可前去支持參賽的武將, 支持武將跑第一可以獲得獎勵!",1,},
        [7] = {7,"軍團戰","每週二, 六","中原風雨來, 三國豪傑聚；沙場秋點兵, 豪氣沖天起.\n每週二, 六21點準時開啟軍團戰.來, 戰個痛快!",1,},
        [8] = {8,"王者之戰","每天","無差別公平競技, 無視戰力, 只比戰術!\n每天11-14點和19-22點, 一起來戰!",1,},
        [9] = {9,"先秦皇陵","每天","每天10-22點, 組隊闖皇陵, 有機會獲得春秋戰國!",1,},
        [10] = {10,"陣營競技","每週一","陣營競技每週一4點開始報名, 21點準時開戰；報名人數越多, 拍賣獎勵越多；所有報名玩家都可獲得陣營競技, 週四跨服個人競技拍賣分紅.",1,},
        [11] = {11,"跨服軍團戰","每週六","週二21點開啟軍團戰, 週六21點開啟跨服軍團戰\n佔領虎牢關, 函穀關, 劍閣, 逍遙津的軍團可參加跨服軍團戰\n其他軍團仍然參加本服軍團戰.",0,},
        [12] = {12,"跨服個人競技","每週四","同組8個伺服器均開服30天, 每週四開啟跨服個人競技；陣營競技報名人數越多, 拍賣獎勵越多, 報名玩家都可獲得跨服個人競技拍賣分紅.",1,},
        [13] = {13,"軍團答題","每週二, 四, 六","軍團答題週二, 四, 六18點開啟；軍團參與人數越多, 拍賣獎勵越多；參與活動的玩家均可獲得軍團拍賣分紅.",1,},
        [14] = {14,"全服答題","每週一, 三, 五, 日","全服答題每週一, 三, 五, 日18點開啟；軍團參與人數越多, 拍賣獎勵越多；參與活動的玩家均可獲得軍團拍賣分紅.",1,},
    }
}

return time_limit_activity