--title

local title = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --名称-string 
      des = 3,    --条件描述-string 
      description = 4,    --详情描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"為遊戲打Call","累計登入達到99天","累計登入達到99天",},
        [2] = {2,"最後億次","在華容道累計猜對99次獲勝玩家","在華容道累計猜對99次獲勝玩家",},
        [3] = {3,"開不開心","在黃金寶箱中獲得任意1件紅色裝備","在黃金寶箱中獲得任意1件紅色裝備",},
        [4] = {4,"驚不驚喜","在臥龍觀星活動中直接獲得任意1只神獸","在臥龍觀星活動中直接獲得任意1只橙色神獸",},
        [5] = {5,"意不意外","在割須棄袍活動中直接獲得任意1件紅裝","在割須棄袍活動中直接獲得任意1件紅裝",},
        [6] = {6,"刺不刺激","在身外化身活動中直接獲得1枚三清化形羽","在身外化身活動中直接獲得1枚三清化形羽",},
        [7] = {7,"還有誰?","在每日競技場結算時排名競技場第1","在每日競技場結算時排名競技場第1",},
        [8] = {8,"我全都要","擁有所有武將(不包括橙升紅武將)","擁有所有武將(不包括橙升紅武將)",},
        [9] = {9,"十大戰力","每日戰力排行榜前10","每日戰力排行榜前10",},
        [10] = {10,"來呀, 快活呀","在礦戰被擊殺999次","在礦戰被擊殺999次",},
        [11] = {11,"魏國霸主","陣營競技魏國冠軍","陣營競技魏國冠軍",},
        [12] = {12,"蜀國霸主","陣營競技蜀國冠軍","陣營競技蜀國冠軍",},
        [13] = {13,"吳國霸主","陣營競技吳國冠軍","陣營競技吳國冠軍",},
        [14] = {14,"群雄霸主","陣營競技群雄冠軍","陣營競技群雄冠軍",},
        [15] = {15,"狗托","在身外化身活動中直接獲得1枚驚鴻化形羽","在身外化身活動中直接獲得1枚驚鴻化形羽",},
        [16] = {16,"先定一個小目標","擁有全部橙色變身卡","擁有全部橙色變身卡",},
        [17] = {17,"C位出道","跨服個人競技4強","每週4跨服個人競技4強",},
        [18] = {18,"同九年汝何秀","累計在礦戰中擊殺999個玩家","累計在礦戰中擊殺999個玩家",},
        [19] = {19,"一人之下","王者之戰賽季結算時在排行榜排名第2-10","王者之戰賽季結算時在排行榜排名第2-10",},
        [20] = {20,"天下無雙","每週4跨服個人競技冠軍","每週4跨服個人競技冠軍",},
        [21] = {21,"不是我針對誰","王者之戰賽季結算時在排行榜排名第1","王者之戰賽季結算時在排行榜排名第1",},
        [22] = {22,"家裡有礦","擁有全部紅色變身卡","擁有所有紅色變身卡",},
        [23] = {23,"新手指導員","遊戲官方新手指導員","遊戲官方新手指導員",},
        [24] = {24,"志在四方","桌遊志100期紀念專屬限定稱號","桌遊志100期紀念專屬限定稱號",},
        [25] = {25,"大風起兮雲飛揚","慶典活動專屬限定稱號, 有效期30天","慶典活動專屬限定稱號, 有效期30天",},
        [26] = {26,"氣吞山河","慶典活動專屬限定稱號, 有效期30天","慶典活動專屬限定稱號, 有效期30天",},
        [27] = {27,"扶搖直上九萬里","慶典活動專屬限定稱號, 有效期30天","慶典活動專屬限定稱號, 有效期30天",},
        [28] = {28,"風雲際會","見龍在田活動專屬稱號","見龍在田活動專屬稱號",},
        [29] = {29,"龍尋隱蹤","見龍在田活動專屬稱號","見龍在田活動專屬稱號",},
        [30] = {30,"眾裡尋他千百度","見龍在田活動專屬稱號","見龍在田活動專屬稱號",},
        [31] = {1001,"新年2020","2020新年活動期間, 登入1天","2020新年活動期間, 登入1天",},
        [32] = {1002,"如意","2020新年活動期間, 達到20級以上","2020新年活動期間, 達到20級以上",},
        [33] = {1003,"新春快樂","2020新年活動期間, 達到40級以上","2020新年活動期間, 達到40級以上",},
        [34] = {1004,"新年發財","2020新年活動期間, 隨機儲值任意金額","2020新年活動期間, 隨機儲值任意金額",},
        [35] = {1005,"大富大貴","2020新年活動期間, 活動期間, 累儲5000W元寶","2020新年活動期間, 活動期間, 累儲5000W元寶",},
        [36] = {8023,"社團之星","運營活動獲得","運營活動獲得",},
        [37] = {8024,"魏國之光","運營活動獲得","運營活動獲得",},
        [38] = {8025,"蜀國之光","運營活動獲得","運營活動獲得",},
        [39] = {8026,"吳國之光","運營活動獲得","運營活動獲得",},
        [40] = {8027,"群雄之光","運營活動獲得","運營活動獲得",},
        [41] = {8028,"金色傳說","運營活動獲得","運營活動獲得",},
        [42] = {8029,"天才小畫師","運營活動獲得","運營活動獲得",},
    }
}

return title