--tree_info

local tree_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --主树名称-繁体-string 
      up_text = 3,    --升级提示文本-繁体-string 
      up_text_1 = 4,    --升级界面提示文本-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"神樹","露壇","本次突破解鎖新的裝飾: 露壇",},
        [2] = {2,"神樹","赤靈芝","本次突破解鎖新的裝飾: 赤靈芝",},
        [3] = {3,"神樹","翠竹林","本次突破解鎖新的裝飾: 翠竹林",},
        [4] = {4,"神樹","九天瑤池","本次突破解鎖新的裝飾: 九天瑤池",},
        [5] = {5,"神樹","玲瓏玉玦","本次突破解鎖新的裝飾: 玲瓏玉玦",},
        [6] = {6,"神樹","九華燈","本次突破解鎖新的裝飾: 九華燈",},
        [7] = {7,"神樹","","",},
        [8] = {8,"神樹","","",},
        [9] = {9,"神樹","","",},
        [10] = {10,"神樹","","",},
        [11] = {11,"神樹","","",},
    }
}

return tree_info