--type_manage

local type_manage = {
    -- key
    __key_map = {
      id = 1,    --资源类型编号_key-int 
      name = 2,    --名称-繁体-string 
    
    },
    -- data
    _data = {
        [1] = {1,"武將",},
        [2] = {2,"裝備",},
        [3] = {3,"寶物",},
        [4] = {4,"神兵",},
        [5] = {5,"資源",},
        [6] = {6,"道具",},
        [7] = {7,"碎片",},
        [8] = {8,"寶石",},
        [9] = {9,"變身卡",},
        [10] = {10,"神獸",},
        [11] = {11,"錦囊",},
        [12] = {12,"戰馬",},
        [13] = {13,"歷代名將",},
        [14] = {14,"歷代名將武器",},
        [15] = {15,"戰馬裝備",},
        [16] = {16,"玉石",},
        [17] = {17,"頭像框",},
        [18] = {18,"稱號",},
    }
}

return type_manage