--update_redpacket

local update_redpacket = {
    -- key
    __key_map = {
      id = 1,    --红包id_key-int 
      name = 2,    --红包名称-string 
    
    },
    -- data
    _data = {
        [1] = {99,"狂歡大紅包",},
        [2] = {1,"紅色整將一口價",},
        [3] = {2,"紅將碎片一口價",},
        [4] = {3,"紅色神兵一口價",},
        [5] = {4,"紅色萬能神兵一口價",},
        [6] = {5,"春秋一口價",},
        [7] = {6,"戰國一口價",},
        [8] = {7,"紅錦囊一口價",},
        [9] = {8,"橙錦囊一口價",},
        [10] = {9,"擇賢令一口價",},
        [11] = {10,"擇賢舉善令一口價",},
    }
}

return update_redpacket