--guild_boss_info

local guild_boss_info = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      city_name = 2,    --城池名称-简中-string 
      name = 3,    --名称-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"兖州","华雄",},
        [2] = {2,"徐州","公孙瓒",},
        [3] = {3,"西城","庞统",},
        [4] = {4,"街亭","徐庶",},
        [5] = {5,"夏口","甘宁",},
        [6] = {6,"三江口","吕蒙",},
        [7] = {7,"仓亭","曹仁",},
        [8] = {8,"乌巢","张郃",},
        [9] = {9,"","魏武帝曹操",},
        [10] = {10,"","卧龙诸葛亮",},
        [11] = {11,"","大都督周瑜",},
        [12] = {12,"","战神吕布",},
    }
}

return guild_boss_info