--act_week_discount

local act_week_discount = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --礼包名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Thể Lực Đơn",},
        [2] = {2,"Tinh Lực Đơn",},
        [3] = {3,"Đột Phá Đơn",},
        [4] = {4,"Hồn Bảo Vật",},
        [5] = {5,"Đỗ Khang 10 Năm",},
        [6] = {6,"Tướng Hồn",},
        [7] = {7,"Đá Luyện-Cao",},
        [8] = {8,"Đá Thần Binh",},
        [9] = {9,"Thần Binh Cam",},
        [10] = {10,"Kim Nghiên Đài",},
        [11] = {11,"Đá Luyện-Bảo",},
        [12] = {12,"Thể Lực Đơn",},
        [13] = {13,"Tinh Lực Đơn",},
        [14] = {14,"Đột Phá Đơn",},
        [15] = {15,"Hồn Bảo Vật",},
        [16] = {16,"Đỗ Khang 10 Năm",},
        [17] = {17,"Tướng Hồn",},
        [18] = {18,"Đá Luyện-Cao",},
        [19] = {19,"Đá Thần Binh",},
        [20] = {20,"Thần Binh Cam",},
        [21] = {21,"Đá Luyện-Bảo",},
        [22] = {22,"Đá Luyện-Cao",},
        [23] = {23,"Đá Luyện-Cao",},
        [24] = {24,"Thần Binh Cam",},
        [25] = {25,"Thần Binh Đỏ",},
        [26] = {26,"Ngọc Nghiên Đài",},
        [27] = {27,"Thần Binh Cam",},
        [28] = {28,"Thần Binh Đỏ",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [25] = 25,
        [26] = 26,
        [27] = 27,
        [28] = 28,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return act_week_discount