--act_level_discount

local act_level_discount = {
    -- key
    __key_map = {
      id = 1,    --编号-int 
      name = 2,    --物品名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Rương Tướng Tím-Chọn",},
        [2] = {2,"Bảo Vật Cam-Chọn",},
        [3] = {3,"Đá Luyện-Cao",},
        [4] = {4,"Đá Luyện-Cao",},
        [5] = {5,"Đá Thần Binh",},
        [6] = {6,"T.Binh Cam-Chọn",},
        [7] = {7,"Thần Binh Cam",},
        [8] = {8,"Đá Luyện-Bảo",},
        [9] = {9,"Binh Thư Cam",},
        [10] = {10,"Binh Phù Cam",},
        [11] = {11,"Cẩm Nang Ngân Bình",},
        [12] = {12,"Cẩm Nang Tinh Thái",},
        [13] = {13,"Cẩm Nang Quan Vũ",},
        [14] = {14,"Trí Hoán Phù",},
        [15] = {15,"Đá Thanh Long",},
        [16] = {16,"Đá Bạch Hổ",},
        [17] = {17,"Xuân Thu",},
        [18] = {18,"Chiến Quốc",},
        [19] = {19,"Lễ Ký",},
        [20] = {20,"Chu Dịch",},
        [21] = {21,"Đá Chu Tước",},
        [22] = {22,"Đá Huyền Vũ",},
        [23] = {23,"Xuân Thu",},
        [24] = {24,"Chiến Quốc",},
        [25] = {25,"Lễ Ký",},
        [26] = {26,"Chu Dịch",},
        [27] = {27,"Đá Thanh Long",},
        [28] = {28,"Đá Bạch Hổ",},
        [29] = {29,"Xuân Thu",},
        [30] = {30,"Chiến Quốc",},
        [31] = {31,"Lễ Ký",},
        [32] = {32,"Chu Dịch",},
        [33] = {33,"Tam Thanh Vũ ",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [20] = 20,
        [21] = 21,
        [22] = 22,
        [23] = 23,
        [24] = 24,
        [25] = 25,
        [26] = 26,
        [27] = 27,
        [28] = 28,
        [29] = 29,
        [3] = 3,
        [30] = 30,
        [31] = 31,
        [32] = 32,
        [33] = 33,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return act_level_discount