--hero_limit_size

local hero_limit_size = {
    -- key
    __key_map = {
      id = 1,    --武将id-int 
      name = 2,    --武将名称-string 
    
    },
    -- data
    _data = {
        [1] = {111,"Tào Phi",},
        [2] = {111,"Tào Phi",},
        [3] = {111,"Tào Phi",},
        [4] = {111,"Tào Phi",},
        [5] = {205,"Quan Vũ",},
        [6] = {205,"Quan Vũ",},
        [7] = {205,"Quan Vũ",},
        [8] = {205,"Quan Vũ",},
        [9] = {308,"Cam Ninh",},
        [10] = {308,"Cam Ninh",},
        [11] = {308,"Cam Ninh",},
        [12] = {308,"Cam Ninh",},
        [13] = {411,"Viên Thiệu",},
        [14] = {411,"Viên Thiệu",},
        [15] = {411,"Viên Thiệu",},
        [16] = {411,"Viên Thiệu",},
    },

    -- index
    __index_id_limit_level = {
        ["111_0"] = 1,
        ["111_1"] = 2,
        ["111_2"] = 3,
        ["111_3"] = 4,
        ["205_0"] = 5,
        ["205_1"] = 6,
        ["205_2"] = 7,
        ["205_3"] = 8,
        ["308_0"] = 9,
        ["308_1"] = 10,
        ["308_2"] = 11,
        ["308_3"] = 12,
        ["411_0"] = 13,
        ["411_1"] = 14,
        ["411_2"] = 15,
        ["411_3"] = 16,
    }
}

return hero_limit_size