--type_manage

local type_manage = {
    -- key
    __key_map = {
      id = 1,    --资源类型编号-int 
      name = 2,    --名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Võ Tướng",},
        [2] = {2,"Trang Bị",},
        [3] = {3,"Bảo Vật",},
        [4] = {4,"Thần Binh",},
        [5] = {5,"Tài Nguyên",},
        [6] = {6,"Đạo Cụ",},
        [7] = {7,"Mảnh",},
        [8] = {8,"Đá",},
        [9] = {9,"Thẻ Biến Hình",},
        [10] = {10,"Thần Thú",},
        [11] = {11,"Cẩm Nang",},
        [12] = {12,"Chiến Mã",},
        [13] = {13,"Danh Tướng",},
        [14] = {14,"Vũ Khí Danh Tướng",},
        [15] = {15,"Trang Bị Chiến Mã",},
        [16] = {16,"Đá Ngọc",},
        [17] = {17,"Khung Avatar",},
        [18] = {18,"Danh Hiệu",},
        [19] = {19,"Cờ Quân Đoàn",},
        [20] = {25,"Chiến Pháp",},
    },

    -- index
    __index_id = {
        [1] = 1,
        [10] = 10,
        [11] = 11,
        [12] = 12,
        [13] = 13,
        [14] = 14,
        [15] = 15,
        [16] = 16,
        [17] = 17,
        [18] = 18,
        [19] = 19,
        [2] = 2,
        [25] = 20,
        [3] = 3,
        [4] = 4,
        [5] = 5,
        [6] = 6,
        [7] = 7,
        [8] = 8,
        [9] = 9,
    }
}

return type_manage