--equip_essence_stage

local equip_essence_stage = {
    -- key
    __key_map = {
      id = 1,    --关卡id_key-int 
      name = 2,    --关卡名-越南语-string 
      combat = 3,    --推荐战力-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Trương Hợp","40000",},
        [2] = {2,"Ngụy Diên","70000",},
        [3] = {3,"Thượng Hương","120000",},
        [4] = {4,"Vu Cát","170000",},
        [5] = {5,"Trương Liêu","260000",},
        [6] = {6,"Khương Duy","640000",},
        [7] = {7,"Tôn Kiên","135 vạn",},
        [8] = {8,"Trương Giác","250 vạn",},
        [9] = {9,"Hứa Chử","450 vạn",},
        [10] = {10,"Hoàng Trung","717 vạn",},
        [11] = {11,"Cam Ninh","1100 vạn",},
        [12] = {12,"Công Tôn Toản","1680 vạn",},
        [13] = {13,"Điển Vi","2540 vạn",},
        [14] = {14,"Mã Siêu","3890 vạn",},
        [15] = {15,"Lữ Mông","5770 vạn",},
        [16] = {16,"Giả Hủ","8840 vạn",},
        [17] = {17,"Tào Nhân","13850 vạn",},
        [18] = {18,"Trương Phi","20625 vạn",},
        [19] = {19,"Tôn Quyền","31500 vạn",},
        [20] = {20,"Hoa Hùng","45700 vạn",},
        [21] = {21,"Hạ Hầu Đôn","62000 vạn",},
        [22] = {22,"Quan Vũ","79000 vạn",},
        [23] = {23,"Thái Sử Từ","102400 vạn",},
        [24] = {24,"Đổng Trác","132000 vạn",},
        [25] = {25,"Quách Gia","170000 vạn",},
        [26] = {26,"Nguyệt Anh","220000 vạn",},
        [27] = {27,"Tiểu Kiều","280000 vạn",},
        [28] = {28,"Điêu Thuyền","360000 vạn",},
        [29] = {29,"Tuân Úc","470000 vạn",},
        [30] = {30,"Lưu Bị","500000 vạn",},
        [31] = {31,"Đại Kiều","600000 vạn",},
        [32] = {32,"Hoa Đà","74 tỉ",},
        [33] = {33,"Tào Phi","97 tỉ",},
        [34] = {34,"Bàng Thống","127 tỉ",},
        [35] = {35,"Lục Tốn","166 tỉ",},
        [36] = {36,"Viên Thiệu","220 tỉ",},
        [37] = {37,"Chân Cơ","290 tỉ",},
        [38] = {38,"Từ Thứ","300 tỉ",},
        [39] = {39,"Lỗ Túc","400 tỉ",},
        [40] = {40,"Viên Thuật","500 tỉ",},
        [41] = {41,"Tư Mã Ý","600 tỉ",},
        [42] = {42,"Triệu Vân","700 tỉ",},
        [43] = {43,"Tôn Sách","800 tỉ",},
        [44] = {44,"Tả Từ","900 tỉ",},
        [45] = {45,"Tào Tháo","1000 tỉ",},
        [46] = {46,"Gia Cát Lượng","1100 tỉ",},
        [47] = {47,"Chu Du","1200 tỉ",},
        [48] = {48,"Lữ Bố","1300 tỉ",},
    }
}

return equip_essence_stage