--festival_res

local festival_res = {
    -- key
    __key_map = {
      id = 1,    --排序id_key-int 
      res_name = 2,    --资源名称-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Mừng Lễ -Bỏ",},
        [2] = {2,"Mừng Lễ -Bỏ",},
        [3] = {3,"Võ Tướng-Hủy",},
        [4] = {4,"Trang Bị-Hủy",},
        [5] = {5,"Bảo Vật-Hủy",},
        [6] = {6,"Thần Binh-Hủy",},
        [7] = {7,"Tài Bảo-Hủy",},
        [8] = {8,"Hướng dẫn-Thường",},
        [9] = {9,"Hướng dẫn-Trung Thu, Ngày Lễ",},
        [10] = {10,"Hướng dẫn-Thất Tịch",},
        [11] = {11,"Hướng dẫn-11/11",},
        [12] = {12,"Mừng Lễ",},
        [13] = {13,"Mừng Lễ -Thất Tịch",},
        [14] = {14,"Mừng Lễ -Trung Thu",},
        [15] = {15,"Mừng Lễ -Ngày Lễ",},
        [16] = {16,"Mừng Lễ -11/11",},
        [17] = {17,"Mừng Lễ -Gộp Máy Chủ",},
        [18] = {18,"Mừng Lễ -11/11",},
        [19] = {19,"Mừng Lễ -Giáng Sinh",},
        [20] = {20,"Mừng Lễ -Nguyên Đán",},
        [21] = {21,"Hướng dẫn-Giáng Sinh",},
        [22] = {22,"Hướng dẫn-Nguyên Đán",},
        [23] = {23,"Mừng Lễ -Năm Mới",},
        [24] = {24,"Hướng dẫn-Năm Mới",},
        [25] = {25,"Mừng Lễ -Nguyên Tiêu",},
        [26] = {26,"Hướng dẫn-Nguyên Tiêu",},
        [27] = {27,"Hướng dẫn-Thường",},
        [28] = {28,"Mừng Lễ",},
        [29] = {29,"Mừng Lễ",},
        [30] = {30,"Hướng dẫn-Thường",},
        [31] = {31,"Mừng Lễ",},
        [32] = {32,"Hướng dẫn-Thường",},
        [33] = {40,"Mừng Lễ",},
        [34] = {41,"Hướng dẫn-Thường",},
        [35] = {35,"Mừng Lễ",},
        [36] = {36,"Hướng dẫn-Thường",},
        [37] = {37,"",},
        [38] = {38,"",},
        [39] = {39,"",},
        [40] = {42,"",},
        [41] = {43,"",},
        [42] = {44,"",},
        [43] = {45,"",},
        [44] = {46,"",},
        [45] = {47,"",},
        [46] = {48,"",},
        [47] = {49,"",},
        [48] = {50,"",},
        [49] = {51,"Tết Nguyên Đán",},
        [50] = {52,"",},
    }
}

return festival_res