--mine_output

local mine_output = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      description = 2,    --状态描述-越南语-string 
      output_show = 3,    --显示产量-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"Thường","",},
        [2] = {2,"Thường","",},
        [3] = {3,"Thường","",},
        [4] = {4,"Thường","",},
        [5] = {5,"Thường","",},
        [6] = {6,"Thường","600/ngày",},
        [7] = {7,"Đầy","480/ngày",},
        [8] = {8,"Đầy","360/ngày",},
        [9] = {9,"Đầy","360/ngày",},
        [10] = {10,"Đầy","360/ngày",},
        [11] = {11,"Thường","400/ngày",},
        [12] = {12,"Đầy","320/ngày",},
        [13] = {13,"Đầy","240/ngày",},
        [14] = {14,"Đầy","240/ngày",},
        [15] = {15,"Đầy","240/ngày",},
        [16] = {16,"Thường","200/ngày",},
        [17] = {17,"Đầy","160/ngày",},
        [18] = {18,"Đầy","120/ngày",},
        [19] = {19,"Đầy","120/ngày",},
        [20] = {20,"Đầy","120/ngày",},
    }
}

return mine_output