--function_preview

local function_preview = {
    -- key
    __key_map = {
      id = 1,    --编号_key-int 
      text = 2,    --文本描述-string 
    
    },
    -- data
    _data = {
        [1] = {1,"#level#级开启, 招募武将可激活上阵武将名将册, 战力会有大幅提升!",},
        [2] = {2,"#level#级可穿戴装备, 初级装备可从主线副本获得!",},
        [3] = {3,"#level#级开启第4阵位, 可上阵第4名武将!",},
        [4] = {4,"#level#级开启竞技场, 挑战可获得大量元宝, 排名越高奖励越多!",},
        [5] = {5,"#level#级开启游历系统, 在神州大地上游历, 触发奇遇可获得宝物!",},
        [6] = {6,"达到#level#级, 主角和武将可突破+2, 每次突破都会大幅提升武将战斗力!",},
        [7] = {8,"#level#级开启第5阵位, 可上阵第5名武将!",},
        [8] = {9,"#level#级开启官衔, 晋升官衔, 争夺荣耀巅峰!",},
        [9] = {10,"#level#级开启, 挑战历代名将, 勇夺装备精华, 神装等你来拿!",},
        [10] = {11,"#level#级开启日常副本, 海量资源天天拿!",},
        [11] = {12,"#level#级开启军团, 打军团BOSS拿海量元宝分红!",},
        [12] = {13,"达到#level#级, 主角和武将可突破+3!",},
        [13] = {14,"#level#级开启第6阵位, 可上阵第6名武将!",},
        [14] = {15,"#level#级开启领地巡逻, 派遣名将巡逻城池, 得海量资源, 还有几率偶遇整将!",},
        [15] = {16,"#level#级开启援军, 招募武将上阵援助, 激活羁绊, 享有大量战力加成!",},
        [16] = {17,"达到#level#级, 主角和武将可突破+4!",},
        [17] = {18,"#level#级开启装备精炼, 装备精炼可大大提高战斗力, 别忘了多多收集精炼石哟!",},
        [18] = {19,"#level#级开启名将副本, 海量元宝, 将魂任你拿!",},
        [19] = {20,"#level#级开启南蛮入侵, 挑战蛮荒凶徒, 获取神兵利器!",},
        [20] = {21,"#level#级开启宝物精炼, 主公记得多买宝物精炼石!",},
        [21] = {22,"#level#级开启武将觉醒, 武将觉醒可大大提高武将的基础属性!",},
        [22] = {23,"#level#级开启锦囊系统, 装备锦囊大大增强武将特性, 玩法更多变哟!",},
        [23] = {24,"#level#级开启变身卡, 可自由转换主角, 随心所欲搭配阵营, 玩的更嗨!",},
        [24] = {25,"#level#级开启神兽功能, 萌宠在手, 天下我有!",},
        [25] = {26,"#level#级开启武将置换, 可随意置换橙, 红武将, 随心所欲玩转阵容!",},
        [26] = {27,"#level#级开启界限突破, 橙色武将逆天改命, 实力暴涨!",},
        [27] = {28,"#level#级开启玉石镶嵌, 装备属性如虎添翼, 战斗力更上一层楼!",},
    }
}

return function_preview