--guild_support_talks

local guild_support_talks = {
    -- key
    __key_map = {
      id = 1,    --说话id_key-int 
      talks = 2,    --援助看板娘随机说话文本，每次进入界面或者点击立绘头像随机播放文字-越南语-string 
    
    },
    -- data
    _data = {
        [1] = {1,"还没有在军团求援吗?赶紧去求援吧!",},
        [2] = {2,"每天求援可以获得3个红色色武将碎片哦!",},
        [3] = {3,"每天求援可以获得5个紫色武将碎片哦!",},
        [4] = {4,"每天求援可以获得4个橙色武将碎片哦!",},
        [5] = {5,"还没完成求援?快去军团呼叫吧!",},
        [6] = {6,"多余的武将碎片可以赠予同军团成员!",},
        [7] = {7,"赠送武将碎片可以获得军团贡献",},
        [8] = {8,"完成3次求援可获得星彩精心准备的大奖哦!",},
    }
}

return guild_support_talks