--official_rank

local official_rank = {
    -- key
    __key_map = {
      id = 1,    --id_key-int 
      name = 2,    --晋升名称-简中-string 
      text_1 = 3,    --主界面提示文本-简中-string 
      text_2 = 4,    --晋升提示文本-简中-string 
    
    },
    -- data
    _data = {
        [1] = {0,"平民","本次晋升新增主角缘分: 防御中册—防御加成+70%","新增主角缘分: 防御中册—防御加成+70%",},
        [2] = {1,"护军","","",},
        [3] = {2,"司马","本次晋升新增主角缘分: 生命下册—生命加成+80%","新增主角缘分: 生命下册—生命加成+80%",},
        [4] = {3,"都尉","","",},
        [5] = {4,"校尉","","",},
        [6] = {5,"太守","","",},
        [7] = {6,"刺史","本次晋升新增主角缘分: 攻击下册—攻击加成+70%","新增主角缘分: 攻击下册—攻击加成+70%",},
        [8] = {7,"中郎将","","",},
        [9] = {8,"京兆尹","","",},
        [10] = {9,"尚书令","","",},
        [11] = {10,"卫将军","","",},
        [12] = {11,"大都督","","",},
        [13] = {12,"大将军","","",},
    }
}

return official_rank