--shop

local shop = {
    -- key
    __key_map = {
      shop_id = 1,    --商店ID_key-int 
      shop_name = 2,    --商店名称-string 
      tab_name1 = 3,    --页签名称-string 
      tab_name2 = 4,    --页签名称-string 
      tab_name3 = 5,    --页签名称-string 
      tab_name4 = 6,    --页签名称-string 
      tab_name5 = 7,    --页签名称-string 
      price4_type = 8,    --商店代币类型4-int 
      price4_value = 9,    --代币4-int 
    
    },
    -- data
    _data = {
        [1] = {1,"商城","道  具","商  品","","","",0,0,},
        [2] = {2,"装备商店","道  具","紫  装","橙  装","奖  励","",0,0,},
        [3] = {3,"神兵商店","道  具","","","","",0,0,},
        [4] = {4,"竞技商店","道  具","武  将","奖  励","","",0,0,},
        [5] = {5,"军团商店","道  具","魏  国","蜀  国","吴  国","群  雄",0,0,},
        [6] = {6,"武将商店","武  将","","","","",0,0,},
        [7] = {7,"宝物商店","道  具","紫  宝","橙  宝","","",0,0,},
        [8] = {8,"觉醒商店","道  具","","","","",0,0,},
        [9] = {9,"每日特惠","","","","","",0,0,},
        [10] = {10,"每周特惠","","","","","",0,0,},
        [11] = {11,"神兽商店","","","","","",0,0,},
        [12] = {12,"半价物资","","","","","",0,0,},
        [13] = {13,"变身商店","魏  国","蜀  国","吴  国","群  雄","",6,147,},
        [14] = {14,"套装商店","","","","","",0,0,},
        [15] = {15,"神兽商店","道  具","","","","",0,0,},
        [16] = {16,"觉醒商店","道  具","蓝  色","紫  色","橙  色","红  色",0,0,},
        [17] = {17,"观星商店","","","","","",0,0,},
        [18] = {18,"战马商店","战  马","马  具","","","",0,0,},
        [19] = {19,"王者商店","","","","","",0,0,},
        [20] = {20,"原石商店","原  石","","","","",0,0,},
        [21] = {21,"驯马商店","","","","","",0,0,},
        [22] = {22,"周年庆商店","首  日","次  日","三  日","元  宝","",0,0,},
        [23] = {24,"金将商店","金  将","限  购","资  源","","",0,0,},
    }
}

return shop