--territory_performance

local territory_performance = {
    -- key
    __key_map = {
      id = 1,    --序号_key-int 
      name = 2,    --城池名称-简中-string 
      hero_name = 3,    --守关武将名字-简中-string 
      directions = 4,    --城池描述-简中-string 
    
    },
    -- data
    _data = {
        [1] = {1,"徐州","太史慈","    徐州作为华东的门户城市, 此处环境优美, 人杰地灵, 其酒文化文明天下, 文人雅士常爱在此饮酒作乐, 经过历代先人苦心酿造研制, 此地盛产杜康.",},
        [2] = {2,"豫州","张昭","    豫州是华夏文明的发源地, 长期位于中国的政治经济和文化中心, 孕育出了大批军事人才, 此处盛产武将经验道具, 将魂等.",},
        [3] = {3,"荆州","刘表","    荆州其城名因地处荆山之南而得, 此处人杰地灵, 出过很多名将怪才, 因此地盛产突破丹, 同时也是兵家必争之地.",},
        [4] = {4,"青州","曹仁","  东方属木, 木色为青, 故名青州.此地矿产资源丰富, 铸铁工艺发达, 盛产各种装备精炼石, 精铁等.",},
        [5] = {5,"幽州","刘备","  春秋元命包云: 箕星散为幽州, 分为燕国.言北方太阴, 故以幽冥为号.幽州是古九州及汉十三刺史部之一；此地盛产经验宝物, 宝物精炼石等宝物养成资源.",},
        [6] = {6,"兖州","曹操","    兖州的这个兖字, 来源于兖水.兖水又称济水, 兖字有端信的含义, 孔子, 孟子等均曾在此讲学, 此处盛产神兵进阶石.",},
    }
}

return territory_performance