--type_manage

local type_manage = {
    -- key
    __key_map = {
      id = 1,    --资源类型编号_key-int 
      name = 2,    --名称-string 
    
    },
    -- data
    _data = {
        [1] = {1,"武将",},
        [2] = {2,"装备",},
        [3] = {3,"宝物",},
        [4] = {4,"神兵",},
        [5] = {5,"资源",},
        [6] = {6,"道具",},
        [7] = {7,"碎片",},
        [8] = {8,"宝石",},
        [9] = {9,"变身卡",},
        [10] = {10,"神兽",},
        [11] = {11,"锦囊",},
        [12] = {12,"战马",},
        [13] = {13,"历代名将",},
        [14] = {14,"历代名将武器",},
        [15] = {15,"战马装备",},
        [16] = {16,"玉石",},
        [17] = {17,"头像框",},
        [18] = {18,"称号",},
    }
}

return type_manage