--vip_pay

local _lang = "cn"
local _isExist = false
local _isBaseExist = false
local _isDataExist = false

-- key
local __key_map = {
  id = 1,    --编号-int 
  appid = 2,    --渠道id-int 
  use_id = 3,    --填表id-int 
  product_id = 4,    --商品id-string 
  name = 5,    --名字-string 
  icon_id = 6,    --icon编号-int 
  effect = 7,    --特效名称-string 
  card_type = 8,    --充值类型-int 
  func_type = 9,    --关联功能-int 
  rmb = 10,    --人民币价格_math-int 
  gold = 11,    --基础获得元宝_math-int 
  vip_exp = 12,    --vip经验值_math-int 
  gold_rebate_1 = 13,    --首次充值赠品元宝_math-int 
  gold_rebate_2 = 14,    --普通充值赠送元宝_math-int 
  type = 15,    --每日奖励类型-int 
  value = 16,    --每日奖励类型值-int 
  size = 17,    --每日奖励数量_math-int 
  last_day = 18,    --福利卡持续天数-int 
  renew_day = 19,    --续费提前天数-int 
  package = 20,    --分包号-string 
  large_amount = 21,    --大额充值-int 
  vip_show = 22,    --vip条件-int 
  order = 23,    --充值界面排序-int 
  extra_days = 24,    --续费赠送天数-int 
  drop = 25,    --是否随机掉落-int 

}

-- key type
local __key_type = {
  id = "int",    --编号-1 
  appid = "int",    --渠道id-2 
  use_id = "int",    --填表id-3 
  product_id = "string",    --商品id-4 
  name = "string",    --名字-5 
  icon_id = "int",    --icon编号-6 
  effect = "string",    --特效名称-7 
  card_type = "int",    --充值类型-8 
  func_type = "int",    --关联功能-9 
  rmb = "int",    --人民币价格_math-10 
  gold = "int",    --基础获得元宝_math-11 
  vip_exp = "int",    --vip经验值_math-12 
  gold_rebate_1 = "int",    --首次充值赠品元宝_math-13 
  gold_rebate_2 = "int",    --普通充值赠送元宝_math-14 
  type = "int",    --每日奖励类型-15 
  value = "int",    --每日奖励类型值-16 
  size = "int",    --每日奖励数量_math-17 
  last_day = "int",    --福利卡持续天数-18 
  renew_day = "int",    --续费提前天数-19 
  package = "string",    --分包号-20 
  large_amount = "int",    --大额充值-21 
  vip_show = "int",    --vip条件-22 
  order = "int",    --充值界面排序-23 
  extra_days = "int",    --续费赠送天数-24 
  drop = "int",    --是否随机掉落-25 

}


-- data
local vip_pay = {
    version =  1,
    _data = {
        [1] = {10001,0,10001,"com.sanguosha.mjz.gold6","60元宝",1,"",0,0,0,60,0,60,10,0,0,0,0,0,"0",0,0,11,0,0,},
        [2] = {10002,0,10002,"com.sanguosha.mjz.gold30","305元宝",2,"",0,0,0,305,0,305,60,0,0,0,0,0,"0",0,0,12,0,0,},
        [3] = {10003,0,10003,"com.sanguosha.mjz.gold68","610元宝",3,"",0,0,0,610,0,610,150,0,0,0,0,0,"0",0,0,13,0,0,},
        [4] = {10004,0,10004,"com.sanguosha.mjz.gold98","920元宝",4,"moving_chongzhi_yuanbao1",0,0,0,920,0,920,240,0,0,0,0,0,"0",0,0,14,0,0,},
        [5] = {10005,0,10005,"com.sanguosha.mjz.gold198","1840元宝",5,"moving_chongzhi_yuanbao1",0,0,0,1840,0,1840,500,0,0,0,0,0,"0",0,0,15,0,0,},
        [6] = {10006,0,10006,"com.sanguosha.mjz.gold298","2870元宝",6,"moving_chongzhi_yuanbao1",0,0,0,2870,0,2870,800,0,0,0,0,0,"0",0,0,16,0,0,},
        [7] = {10007,0,10007,"com.sanguosha.mjz.gold488","4500元宝",7,"moving_chongzhi_yuanbao4",0,0,0,4500,0,4500,1300,0,0,0,0,0,"0",0,0,17,0,0,},
        [8] = {10008,0,10008,"com.sanguosha.mjz.gold648","6000元宝",8,"moving_chongzhi_yuanbao5",0,0,0,6000,0,6000,1800,0,0,0,0,0,"0",0,0,18,0,0,},
        [9] = {10021,0,10021,"com.sanguosha.mjz.card18","豪华卡",6,"",1,1,610,300,305,0,0,5,1,500,7,2,"0",0,0,0,0,1,},
        [10] = {10022,0,10022,"com.sanguosha.mjz.card30","至尊卡",6,"",1,1,1220,500,610,0,0,5,1,500,30,2,"0",0,0,0,0,1,},
        [11] = {10023,0,10023,"com.sanguosha.mjz.gift1","120元礼包",1,"",2,2,120,0,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [12] = {10024,0,10024,"com.sanguosha.mjz.gift3","120元礼包",1,"",2,2,120,0,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [13] = {10025,0,10025,"com.sanguosha.mjz.gift6","120元礼包",1,"",2,2,120,0,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [14] = {10026,0,10026,"com.sanguosha.mjz.gift60","2200元大礼包",1,"",3,2,2200,0,1100,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [15] = {10027,0,10027,"com.sanguosha.mjz.fund1","第1期基金",1,"",3,3,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [16] = {10028,0,10028,"com.sanguosha.mjz.fund2","第2期基金",1,"",3,3,980,0,490,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [17] = {10029,0,10029,"com.sanguosha.mjz.fund3","第3期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [18] = {10030,0,10030,"com.sanguosha.mjz.fund4","第4期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [19] = {10031,0,10031,"com.sanguosha.mjz.fund5","第5期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [20] = {10032,0,10032,"com.sanguosha.mjz.fund6","第6期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [21] = {10047,0,10047,"com.sanguosha.mjz.fund7","第7期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [22] = {10048,0,10048,"com.sanguosha.mjz.fund8","第8期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [23] = {10049,0,10049,"com.sanguosha.mjz.fund9","第9期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [24] = {10050,0,10050,"com.sanguosha.mjz.fund10","第10期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [25] = {10051,0,10051,"com.sanguosha.mjz.fund11","第11期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [26] = {10052,0,10052,"com.sanguosha.mjz.shop1","120元商品",1,"",3,5,120,0,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [27] = {10053,0,10053,"com.sanguosha.mjz.shop2","610元商品",1,"",3,5,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [28] = {10054,0,10054,"com.sanguosha.mjz.shop3","1220元商品",1,"",3,5,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [29] = {10055,0,10055,"com.sanguosha.mjz.shop4","1840元商品",1,"",3,5,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [30] = {10056,0,10056,"com.sanguosha.mjz.shop5","3680元商品",1,"",3,5,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [31] = {10058,0,10058,"com.sanguosha.mjz.shop7","9000元商品",1,"",3,5,9000,0,4500,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [32] = {10060,0,10060,"com.sanguosha.mjz.fund12","第12期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [33] = {10061,0,10061,"com.sanguosha.mjz.fund13","第13期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [34] = {10062,0,10062,"com.sanguosha.mjz.fund14","第14期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [35] = {10063,0,10063,"com.sanguosha.mjz.fund15","第15期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [36] = {10064,0,10064,"com.sanguosha.mjz.fund16","第16期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [37] = {10065,0,10065,"com.sanguosha.mjz.fund17","第17期基金",1,"",3,3,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [38] = {10066,0,10066,"com.sanguosha.mjz.shop9","5740元商品",1,"",3,5,5740,0,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [39] = {10067,0,10067,"com.sanguosha.mjz.shop10","12000元商品",1,"",3,5,12000,0,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [40] = {10080,0,10080,"com.sanguosha.mjz.week1","1840元基金",1,"",3,5,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [41] = {10081,0,10081,"com.sanguosha.mjz.week2","1840元基金",1,"",3,5,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [42] = {10089,0,10089,"com.sanguosha.mjz.vipgift6","120元",1,"",3,5,120,20,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [43] = {10090,0,10090,"com.sanguosha.mjz.vipgift30","610元",1,"",3,5,610,100,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [44] = {10091,0,10091,"com.sanguosha.mjz.vipgift68","1220元",1,"",3,5,1220,200,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [45] = {10092,0,10092,"com.sanguosha.mjz.vipgift98","1840元",1,"",3,5,1840,300,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [46] = {10093,0,10093,"com.sanguosha.mjz.vipgift198","3680元",1,"",3,5,3680,600,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [47] = {10094,0,10094,"com.sanguosha.mjz.vipgift298","5740元",1,"",3,5,5740,1000,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [48] = {10095,0,10095,"com.sanguosha.mjz.vipgift488","9000元",1,"",3,5,9000,1500,4500,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [49] = {10096,0,10096,"com.sanguosha.mjz.vipgift648","12000元",1,"",3,5,12000,2000,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [50] = {10098,0,10098,"com.sanguosha.mjz.mine1","3680元",1,"",1,1,3680,600,1840,0,0,6,4,2,7,3,"0",0,5,0,2,0,},
        [51] = {10126,0,10126,"com.sanguosha.mjz.returnlv1","610元",1,"",3,5,610,305,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [52] = {10127,0,10127,"com.sanguosha.mjz.returnlv2","1840元",1,"",3,5,1840,920,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [53] = {10128,0,10128,"com.sanguosha.mjz.returnlv3","3680元",1,"",3,5,3680,1840,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [54] = {10129,0,10129,"com.sanguosha.mjz.returnlv4","12000元",1,"",3,5,12000,6000,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [55] = {10130,0,10130,"com.sanguosha.mjz.returndiscount1","610元",1,"",3,5,610,305,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [56] = {10131,0,10131,"com.sanguosha.mjz.returndiscount2","1840元",1,"",3,5,1840,920,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [57] = {10132,0,10132,"com.sanguosha.mjz.returndiscount3","3680元",1,"",3,5,3680,1840,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [58] = {10133,0,10133,"com.sanguosha.mjz.returndiscount4","1840元",1,"",3,5,1840,920,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [59] = {10134,0,10134,"com.sanguosha.mjz.returndiscount5","5740元",1,"",3,5,5740,2870,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [60] = {10135,0,10135,"com.sanguosha.mjz.returndiscount6","12000元",1,"",3,5,12000,6000,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [61] = {10136,0,10136,"com.sanguosha.mjz.returndiscount7","12000元",1,"",3,5,12000,6000,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [62] = {10137,0,10137,"com.sanguosha.mjz.returndiscount8","12000元",1,"",3,5,12000,6000,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [63] = {10143,0,10143,"com.sanguosha.mjz.jade30","305玉璧",10,"",4,6,610,305,305,0,0,0,0,0,0,0,"0",0,0,12,0,0,},
        [64] = {10144,0,10144,"com.sanguosha.mjz.jade98","920玉璧",12,"moving_chongzhi_yuanbao1",4,6,1840,920,920,0,0,0,0,0,0,0,"0",0,0,14,0,0,},
        [65] = {10145,0,10145,"com.sanguosha.mjz.jade298","2870玉璧",14,"moving_chongzhi_yuanbao1",4,6,5740,2870,2870,0,0,0,0,0,0,0,"0",0,0,16,0,0,},
        [66] = {10146,0,10146,"com.sanguosha.mjz.jade648","6000玉璧",16,"moving_chongzhi_yuanbao4",4,6,12000,6000,6000,0,0,0,0,0,0,0,"0",0,0,18,0,0,},
        [67] = {10155,0,10155,"com.sanguosha.mjz.jade6","60玉璧",9,"",4,6,120,60,60,0,0,0,0,0,0,0,"0",0,0,11,0,0,},
        [68] = {10156,0,10156,"com.sanguosha.mjz.jade68","610玉璧",11,"",4,6,1220,610,610,0,0,0,0,0,0,0,"0",0,0,13,0,0,},
        [69] = {10157,0,10157,"com.sanguosha.mjz.jade198","1840玉璧",13,"moving_chongzhi_yuanbao1",4,6,3680,1840,1840,0,0,0,0,0,0,0,"0",0,0,15,0,0,},
        [70] = {10158,0,10158,"com.sanguosha.mjz.jade488","4500玉璧",15,"moving_chongzhi_yuanbao5",4,6,9000,4500,4500,0,0,0,0,0,0,0,"0",0,0,17,0,0,},
        [71] = {11001,0,11001,"com.sanguosha.mjz.level1","#num#级礼包",1,"",3,4,120,0,60,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [72] = {11002,0,11002,"com.sanguosha.mjz.level2","#num#级礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [73] = {11003,0,11003,"com.sanguosha.mjz.level3","#num#级礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [74] = {11004,0,11004,"com.sanguosha.mjz.level4","#num#级礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [75] = {11005,0,11005,"com.sanguosha.mjz.level5","#num#级礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [76] = {11006,0,11006,"com.sanguosha.mjz.level6","#num#级礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [77] = {11007,0,11007,"com.sanguosha.mjz.level7","#num#级礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [78] = {11008,0,11008,"com.sanguosha.mjz.level8","#num#级礼包",1,"",3,4,5740,0,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [79] = {11009,0,11009,"com.sanguosha.mjz.level9","#num#级礼包",1,"",3,4,12000,0,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [80] = {11010,0,11010,"com.sanguosha.mjz.level10","#num#级礼包",1,"",3,4,370,0,185,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [81] = {11011,0,11011,"com.sanguosha.mjz.level11","#num#级礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [82] = {11012,0,11012,"com.sanguosha.mjz.level12","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [83] = {11013,0,11013,"com.sanguosha.mjz.level13","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [84] = {11014,0,11014,"com.sanguosha.mjz.level14","#num#级礼包",1,"",3,4,12000,0,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [85] = {11015,0,11015,"com.sanguosha.mjz.level15","#num#级礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [86] = {11016,0,11016,"com.sanguosha.mjz.level16","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [87] = {11017,0,11017,"com.sanguosha.mjz.level17","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [88] = {11018,0,11018,"com.sanguosha.mjz.level18","#num#级礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [89] = {11019,0,11019,"com.sanguosha.mjz.level19","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [90] = {11020,0,11020,"com.sanguosha.mjz.level20","#num#级礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [91] = {12001,0,12001,"com.sanguosha.mjz.level101","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [92] = {12002,0,12002,"com.sanguosha.mjz.level102","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [93] = {12003,0,12003,"com.sanguosha.mjz.level103","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [94] = {12004,0,12004,"com.sanguosha.mjz.level104","主线#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [95] = {12005,0,12005,"com.sanguosha.mjz.level105","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [96] = {12006,0,12006,"com.sanguosha.mjz.level106","主线#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [97] = {12007,0,12007,"com.sanguosha.mjz.level107","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [98] = {12008,0,12008,"com.sanguosha.mjz.level108","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [99] = {12009,0,12009,"com.sanguosha.mjz.level109","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [100] = {12010,0,12010,"com.sanguosha.mjz.level110","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [101] = {12011,0,12011,"com.sanguosha.mjz.level111","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [102] = {12012,0,12012,"com.sanguosha.mjz.level112","主线#num#关礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [103] = {12013,0,12013,"com.sanguosha.mjz.level113","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [104] = {12014,0,12014,"com.sanguosha.mjz.level114","主线#num#关礼包",1,"",3,4,5740,0,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [105] = {12015,0,12015,"com.sanguosha.mjz.level115","主线#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [106] = {12016,0,12016,"com.sanguosha.mjz.level116","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [107] = {12017,0,12017,"com.sanguosha.mjz.level117","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [108] = {12018,0,12018,"com.sanguosha.mjz.level118","主线#num#关礼包",1,"",3,4,5740,0,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [109] = {12019,0,12019,"com.sanguosha.mjz.level119","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [110] = {12020,0,12020,"com.sanguosha.mjz.level120","主线#num#关礼包",1,"",3,4,5740,0,2870,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [111] = {12021,0,12021,"com.sanguosha.mjz.level121","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [112] = {12022,0,12022,"com.sanguosha.mjz.level122","主线#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [113] = {13001,0,13001,"com.sanguosha.mjz.level201","游历#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [114] = {13002,0,13002,"com.sanguosha.mjz.level202","游历#num#关礼包",1,"",3,4,370,0,185,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [115] = {13003,0,13003,"com.sanguosha.mjz.level203","游历#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [116] = {13004,0,13004,"com.sanguosha.mjz.level204","游历#num#关礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [117] = {13005,0,13005,"com.sanguosha.mjz.level205","游历#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [118] = {13006,0,13006,"com.sanguosha.mjz.level206","游历#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [119] = {13007,0,13007,"com.sanguosha.mjz.level207","游历#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [120] = {13008,0,13008,"com.sanguosha.mjz.level208","游历#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [121] = {13009,0,13009,"com.sanguosha.mjz.level209","游历#num#关礼包",1,"",3,4,1220,0,610,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [122] = {13010,0,13010,"com.sanguosha.mjz.level210","游历#num#关礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [123] = {14001,0,14001,"com.sanguosha.mjz.level301","官衔提升礼包",1,"",3,4,610,0,305,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [124] = {14002,0,14002,"com.sanguosha.mjz.level302","官衔提升礼包",1,"",3,4,980,0,490,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [125] = {14003,0,14003,"com.sanguosha.mjz.level303","官衔提升礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [126] = {14004,0,14004,"com.sanguosha.mjz.level304","官衔提升礼包",1,"",3,4,1840,0,920,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [127] = {14005,0,14005,"com.sanguosha.mjz.level305","官衔提升礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [128] = {14006,0,14006,"com.sanguosha.mjz.level306","官衔提升礼包",1,"",3,4,3680,0,1840,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [129] = {14007,0,14007,"com.sanguosha.mjz.level307","官衔提升礼包",1,"",3,4,9000,0,4500,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [130] = {14008,0,14008,"com.sanguosha.mjz.level308","官衔提升礼包",1,"",3,4,9000,0,4500,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [131] = {14009,0,14009,"com.sanguosha.mjz.level309","官衔提升礼包",1,"",3,4,12000,0,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
        [132] = {14010,0,14010,"com.sanguosha.mjz.level310","官衔提升礼包",1,"",3,4,12000,0,6000,0,0,0,0,0,0,0,"0",0,0,0,0,0,},
    }
}

-- index
local __index_id = {
    [10001] = 1,
    [10002] = 2,
    [10003] = 3,
    [10004] = 4,
    [10005] = 5,
    [10006] = 6,
    [10007] = 7,
    [10008] = 8,
    [10021] = 9,
    [10022] = 10,
    [10023] = 11,
    [10024] = 12,
    [10025] = 13,
    [10026] = 14,
    [10027] = 15,
    [10028] = 16,
    [10029] = 17,
    [10030] = 18,
    [10031] = 19,
    [10032] = 20,
    [10047] = 21,
    [10048] = 22,
    [10049] = 23,
    [10050] = 24,
    [10051] = 25,
    [10052] = 26,
    [10053] = 27,
    [10054] = 28,
    [10055] = 29,
    [10056] = 30,
    [10058] = 31,
    [10060] = 32,
    [10061] = 33,
    [10062] = 34,
    [10063] = 35,
    [10064] = 36,
    [10065] = 37,
    [10066] = 38,
    [10067] = 39,
    [10080] = 40,
    [10081] = 41,
    [10089] = 42,
    [10090] = 43,
    [10091] = 44,
    [10092] = 45,
    [10093] = 46,
    [10094] = 47,
    [10095] = 48,
    [10096] = 49,
    [10098] = 50,
    [10126] = 51,
    [10127] = 52,
    [10128] = 53,
    [10129] = 54,
    [10130] = 55,
    [10131] = 56,
    [10132] = 57,
    [10133] = 58,
    [10134] = 59,
    [10135] = 60,
    [10136] = 61,
    [10137] = 62,
    [10143] = 63,
    [10144] = 64,
    [10145] = 65,
    [10146] = 66,
    [10155] = 67,
    [10156] = 68,
    [10157] = 69,
    [10158] = 70,
    [11001] = 71,
    [11002] = 72,
    [11003] = 73,
    [11004] = 74,
    [11005] = 75,
    [11006] = 76,
    [11007] = 77,
    [11008] = 78,
    [11009] = 79,
    [11010] = 80,
    [11011] = 81,
    [11012] = 82,
    [11013] = 83,
    [11014] = 84,
    [11015] = 85,
    [11016] = 86,
    [11017] = 87,
    [11018] = 88,
    [11019] = 89,
    [11020] = 90,
    [12001] = 91,
    [12002] = 92,
    [12003] = 93,
    [12004] = 94,
    [12005] = 95,
    [12006] = 96,
    [12007] = 97,
    [12008] = 98,
    [12009] = 99,
    [12010] = 100,
    [12011] = 101,
    [12012] = 102,
    [12013] = 103,
    [12014] = 104,
    [12015] = 105,
    [12016] = 106,
    [12017] = 107,
    [12018] = 108,
    [12019] = 109,
    [12020] = 110,
    [12021] = 111,
    [12022] = 112,
    [13001] = 113,
    [13002] = 114,
    [13003] = 115,
    [13004] = 116,
    [13005] = 117,
    [13006] = 118,
    [13007] = 119,
    [13008] = 120,
    [13009] = 121,
    [13010] = 122,
    [14001] = 123,
    [14002] = 124,
    [14003] = 125,
    [14004] = 126,
    [14005] = 127,
    [14006] = 128,
    [14007] = 129,
    [14008] = 130,
    [14009] = 131,
    [14010] = 132,

}

-- index mainkey map
local __main_key_map = {
    [1] = 10001,
    [2] = 10002,
    [3] = 10003,
    [4] = 10004,
    [5] = 10005,
    [6] = 10006,
    [7] = 10007,
    [8] = 10008,
    [9] = 10021,
    [10] = 10022,
    [11] = 10023,
    [12] = 10024,
    [13] = 10025,
    [14] = 10026,
    [15] = 10027,
    [16] = 10028,
    [17] = 10029,
    [18] = 10030,
    [19] = 10031,
    [20] = 10032,
    [21] = 10047,
    [22] = 10048,
    [23] = 10049,
    [24] = 10050,
    [25] = 10051,
    [26] = 10052,
    [27] = 10053,
    [28] = 10054,
    [29] = 10055,
    [30] = 10056,
    [31] = 10058,
    [32] = 10060,
    [33] = 10061,
    [34] = 10062,
    [35] = 10063,
    [36] = 10064,
    [37] = 10065,
    [38] = 10066,
    [39] = 10067,
    [40] = 10080,
    [41] = 10081,
    [42] = 10089,
    [43] = 10090,
    [44] = 10091,
    [45] = 10092,
    [46] = 10093,
    [47] = 10094,
    [48] = 10095,
    [49] = 10096,
    [50] = 10098,
    [51] = 10126,
    [52] = 10127,
    [53] = 10128,
    [54] = 10129,
    [55] = 10130,
    [56] = 10131,
    [57] = 10132,
    [58] = 10133,
    [59] = 10134,
    [60] = 10135,
    [61] = 10136,
    [62] = 10137,
    [63] = 10143,
    [64] = 10144,
    [65] = 10145,
    [66] = 10146,
    [67] = 10155,
    [68] = 10156,
    [69] = 10157,
    [70] = 10158,
    [71] = 11001,
    [72] = 11002,
    [73] = 11003,
    [74] = 11004,
    [75] = 11005,
    [76] = 11006,
    [77] = 11007,
    [78] = 11008,
    [79] = 11009,
    [80] = 11010,
    [81] = 11011,
    [82] = 11012,
    [83] = 11013,
    [84] = 11014,
    [85] = 11015,
    [86] = 11016,
    [87] = 11017,
    [88] = 11018,
    [89] = 11019,
    [90] = 11020,
    [91] = 12001,
    [92] = 12002,
    [93] = 12003,
    [94] = 12004,
    [95] = 12005,
    [96] = 12006,
    [97] = 12007,
    [98] = 12008,
    [99] = 12009,
    [100] = 12010,
    [101] = 12011,
    [102] = 12012,
    [103] = 12013,
    [104] = 12014,
    [105] = 12015,
    [106] = 12016,
    [107] = 12017,
    [108] = 12018,
    [109] = 12019,
    [110] = 12020,
    [111] = 12021,
    [112] = 12022,
    [113] = 13001,
    [114] = 13002,
    [115] = 13003,
    [116] = 13004,
    [117] = 13005,
    [118] = 13006,
    [119] = 13007,
    [120] = 13008,
    [121] = 13009,
    [122] = 13010,
    [123] = 14001,
    [124] = 14002,
    [125] = 14003,
    [126] = 14004,
    [127] = 14005,
    [128] = 14006,
    [129] = 14007,
    [130] = 14008,
    [131] = 14009,
    [132] = 14010,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        local key_map = t._raw_key_map
        assert(key_map[k], "cannot find " .. k .. " in vip_pay")
        if _lang ~= "cn" and _isDataExist  and t._data_key_map[k] then
            return t._data[t._data_key_map[k]]
        end
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[key_map[k]]
    end
}

-- 
function vip_pay.length()
    return #vip_pay._data
end

-- 
function vip_pay.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function vip_pay.isVersionValid(v)
    if vip_pay.version then
        if v then
            return vip_pay.version <= v
        else
            return false
        end
    else
        return true
    end
end

--
function vip_pay.indexOf(index)
    if index == nil or not vip_pay._data[index] then
        return nil
    end
    if Lang.lang ~= _lang then 
        _lang = Lang.lang
        if Lang.lang ~= "cn" then
            _isDataExist = Lang.isFileExist("app/i18n/".. _lang .."/data/vip_pay.lua")
            _isExist = Lang.isFileExist("app/i18n/".. _lang .."/config/vip_pay.lua")
            _isBaseExist =  Lang.isFileExist("app/i18n/".. _lang .."/base/vip_pay.lua")

            if _isDataExist then
                local table = require( "app.i18n.".. _lang ..".data." .. "vip_pay" )
                _isDataExist = vip_pay.isVersionValid(table.version)
            end
            if _isBaseExist then
                local table = require( "app.i18n.".. _lang ..".base." .. "vip_pay" )
                _isBaseExist = vip_pay.isVersionValid(table.version)
            end
            if _isExist then
                local table = require( "app.i18n.".. _lang ..".config." .. "vip_pay" )
                _isExist = vip_pay.isVersionValid(table.version)
            end
        end
    end
    local config = {_raw = nil,_raw_key_map = __key_map,_lang = nil,_lang_key_map = nil,_data = nil,_data_key_map = nil}
    if _lang ~= "cn" and _isDataExist then
        local table = require( "app.i18n.".. _lang ..".data." .. "vip_pay" )
        local main_key = __main_key_map[index]
		local index_key = "__index_id"
        local data_index = table[index_key][main_key]
        config._data = table._data[data_index]
        config._data_key_map = table.__key_map
    end

    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "vip_pay" )
        local main_key = __main_key_map[index]
		local index_key = "__index_id"
        local lang_index = table[index_key][main_key]
        config._lang = table._data[lang_index]
        config._lang_key_map = table.__key_map
    end
    config._raw = vip_pay._data[index]
    if _lang ~= "cn" and _isBaseExist then
        local table_base = require( "app.i18n.".. _lang ..".base." .. "vip_pay" )
        config._raw = table_base._data[index] 
    end
    return setmetatable(config, mt)
end

--
function vip_pay.get(id)
    
    return vip_pay.indexOf(__index_id[id])
        
end

--
function vip_pay.set(id, key, value)
    local record = vip_pay.get(id)
    if record then
        if _lang ~= "cn" and _isDataExist then
            local keyIndex =  record._data_key_map[key]
            if keyIndex then
                record._data[keyIndex] = value
                return
            end
        end
        if _lang ~= "cn" and _isExist then
            local keyIndex =  record._lang_key_map[key]
            if keyIndex then
                record._lang[keyIndex] = value
                return
            end
        end
        local keyIndex = record._raw_key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function vip_pay.index()
    return __index_id
end

return vip_pay