--name3_name

local _lang = "cn"
local _isExist = false
local _isBaseExist = false
local _isDataExist = false

-- key
local __key_map = {
  id = 1,    --编号-int 
  name_boy = 2,    --男性名-string 
  name_girl = 3,    --女性名-string 

}

-- key type
local __key_type = {
  id = "int",    --编号-1 
  name_boy = "string",    --男性名-2 
  name_girl = "string",    --女性名-3 

}


-- data
local name3_name = {
    version =  1,
    _data = {
        [1] = {1,"悠真","千都",},
        [2] = {2,"悠斗","昴",},
        [3] = {3,"颯太","あか音",},
        [4] = {4,"瑛太","えいみ",},
        [5] = {5,"翔太","真以美",},
        [6] = {6,"悠太","理彩子",},
        [7] = {7,"陽太","緋呂子",},
        [8] = {8,"大和","可琳",},
        [9] = {9,"悠人","緩菜",},
        [10] = {10,"大輝","珠央",},
        [11] = {11,"隼人","香代美",},
        [12] = {12,"陽斗","美優",},
        [13] = {13,"拓真","柑奈",},
        [14] = {14,"奏太","光世",},
        [15] = {15,"陸斗","紗侑里",},
        [16] = {16,"蒼太","クララ",},
        [17] = {17,"颯真","宝子",},
        [18] = {18,"海斗","美姫",},
        [19] = {19,"大翔","河合",},
        [20] = {20,"奏汰","磨実",},
        [21] = {21,"蒼汰","柚奈",},
        [22] = {22,"大樹","千湖",},
        [23] = {23,"悠翔","愛理香",},
        [24] = {24,"理人","萌菜",},
        [25] = {25,"一輝","千雅",},
        [26] = {26,"健人","利那",},
        [27] = {27,"和真","清代",},
        [28] = {28,"瑛斗","理衣子",},
        [29] = {29,"航太","なな美",},
        [30] = {30,"歩夢","光季",},
        [31] = {31,"高知","七瀬",},
        [32] = {32,"遠忠","愛実",},
        [33] = {33,"詮久","なお子",},
        [34] = {34,"亮福","良",},
        [35] = {35,"嘉教","早智",},
        [36] = {36,"村里","きよか",},
        [37] = {37,"元嘉","菜都美",},
        [38] = {38,"重賀","佳保里",},
        [39] = {39,"守隆","美桜",},
        [40] = {40,"高昌","カヨ",},
        [41] = {41,"左藤","真夏",},
        [42] = {42,"弥弘","茉奈美",},
        [43] = {43,"邦漣","愛沙",},
        [44] = {44,"重良","弓佳",},
        [45] = {45,"盛舜","聖菜",},
        [46] = {46,"茲愛","七生",},
        [47] = {47,"久仲","槙子",},
        [48] = {48,"慶是","仁実",},
        [49] = {49,"信助","理名",},
        [50] = {50,"是章","晶菜",},
        [51] = {51,"秀家","万友美",},
        [52] = {52,"輝周","仁子",},
        [53] = {53,"頼廉","ことみ",},
        [54] = {54,"誠央","民",},
        [55] = {55,"恵守","有未",},
        [56] = {56,"宣永","花純",},
        [57] = {57,"茂朝","知枝",},
        [58] = {58,"為春","紀香",},
        [59] = {59,"嘉栄","星花",},
        [60] = {60,"行宗","莉紗子",},
        [61] = {61,"右道","彩季",},
        [62] = {62,"直綱","南帆",},
        [63] = {63,"重吉","起代子",},
        [64] = {64,"豊国","百美",},
        [65] = {65,"誠直","也実",},
        [66] = {66,"三通","美佑",},
        [67] = {67,"隆光","セツ子",},
        [68] = {68,"分松","優子",},
        [69] = {69,"弘順","佑樹",},
        [70] = {70,"宗昌","富美枝",},
        [71] = {71,"光述","碧依",},
        [72] = {72,"喜与","リオ",},
        [73] = {73,"按夢","ふたば",},
        [74] = {74,"胤悟","まよ",},
        [75] = {75,"邦能","摩子",},
        [76] = {76,"就治","茄奈",},
        [77] = {77,"道忠","みなと",},
        [78] = {78,"佐助","彩翔",},
        [79] = {79,"隆継","富士江",},
        [80] = {80,"継隆","紅里",},
        [81] = {81,"暁","尚見",},
        [82] = {82,"修","多映子",},
        [83] = {83,"学","猫ちゃん",},
        [84] = {84,"岳","すず子",},
        [85] = {85,"憲","お椎",},
        [86] = {86,"元","朝子",},
        [87] = {87,"源","林子",},
        [88] = {88,"聡","雪子",},
        [89] = {89,"茂","兎",},
        [90] = {90,"紳","お尚",},
        [91] = {91,"惣","お絵",},
        [92] = {92,"孝","宵",},
        [93] = {93,"崇","称子",},
        [94] = {94,"武","誉",},
        [95] = {95,"剛","風子",},
        [96] = {96,"忠","お章",},
        [97] = {97,"巽","睦",},
        [98] = {98,"哲","愛子",},
        [99] = {99,"登","幸",},
        [100] = {100,"昇","爾子",},
        [101] = {101,"拓","藍",},
        [102] = {102,"博","桂子",},
        [103] = {103,"豊","侑",},
        [104] = {104,"龍","詠",},
        [105] = {105,"渡","虎子",},
        [106] = {106,"貫太","お命",},
        [107] = {107,"虎南","葉子",},
        [108] = {108,"虎楠","真子",},
        [109] = {109,"左右","ももい",},
        [110] = {110,"佐介","ゆうゆ",},
        [111] = {111,"源二","はるり",},
        [112] = {112,"源次","ひなと",},
        [113] = {113,"元二","ここな",},
        [114] = {114,"虎輝","あいた",},
        [115] = {115,"虎治","みあ",},
        [116] = {116,"志堂","ゆお",},
        [117] = {117,"志童","そらか",},
        [118] = {118,"隆造","りね",},
        [119] = {119,"俊作","ひなと",},
        [120] = {120,"隼作","あいあ",},
        [121] = {121,"純平","ここね",},
        [122] = {122,"寛二郎","りい",},
        [123] = {123,"寛次郎","ゆうゆ",},
        [124] = {124,"幹二郎","みり",},
        [125] = {125,"幹次郎","はるか",},
        [126] = {126,"寛太郎","ももな",},
        [127] = {127,"勘太郎","ゆお",},
        [128] = {128,"菊次郎","そらた",},
        [129] = {129,"菊二郎","さとみ",},
        [130] = {130,"銀二郎","このみ",},
        [131] = {131,"銀次郎","あきほ",},
        [132] = {132,"慶二郎","ふたば",},
        [133] = {133,"賢次郎","なのは",},
        [134] = {134,"研次郎","せいな",},
        [135] = {135,"顕次郎","ゆずな",},
        [136] = {136,"兼次郎","りいさ",},
        [137] = {137,"謙次郎","はなか",},
        [138] = {138,"幸士郎","まりか",},
        [139] = {139,"常太郎","ゆりあ",},
        [140] = {140,"信次郎","ましろ",},
        [141] = {141,"信二郎","なつみ",},
        [142] = {142,"新次郎","ことな",},
        [143] = {143,"新二郎","はんな",},
        [144] = {144,"進二郎","みすず",},
        [145] = {145,"信次郎","ゆうみ",},
        [146] = {146,"信二郎","なるみ",},
        [147] = {147,"仙太郎","はるほ",},
        [148] = {148,"惣一郎","あおば",},
        [149] = {149,"壮二郎","ここは",},
        [150] = {150,"総二郎","かずは",},
        [151] = {151,"創二郎","りいな",},
        [152] = {152,"聡二郎","ゆきな",},
        [153] = {153,"惣二郎","こはな",},
        [154] = {154,"綜二郎","まりな",},
        [155] = {155,"総次郎・","もみじ",},
        [156] = {156,"創次郎","つばき",},
        [157] = {157,"綜次郎","こゆき",},
        [158] = {158,"泰二郎","しいな",},
        [159] = {159,"泰次郎","こずえ",},
        [160] = {160,"虎次郎","やよい",},
        [161] = {161,"虎二郎","まりあ",},
        [162] = {162,"寅二郎","みおん",},
        [163] = {163,"安二郎","あいる",},
        [164] = {164,"安次郎","ちづる",},
        [165] = {165,"龍一郎","オリビア",},
        [166] = {166,"龍次郎","アメリア",},
        [167] = {167,"龍二郎","アイラ",},
        [168] = {168,"オリバー","アヴァ",},
        [169] = {169,"ジョージ","エミリー",},
        [170] = {170,"ハリー","グレース",},
        [171] = {171,"レオ","ミア",},
        [172] = {172,"フレディ","ポピー",},
        [173] = {173,"アルフィ","エラ",},
        [174] = {174,"アーチー","リリー",},
        [175] = {175,"セオ","エヴィー",},
        [176] = {176,"オスカー","イザベラ",},
        [177] = {177,"アーサー","フレイヤ",},
        [178] = {178,"トーマス","ハーパー",},
        [179] = {179,"ローガン","ウィロウ",},
        [180] = {180,"ヘンリー","ジェシカ",},
        [181] = {181,"ダニエル","ロージー",},
        [182] = {182,"ジョセフ","デイジー",},
        [183] = {183,"トミー","アリス",},
        [184] = {184,"アーロ","エルジー",},
        [185] = {185,"レジー","シエナ",},
        [186] = {186,"カーター","イヴリン",},
        [187] = {187,"アルビー","アリア",},
        [188] = {188,"ルーイ","ルビー",},
        [189] = {189,"トビー","イザベル",},
        [190] = {190,"ルーベン","エスメ",},
        [191] = {191,"ジュード","マチルダ",},
        [192] = {192,"ハーリー","ミリー",},
        [193] = {193,"ルカ","エヴァ",},
        [194] = {194,"セオドア","ライラ",},
        [195] = {195,"ローマン","クロエ",},
        [196] = {196,"ボビー","ルナ",},
        [197] = {197,"カレブ","メイジー",},
    }
}

-- index
local __index_id = {
    [1] = 1,
    [10] = 10,
    [100] = 100,
    [101] = 101,
    [102] = 102,
    [103] = 103,
    [104] = 104,
    [105] = 105,
    [106] = 106,
    [107] = 107,
    [108] = 108,
    [109] = 109,
    [11] = 11,
    [110] = 110,
    [111] = 111,
    [112] = 112,
    [113] = 113,
    [114] = 114,
    [115] = 115,
    [116] = 116,
    [117] = 117,
    [118] = 118,
    [119] = 119,
    [12] = 12,
    [120] = 120,
    [121] = 121,
    [122] = 122,
    [123] = 123,
    [124] = 124,
    [125] = 125,
    [126] = 126,
    [127] = 127,
    [128] = 128,
    [129] = 129,
    [13] = 13,
    [130] = 130,
    [131] = 131,
    [132] = 132,
    [133] = 133,
    [134] = 134,
    [135] = 135,
    [136] = 136,
    [137] = 137,
    [138] = 138,
    [139] = 139,
    [14] = 14,
    [140] = 140,
    [141] = 141,
    [142] = 142,
    [143] = 143,
    [144] = 144,
    [145] = 145,
    [146] = 146,
    [147] = 147,
    [148] = 148,
    [149] = 149,
    [15] = 15,
    [150] = 150,
    [151] = 151,
    [152] = 152,
    [153] = 153,
    [154] = 154,
    [155] = 155,
    [156] = 156,
    [157] = 157,
    [158] = 158,
    [159] = 159,
    [16] = 16,
    [160] = 160,
    [161] = 161,
    [162] = 162,
    [163] = 163,
    [164] = 164,
    [165] = 165,
    [166] = 166,
    [167] = 167,
    [168] = 168,
    [169] = 169,
    [17] = 17,
    [170] = 170,
    [171] = 171,
    [172] = 172,
    [173] = 173,
    [174] = 174,
    [175] = 175,
    [176] = 176,
    [177] = 177,
    [178] = 178,
    [179] = 179,
    [18] = 18,
    [180] = 180,
    [181] = 181,
    [182] = 182,
    [183] = 183,
    [184] = 184,
    [185] = 185,
    [186] = 186,
    [187] = 187,
    [188] = 188,
    [189] = 189,
    [19] = 19,
    [190] = 190,
    [191] = 191,
    [192] = 192,
    [193] = 193,
    [194] = 194,
    [195] = 195,
    [196] = 196,
    [197] = 197,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [8] = 8,
    [80] = 80,
    [81] = 81,
    [82] = 82,
    [83] = 83,
    [84] = 84,
    [85] = 85,
    [86] = 86,
    [87] = 87,
    [88] = 88,
    [89] = 89,
    [9] = 9,
    [90] = 90,
    [91] = 91,
    [92] = 92,
    [93] = 93,
    [94] = 94,
    [95] = 95,
    [96] = 96,
    [97] = 97,
    [98] = 98,
    [99] = 99,

}

-- index mainkey map
local __main_key_map = {
    [1] = 1,
    [10] = 10,
    [100] = 100,
    [101] = 101,
    [102] = 102,
    [103] = 103,
    [104] = 104,
    [105] = 105,
    [106] = 106,
    [107] = 107,
    [108] = 108,
    [109] = 109,
    [11] = 11,
    [110] = 110,
    [111] = 111,
    [112] = 112,
    [113] = 113,
    [114] = 114,
    [115] = 115,
    [116] = 116,
    [117] = 117,
    [118] = 118,
    [119] = 119,
    [12] = 12,
    [120] = 120,
    [121] = 121,
    [122] = 122,
    [123] = 123,
    [124] = 124,
    [125] = 125,
    [126] = 126,
    [127] = 127,
    [128] = 128,
    [129] = 129,
    [13] = 13,
    [130] = 130,
    [131] = 131,
    [132] = 132,
    [133] = 133,
    [134] = 134,
    [135] = 135,
    [136] = 136,
    [137] = 137,
    [138] = 138,
    [139] = 139,
    [14] = 14,
    [140] = 140,
    [141] = 141,
    [142] = 142,
    [143] = 143,
    [144] = 144,
    [145] = 145,
    [146] = 146,
    [147] = 147,
    [148] = 148,
    [149] = 149,
    [15] = 15,
    [150] = 150,
    [151] = 151,
    [152] = 152,
    [153] = 153,
    [154] = 154,
    [155] = 155,
    [156] = 156,
    [157] = 157,
    [158] = 158,
    [159] = 159,
    [16] = 16,
    [160] = 160,
    [161] = 161,
    [162] = 162,
    [163] = 163,
    [164] = 164,
    [165] = 165,
    [166] = 166,
    [167] = 167,
    [168] = 168,
    [169] = 169,
    [17] = 17,
    [170] = 170,
    [171] = 171,
    [172] = 172,
    [173] = 173,
    [174] = 174,
    [175] = 175,
    [176] = 176,
    [177] = 177,
    [178] = 178,
    [179] = 179,
    [18] = 18,
    [180] = 180,
    [181] = 181,
    [182] = 182,
    [183] = 183,
    [184] = 184,
    [185] = 185,
    [186] = 186,
    [187] = 187,
    [188] = 188,
    [189] = 189,
    [19] = 19,
    [190] = 190,
    [191] = 191,
    [192] = 192,
    [193] = 193,
    [194] = 194,
    [195] = 195,
    [196] = 196,
    [197] = 197,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [8] = 8,
    [80] = 80,
    [81] = 81,
    [82] = 82,
    [83] = 83,
    [84] = 84,
    [85] = 85,
    [86] = 86,
    [87] = 87,
    [88] = 88,
    [89] = 89,
    [9] = 9,
    [90] = 90,
    [91] = 91,
    [92] = 92,
    [93] = 93,
    [94] = 94,
    [95] = 95,
    [96] = 96,
    [97] = 97,
    [98] = 98,
    [99] = 99,

}

-- metatable
local mt = { 
    __index = function(t, k) 
        local key_map = t._raw_key_map
        assert(key_map[k], "cannot find " .. k .. " in name3_name")
        if _lang ~= "cn" and _isDataExist  and t._data_key_map[k] then
            return t._data[t._data_key_map[k]]
        end
        if _lang ~= "cn" and _isExist  and t._lang_key_map[k] then
            return t._lang[t._lang_key_map[k]]
        end
        return t._raw[key_map[k]]
    end
}

-- 
function name3_name.length()
    return #name3_name._data
end

-- 
function name3_name.hasKey(k)
    if __key_map[k] == nil then
        return false
    else
        return true
    end
end

--
function name3_name.isVersionValid(v)
    if name3_name.version then
        if v then
            return name3_name.version <= v
        else
            return false
        end
    else
        return true
    end
end

--
function name3_name.indexOf(index)
    if index == nil or not name3_name._data[index] then
        return nil
    end
    if Lang.lang ~= _lang then 
        _lang = Lang.lang
        if Lang.lang ~= "cn" then
            _isDataExist = Lang.isFileExist("app/i18n/".. _lang .."/data/name3_name.lua")
            _isExist = Lang.isFileExist("app/i18n/".. _lang .."/config/name3_name.lua")
            _isBaseExist =  Lang.isFileExist("app/i18n/".. _lang .."/base/name3_name.lua")

            if _isDataExist then
                local table = require( "app.i18n.".. _lang ..".data." .. "name3_name" )
                _isDataExist = name3_name.isVersionValid(table.version)
            end
            if _isBaseExist then
                local table = require( "app.i18n.".. _lang ..".base." .. "name3_name" )
                _isBaseExist = name3_name.isVersionValid(table.version)
            end
            if _isExist then
                local table = require( "app.i18n.".. _lang ..".config." .. "name3_name" )
                _isExist = name3_name.isVersionValid(table.version)
            end
        end
    end
    local config = {_raw = nil,_raw_key_map = __key_map,_lang = nil,_lang_key_map = nil,_data = nil,_data_key_map = nil}
    if _lang ~= "cn" and _isDataExist then
        local table = require( "app.i18n.".. _lang ..".data." .. "name3_name" )
        local main_key = __main_key_map[index]
		local index_key = "__index_id"
        local data_index = table[index_key][main_key]
        config._data = table._data[data_index]
        config._data_key_map = table.__key_map
    end

    if _lang ~= "cn" and _isExist then
        local table = require( "app.i18n.".. _lang ..".config." .. "name3_name" )
        local main_key = __main_key_map[index]
		local index_key = "__index_id"
        local lang_index = table[index_key][main_key]
        config._lang = table._data[lang_index]
        config._lang_key_map = table.__key_map
    end
    config._raw = name3_name._data[index]
    if _lang ~= "cn" and _isBaseExist then
        local table_base = require( "app.i18n.".. _lang ..".base." .. "name3_name" )
        config._raw = table_base._data[index] 
    end
    return setmetatable(config, mt)
end

--
function name3_name.get(id)
    
    return name3_name.indexOf(__index_id[id])
        
end

--
function name3_name.set(id, key, value)
    local record = name3_name.get(id)
    if record then
        if _lang ~= "cn" and _isDataExist then
            local keyIndex =  record._data_key_map[key]
            if keyIndex then
                record._data[keyIndex] = value
                return
            end
        end
        if _lang ~= "cn" and _isExist then
            local keyIndex =  record._lang_key_map[key]
            if keyIndex then
                record._lang[keyIndex] = value
                return
            end
        end
        local keyIndex = record._raw_key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end

--
function name3_name.index()
    return __index_id
end

return name3_name